DanielMartensson/STM32-Computer/STM32CubeIDE/STM32-Computer-Firmware/CA7/tf-a-2.8.15-r2/tf-a-stm32mp-v2.8.15-stm32mp-r2/include/drivers/st/stm32mp2_rcc.h
/*
 * Copyright (c) 2018-2021, STMicroelectronics - All Rights Reserved
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef STM32MP2_RCC_H
#define STM32MP2_RCC_H

#include <lib/utils_def.h>

#define RCC_SECCFGR0				U(0x0)
#define RCC_SECCFGR1				U(0x4)
#define RCC_SECCFGR2				U(0x8)
#define RCC_SECCFGR3				U(0xC)
#define RCC_PRIVCFGR0				U(0x10)
#define RCC_PRIVCFGR1				U(0x14)
#define RCC_PRIVCFGR2				U(0x18)
#define RCC_PRIVCFGR3				U(0x1C)
#define RCC_RCFGLOCKR0				U(0x20)
#define RCC_RCFGLOCKR1				U(0x24)
#define RCC_RCFGLOCKR2				U(0x28)
#define RCC_RCFGLOCKR3				U(0x2C)
#define RCC_R0CIDCFGR				U(0x30)
#define RCC_R0SEMCR				U(0x34)
#define RCC_R1CIDCFGR				U(0x38)
#define RCC_R1SEMCR				U(0x3C)
#define RCC_R2CIDCFGR				U(0x40)
#define RCC_R2SEMCR				U(0x44)
#define RCC_R3CIDCFGR				U(0x48)
#define RCC_R3SEMCR				U(0x4C)
#define RCC_R4CIDCFGR				U(0x50)
#define RCC_R4SEMCR				U(0x54)
#define RCC_R5CIDCFGR				U(0x58)
#define RCC_R5SEMCR				U(0x5C)
#define RCC_R6CIDCFGR				U(0x60)
#define RCC_R6SEMCR				U(0x64)
#define RCC_R7CIDCFGR				U(0x68)
#define RCC_R7SEMCR				U(0x6C)
#define RCC_R8CIDCFGR				U(0x70)
#define RCC_R8SEMCR				U(0x74)
#define RCC_R9CIDCFGR				U(0x78)
#define RCC_R9SEMCR				U(0x7C)
#define RCC_R10CIDCFGR				U(0x80)
#define RCC_R10SEMCR				U(0x84)
#define RCC_R11CIDCFGR				U(0x88)
#define RCC_R11SEMCR				U(0x8C)
#define RCC_R12CIDCFGR				U(0x90)
#define RCC_R12SEMCR				U(0x94)
#define RCC_R13CIDCFGR				U(0x98)
#define RCC_R13SEMCR				U(0x9C)
#define RCC_R14CIDCFGR				U(0xA0)
#define RCC_R14SEMCR				U(0xA4)
#define RCC_R15CIDCFGR				U(0xA8)
#define RCC_R15SEMCR				U(0xAC)
#define RCC_R16CIDCFGR				U(0xB0)
#define RCC_R16SEMCR				U(0xB4)
#define RCC_R17CIDCFGR				U(0xB8)
#define RCC_R17SEMCR				U(0xBC)
#define RCC_R18CIDCFGR				U(0xC0)
#define RCC_R18SEMCR				U(0xC4)
#define RCC_R19CIDCFGR				U(0xC8)
#define RCC_R19SEMCR				U(0xCC)
#define RCC_R20CIDCFGR				U(0xD0)
#define RCC_R20SEMCR				U(0xD4)
#define RCC_R21CIDCFGR				U(0xD8)
#define RCC_R21SEMCR				U(0xDC)
#define RCC_R22CIDCFGR				U(0xE0)
#define RCC_R22SEMCR				U(0xE4)
#define RCC_R23CIDCFGR				U(0xE8)
#define RCC_R23SEMCR				U(0xEC)
#define RCC_R24CIDCFGR				U(0xF0)
#define RCC_R24SEMCR				U(0xF4)
#define RCC_R25CIDCFGR				U(0xF8)
#define RCC_R25SEMCR				U(0xFC)
#define RCC_R26CIDCFGR				U(0x100)
#define RCC_R26SEMCR				U(0x104)
#define RCC_R27CIDCFGR				U(0x108)
#define RCC_R27SEMCR				U(0x10C)
#define RCC_R28CIDCFGR				U(0x110)
#define RCC_R28SEMCR				U(0x114)
#define RCC_R29CIDCFGR				U(0x118)
#define RCC_R29SEMCR				U(0x11C)
#define RCC_R30CIDCFGR				U(0x120)
#define RCC_R30SEMCR				U(0x124)
#define RCC_R31CIDCFGR				U(0x128)
#define RCC_R31SEMCR				U(0x12C)
#define RCC_R32CIDCFGR				U(0x130)
#define RCC_R32SEMCR				U(0x134)
#define RCC_R33CIDCFGR				U(0x138)
#define RCC_R33SEMCR				U(0x13C)
#define RCC_R34CIDCFGR				U(0x140)
#define RCC_R34SEMCR				U(0x144)
#define RCC_R35CIDCFGR				U(0x148)
#define RCC_R35SEMCR				U(0x14C)
#define RCC_R36CIDCFGR				U(0x150)
#define RCC_R36SEMCR				U(0x154)
#define RCC_R37CIDCFGR				U(0x158)
#define RCC_R37SEMCR				U(0x15C)
#define RCC_R38CIDCFGR				U(0x160)
#define RCC_R38SEMCR				U(0x164)
#define RCC_R39CIDCFGR				U(0x168)
#define RCC_R39SEMCR				U(0x16C)
#define RCC_R40CIDCFGR				U(0x170)
#define RCC_R40SEMCR				U(0x174)
#define RCC_R41CIDCFGR				U(0x178)
#define RCC_R41SEMCR				U(0x17C)
#define RCC_R42CIDCFGR				U(0x180)
#define RCC_R42SEMCR				U(0x184)
#define RCC_R43CIDCFGR				U(0x188)
#define RCC_R43SEMCR				U(0x18C)
#define RCC_R44CIDCFGR				U(0x190)
#define RCC_R44SEMCR				U(0x194)
#define RCC_R45CIDCFGR				U(0x198)
#define RCC_R45SEMCR				U(0x19C)
#define RCC_R46CIDCFGR				U(0x1A0)
#define RCC_R46SEMCR				U(0x1A4)
#define RCC_R47CIDCFGR				U(0x1A8)
#define RCC_R47SEMCR				U(0x1AC)
#define RCC_R48CIDCFGR				U(0x1B0)
#define RCC_R48SEMCR				U(0x1B4)
#define RCC_R49CIDCFGR				U(0x1B8)
#define RCC_R49SEMCR				U(0x1BC)
#define RCC_R50CIDCFGR				U(0x1C0)
#define RCC_R50SEMCR				U(0x1C4)
#define RCC_R51CIDCFGR				U(0x1C8)
#define RCC_R51SEMCR				U(0x1CC)
#define RCC_R52CIDCFGR				U(0x1D0)
#define RCC_R52SEMCR				U(0x1D4)
#define RCC_R53CIDCFGR				U(0x1D8)
#define RCC_R53SEMCR				U(0x1DC)
#define RCC_R54CIDCFGR				U(0x1E0)
#define RCC_R54SEMCR				U(0x1E4)
#define RCC_R55CIDCFGR				U(0x1E8)
#define RCC_R55SEMCR				U(0x1EC)
#define RCC_R56CIDCFGR				U(0x1F0)
#define RCC_R56SEMCR				U(0x1F4)
#define RCC_R57CIDCFGR				U(0x1F8)
#define RCC_R57SEMCR				U(0x1FC)
#define RCC_R58CIDCFGR				U(0x200)
#define RCC_R58SEMCR				U(0x204)
#define RCC_R59CIDCFGR				U(0x208)
#define RCC_R59SEMCR				U(0x20C)
#define RCC_R60CIDCFGR				U(0x210)
#define RCC_R60SEMCR				U(0x214)
#define RCC_R61CIDCFGR				U(0x218)
#define RCC_R61SEMCR				U(0x21C)
#define RCC_R62CIDCFGR				U(0x220)
#define RCC_R62SEMCR				U(0x224)
#define RCC_R63CIDCFGR				U(0x228)
#define RCC_R63SEMCR				U(0x22C)
#define RCC_R64CIDCFGR				U(0x230)
#define RCC_R64SEMCR				U(0x234)
#define RCC_R65CIDCFGR				U(0x238)
#define RCC_R65SEMCR				U(0x23C)
#define RCC_R66CIDCFGR				U(0x240)
#define RCC_R66SEMCR				U(0x244)
#define RCC_R67CIDCFGR				U(0x248)
#define RCC_R67SEMCR				U(0x24C)
#define RCC_R68CIDCFGR				U(0x250)
#define RCC_R68SEMCR				U(0x254)
#define RCC_R69CIDCFGR				U(0x258)
#define RCC_R69SEMCR				U(0x25C)
#define RCC_R70CIDCFGR				U(0x260)
#define RCC_R70SEMCR				U(0x264)
#define RCC_R71CIDCFGR				U(0x268)
#define RCC_R71SEMCR				U(0x26C)
#define RCC_R72CIDCFGR				U(0x270)
#define RCC_R72SEMCR				U(0x274)
#define RCC_R73CIDCFGR				U(0x278)
#define RCC_R73SEMCR				U(0x27C)
#define RCC_R74CIDCFGR				U(0x280)
#define RCC_R74SEMCR				U(0x284)
#define RCC_R75CIDCFGR				U(0x288)
#define RCC_R75SEMCR				U(0x28C)
#define RCC_R76CIDCFGR				U(0x290)
#define RCC_R76SEMCR				U(0x294)
#define RCC_R77CIDCFGR				U(0x298)
#define RCC_R77SEMCR				U(0x29C)
#define RCC_R78CIDCFGR				U(0x2A0)
#define RCC_R78SEMCR				U(0x2A4)
#define RCC_R79CIDCFGR				U(0x2A8)
#define RCC_R79SEMCR				U(0x2AC)
#define RCC_R80CIDCFGR				U(0x2B0)
#define RCC_R80SEMCR				U(0x2B4)
#define RCC_R81CIDCFGR				U(0x2B8)
#define RCC_R81SEMCR				U(0x2BC)
#define RCC_R82CIDCFGR				U(0x2C0)
#define RCC_R82SEMCR				U(0x2C4)
#define RCC_R83CIDCFGR				U(0x2C8)
#define RCC_R83SEMCR				U(0x2CC)
#define RCC_R84CIDCFGR				U(0x2D0)
#define RCC_R84SEMCR				U(0x2D4)
#define RCC_R85CIDCFGR				U(0x2D8)
#define RCC_R85SEMCR				U(0x2DC)
#define RCC_R86CIDCFGR				U(0x2E0)
#define RCC_R86SEMCR				U(0x2E4)
#define RCC_R87CIDCFGR				U(0x2E8)
#define RCC_R87SEMCR				U(0x2EC)
#define RCC_R88CIDCFGR				U(0x2F0)
#define RCC_R88SEMCR				U(0x2F4)
#define RCC_R89CIDCFGR				U(0x2F8)
#define RCC_R89SEMCR				U(0x2FC)
#define RCC_R90CIDCFGR				U(0x300)
#define RCC_R90SEMCR				U(0x304)
#define RCC_R91CIDCFGR				U(0x308)
#define RCC_R91SEMCR				U(0x30C)
#define RCC_R92CIDCFGR				U(0x310)
#define RCC_R92SEMCR				U(0x314)
#define RCC_R93CIDCFGR				U(0x318)
#define RCC_R93SEMCR				U(0x31C)
#define RCC_R94CIDCFGR				U(0x320)
#define RCC_R94SEMCR				U(0x324)
#define RCC_R95CIDCFGR				U(0x328)
#define RCC_R95SEMCR				U(0x32C)
#define RCC_R96CIDCFGR				U(0x330)
#define RCC_R96SEMCR				U(0x334)
#define RCC_R97CIDCFGR				U(0x338)
#define RCC_R97SEMCR				U(0x33C)
#define RCC_R98CIDCFGR				U(0x340)
#define RCC_R98SEMCR				U(0x344)
#define RCC_R99CIDCFGR				U(0x348)
#define RCC_R99SEMCR				U(0x34C)
#define RCC_R100CIDCFGR				U(0x350)
#define RCC_R100SEMCR				U(0x354)
#define RCC_R101CIDCFGR				U(0x358)
#define RCC_R101SEMCR				U(0x35C)
#define RCC_R102CIDCFGR				U(0x360)
#define RCC_R102SEMCR				U(0x364)
#define RCC_R103CIDCFGR				U(0x368)
#define RCC_R103SEMCR				U(0x36C)
#define RCC_R104CIDCFGR				U(0x370)
#define RCC_R104SEMCR				U(0x374)
#define RCC_R105CIDCFGR				U(0x378)
#define RCC_R105SEMCR				U(0x37C)
#define RCC_R106CIDCFGR				U(0x380)
#define RCC_R106SEMCR				U(0x384)
#define RCC_R107CIDCFGR				U(0x388)
#define RCC_R107SEMCR				U(0x38C)
#define RCC_R108CIDCFGR				U(0x390)
#define RCC_R108SEMCR				U(0x394)
#define RCC_R109CIDCFGR				U(0x398)
#define RCC_R109SEMCR				U(0x39C)
#define RCC_R110CIDCFGR				U(0x3A0)
#define RCC_R110SEMCR				U(0x3A4)
#define RCC_R111CIDCFGR				U(0x3A8)
#define RCC_R111SEMCR				U(0x3AC)
#define RCC_R112CIDCFGR				U(0x3B0)
#define RCC_R112SEMCR				U(0x3B4)
#define RCC_R113CIDCFGR				U(0x3B8)
#define RCC_R113SEMCR				U(0x3BC)
#define RCC_GRSTCSETR				U(0x400)
#define RCC_C1RSTCSETR				U(0x404)
#define RCC_C1P1RSTCSETR			U(0x408)
#define RCC_C2RSTCSETR				U(0x40C)
#define RCC_HWRSTSCLRR				U(0x410)
#define RCC_C1HWRSTSCLRR			U(0x414)
#define RCC_C2HWRSTSCLRR			U(0x418)
#define RCC_C1BOOTRSTSSETR			U(0x41C)
#define RCC_C1BOOTRSTSCLRR			U(0x420)
#define RCC_C2BOOTRSTSSETR			U(0x424)
#define RCC_C2BOOTRSTSCLRR			U(0x428)
#define RCC_C1SREQSETR				U(0x42C)
#define RCC_C1SREQCLRR				U(0x430)
#define RCC_CPUBOOTCR				U(0x434)
#define RCC_STBYBOOTCR				U(0x438)
#define RCC_LEGBOOTCR				U(0x43C)
#define RCC_BDCR				U(0x440)
#define RCC_D3DCR				U(0x444)
#define RCC_D3DSR				U(0x448)
#define RCC_RDCR				U(0x44C)
#define RCC_C1MSRDCR				U(0x450)
#define RCC_PWRLPDLYCR				U(0x454)
#define RCC_C1CIESETR				U(0x458)
#define RCC_C1CIFCLRR				U(0x45C)
#define RCC_C2CIESETR				U(0x460)
#define RCC_C2CIFCLRR				U(0x464)
#define RCC_IWDGC1FZSETR			U(0x468)
#define RCC_IWDGC1FZCLRR			U(0x46C)
#define RCC_IWDGC1CFGSETR			U(0x470)
#define RCC_IWDGC1CFGCLRR			U(0x474)
#define RCC_IWDGC2FZSETR			U(0x478)
#define RCC_IWDGC2FZCLRR			U(0x47C)
#define RCC_IWDGC2CFGSETR			U(0x480)
#define RCC_IWDGC2CFGCLRR			U(0x484)
#define RCC_IWDGC3CFGSETR			U(0x488)
#define RCC_IWDGC3CFGCLRR			U(0x48C)
#define RCC_C3CFGR				U(0x490)
#define RCC_MCO1CFGR				U(0x494)
#define RCC_MCO2CFGR				U(0x498)
#define RCC_OCENSETR				U(0x49C)
#define RCC_OCENCLRR				U(0x4A0)
#define RCC_OCRDYR				U(0x4A4)
#define RCC_HSICFGR				U(0x4A8)
#define RCC_CSICFGR				U(0x4AC)
#define RCC_RTCDIVR				U(0x4B0)
#define RCC_APB1DIVR				U(0x4B4)
#define RCC_APB2DIVR				U(0x4B8)
#define RCC_APB3DIVR				U(0x4BC)
#define RCC_APB4DIVR				U(0x4C0)
#define RCC_APBDBGDIVR				U(0x4C4)
#define RCC_TIMG1PRER				U(0x4C8)
#define RCC_TIMG2PRER				U(0x4CC)
#define RCC_LSMCUDIVR				U(0x4D0)
#define RCC_DDRCPCFGR				U(0x4D4)
#define RCC_DDRCAPBCFGR				U(0x4D8)
#define RCC_DDRPHYCAPBCFGR			U(0x4DC)
#define RCC_DDRPHYCCFGR				U(0x4E0)
#define RCC_DDRCFGR				U(0x4E4)
#define RCC_DDRITFCFGR				U(0x4E8)
#define RCC_SYSRAMCFGR				U(0x4F0)
#define RCC_VDERAMCFGR				U(0x4F4)
#define RCC_SRAM1CFGR				U(0x4F8)
#define RCC_SRAM2CFGR				U(0x4FC)
#define RCC_RETRAMCFGR				U(0x500)
#define RCC_BKPSRAMCFGR				U(0x504)
#define RCC_LPSRAM1CFGR				U(0x508)
#define RCC_LPSRAM2CFGR				U(0x50C)
#define RCC_LPSRAM3CFGR				U(0x510)
#define RCC_OSPI1CFGR				U(0x514)
#define RCC_OSPI2CFGR				U(0x518)
#define RCC_FMCCFGR				U(0x51C)
#define RCC_DBGCFGR				U(0x520)
#define RCC_STM500CFGR				U(0x524)
#define RCC_ETRCFGR				U(0x528)
#define RCC_GPIOACFGR				U(0x52C)
#define RCC_GPIOBCFGR				U(0x530)
#define RCC_GPIOCCFGR				U(0x534)
#define RCC_GPIODCFGR				U(0x538)
#define RCC_GPIOECFGR				U(0x53C)
#define RCC_GPIOFCFGR				U(0x540)
#define RCC_GPIOGCFGR				U(0x544)
#define RCC_GPIOHCFGR				U(0x548)
#define RCC_GPIOICFGR				U(0x54C)
#define RCC_GPIOJCFGR				U(0x550)
#define RCC_GPIOKCFGR				U(0x554)
#define RCC_GPIOZCFGR				U(0x558)
#define RCC_HPDMA1CFGR				U(0x55C)
#define RCC_HPDMA2CFGR				U(0x560)
#define RCC_HPDMA3CFGR				U(0x564)
#define RCC_LPDMACFGR				U(0x568)
#define RCC_HSEMCFGR				U(0x56C)
#define RCC_IPCC1CFGR				U(0x570)
#define RCC_IPCC2CFGR				U(0x574)
#define RCC_RTCCFGR				U(0x578)
#define RCC_SYSCPU1CFGR				U(0x580)
#define RCC_BSECCFGR				U(0x584)
#define RCC_IS2MCFGR				U(0x58C)
#define RCC_PLL2CFGR1				U(0x590)
#define RCC_PLL2CFGR2				U(0x594)
#define RCC_PLL2CFGR3				U(0x598)
#define RCC_PLL2CFGR4				U(0x59C)
#define RCC_PLL2CFGR5				U(0x5A0)
#define RCC_PLL2CFGR6				U(0x5A8)
#define RCC_PLL2CFGR7				U(0x5AC)
#define RCC_PLL3CFGR1				U(0x5B8)
#define RCC_PLL3CFGR2				U(0x5BC)
#define RCC_PLL3CFGR3				U(0x5C0)
#define RCC_PLL3CFGR4				U(0x5C4)
#define RCC_PLL3CFGR5				U(0x5C8)
#define RCC_PLL3CFGR6				U(0x5D0)
#define RCC_PLL3CFGR7				U(0x5D4)
#define RCC_HSIFMONCR				U(0x5E0)
#define RCC_HSIFVALR				U(0x5E4)
#define RCC_TIM1CFGR				U(0x700)
#define RCC_TIM2CFGR				U(0x704)
#define RCC_TIM3CFGR				U(0x708)
#define RCC_TIM4CFGR				U(0x70C)
#define RCC_TIM5CFGR				U(0x710)
#define RCC_TIM6CFGR				U(0x714)
#define RCC_TIM7CFGR				U(0x718)
#define RCC_TIM8CFGR				U(0x71C)
#define RCC_TIM10CFGR				U(0x720)
#define RCC_TIM11CFGR				U(0x724)
#define RCC_TIM12CFGR				U(0x728)
#define RCC_TIM13CFGR				U(0x72C)
#define RCC_TIM14CFGR				U(0x730)
#define RCC_TIM15CFGR				U(0x734)
#define RCC_TIM16CFGR				U(0x738)
#define RCC_TIM17CFGR				U(0x73C)
#define RCC_TIM20CFGR				U(0x740)
#define RCC_LPTIM1CFGR				U(0x744)
#define RCC_LPTIM2CFGR				U(0x748)
#define RCC_LPTIM3CFGR				U(0x74C)
#define RCC_LPTIM4CFGR				U(0x750)
#define RCC_LPTIM5CFGR				U(0x754)
#define RCC_SPI1CFGR				U(0x758)
#define RCC_SPI2CFGR				U(0x75C)
#define RCC_SPI3CFGR				U(0x760)
#define RCC_SPI4CFGR				U(0x764)
#define RCC_SPI5CFGR				U(0x768)
#define RCC_SPI6CFGR				U(0x76C)
#define RCC_SPI7CFGR				U(0x770)
#define RCC_SPI8CFGR				U(0x774)
#define RCC_SPDIFRXCFGR				U(0x778)
#define RCC_USART1CFGR				U(0x77C)
#define RCC_USART2CFGR				U(0x780)
#define RCC_USART3CFGR				U(0x784)
#define RCC_UART4CFGR				U(0x788)
#define RCC_UART5CFGR				U(0x78C)
#define RCC_USART6CFGR				U(0x790)
#define RCC_UART7CFGR				U(0x794)
#define RCC_UART8CFGR				U(0x798)
#define RCC_UART9CFGR				U(0x79C)
#define RCC_LPUART1CFGR				U(0x7A0)
#define RCC_I2C1CFGR				U(0x7A4)
#define RCC_I2C2CFGR				U(0x7A8)
#define RCC_I2C3CFGR				U(0x7AC)
#define RCC_I2C4CFGR				U(0x7B0)
#define RCC_I2C5CFGR				U(0x7B4)
#define RCC_I2C6CFGR				U(0x7B8)
#define RCC_I2C7CFGR				U(0x7BC)
#define RCC_I2C8CFGR				U(0x7C0)
#define RCC_SAI1CFGR				U(0x7C4)
#define RCC_SAI2CFGR				U(0x7C8)
#define RCC_SAI3CFGR				U(0x7CC)
#define RCC_SAI4CFGR				U(0x7D0)
#define RCC_MDF1CFGR				U(0x7D8)
#define RCC_ADF1CFGR				U(0x7DC)
#define RCC_FDCANCFGR				U(0x7E0)
#define RCC_HDPCFGR				U(0x7E4)
#define RCC_ADC12CFGR				U(0x7E8)
#define RCC_ADC3CFGR				U(0x7EC)
#define RCC_ETH1CFGR				U(0x7F0)
#define RCC_ETH2CFGR				U(0x7F4)
#define RCC_USB2CFGR				U(0x7FC)
#define RCC_USB2PHY1CFGR			U(0x800)
#define RCC_USB2PHY2CFGR			U(0x804)
#define RCC_USB3DRCFGR				U(0x808)
#define RCC_USB3PCIEPHYCFGR			U(0x80C)
#define RCC_PCIECFGR				U(0x810)
#define RCC_USBTCCFGR				U(0x814)
#define RCC_ETHSWCFGR				U(0x818)
#define RCC_ETHSWACMCFGR			U(0x81C)
#define RCC_ETHSWACMMSGCFGR			U(0x820)
#define RCC_STGENCFGR				U(0x824)
#define RCC_SDMMC1CFGR				U(0x830)
#define RCC_SDMMC2CFGR				U(0x834)
#define RCC_SDMMC3CFGR				U(0x838)
#define RCC_GPUCFGR				U(0x83C)
#define RCC_LTDCCFGR				U(0x840)
#define RCC_DSICFGR				U(0x844)
#define RCC_LVDSCFGR				U(0x850)
#define RCC_CSI2CFGR				U(0x858)
#define RCC_DCMIPPCFGR				U(0x85C)
#define RCC_CCICFGR				U(0x860)
#define RCC_VDECCFGR				U(0x864)
#define RCC_VENCCFGR				U(0x868)
#define RCC_RNGCFGR				U(0x870)
#define RCC_PKACFGR				U(0x874)
#define RCC_SAESCFGR				U(0x878)
#define RCC_HASHCFGR				U(0x87C)
#define RCC_CRYP1CFGR				U(0x880)
#define RCC_CRYP2CFGR				U(0x884)
#define RCC_IWDG1CFGR				U(0x888)
#define RCC_IWDG2CFGR				U(0x88C)
#define RCC_IWDG3CFGR				U(0x890)
#define RCC_IWDG4CFGR				U(0x894)
#define RCC_IWDG5CFGR				U(0x898)
#define RCC_WWDG1CFGR				U(0x89C)
#define RCC_WWDG2CFGR				U(0x8A0)
#define RCC_VREFCFGR				U(0x8A8)
#define RCC_TMPSENSCFGR				U(0x8AC)
#define RCC_CRCCFGR				U(0x8B4)
#define RCC_SERCCFGR				U(0x8B8)
#define RCC_OSPIIOMCFGR				U(0x8BC)
#define RCC_GICV2MCFGR				U(0x8C0)
#define RCC_I3C1CFGR				U(0x8C8)
#define RCC_I3C2CFGR				U(0x8CC)
#define RCC_I3C3CFGR				U(0x8D0)
#define RCC_I3C4CFGR				U(0x8D4)
#define RCC_MUXSELCFGR				U(0x1000)
#define RCC_XBAR0CFGR				U(0x1018)
#define RCC_XBAR1CFGR				U(0x101C)
#define RCC_XBAR2CFGR				U(0x1020)
#define RCC_XBAR3CFGR				U(0x1024)
#define RCC_XBAR4CFGR				U(0x1028)
#define RCC_XBAR5CFGR				U(0x102C)
#define RCC_XBAR6CFGR				U(0x1030)
#define RCC_XBAR7CFGR				U(0x1034)
#define RCC_XBAR8CFGR				U(0x1038)
#define RCC_XBAR9CFGR				U(0x103C)
#define RCC_XBAR10CFGR				U(0x1040)
#define RCC_XBAR11CFGR				U(0x1044)
#define RCC_XBAR12CFGR				U(0x1048)
#define RCC_XBAR13CFGR				U(0x104C)
#define RCC_XBAR14CFGR				U(0x1050)
#define RCC_XBAR15CFGR				U(0x1054)
#define RCC_XBAR16CFGR				U(0x1058)
#define RCC_XBAR17CFGR				U(0x105C)
#define RCC_XBAR18CFGR				U(0x1060)
#define RCC_XBAR19CFGR				U(0x1064)
#define RCC_XBAR20CFGR				U(0x1068)
#define RCC_XBAR21CFGR				U(0x106C)
#define RCC_XBAR22CFGR				U(0x1070)
#define RCC_XBAR23CFGR				U(0x1074)
#define RCC_XBAR24CFGR				U(0x1078)
#define RCC_XBAR25CFGR				U(0x107C)
#define RCC_XBAR26CFGR				U(0x1080)
#define RCC_XBAR27CFGR				U(0x1084)
#define RCC_XBAR28CFGR				U(0x1088)
#define RCC_XBAR29CFGR				U(0x108C)
#define RCC_XBAR30CFGR				U(0x1090)
#define RCC_XBAR31CFGR				U(0x1094)
#define RCC_XBAR32CFGR				U(0x1098)
#define RCC_XBAR33CFGR				U(0x109C)
#define RCC_XBAR34CFGR				U(0x10A0)
#define RCC_XBAR35CFGR				U(0x10A4)
#define RCC_XBAR36CFGR				U(0x10A8)
#define RCC_XBAR37CFGR				U(0x10AC)
#define RCC_XBAR38CFGR				U(0x10B0)
#define RCC_XBAR39CFGR				U(0x10B4)
#define RCC_XBAR40CFGR				U(0x10B8)
#define RCC_XBAR41CFGR				U(0x10BC)
#define RCC_XBAR42CFGR				U(0x10C0)
#define RCC_XBAR43CFGR				U(0x10C4)
#define RCC_XBAR44CFGR				U(0x10C8)
#define RCC_XBAR45CFGR				U(0x10CC)
#define RCC_XBAR46CFGR				U(0x10D0)
#define RCC_XBAR47CFGR				U(0x10D4)
#define RCC_XBAR48CFGR				U(0x10D8)
#define RCC_XBAR49CFGR				U(0x10DC)
#define RCC_XBAR50CFGR				U(0x10E0)
#define RCC_XBAR51CFGR				U(0x10E4)
#define RCC_XBAR52CFGR				U(0x10E8)
#define RCC_XBAR53CFGR				U(0x10EC)
#define RCC_XBAR54CFGR				U(0x10F0)
#define RCC_XBAR55CFGR				U(0x10F4)
#define RCC_XBAR56CFGR				U(0x10F8)
#define RCC_XBAR57CFGR				U(0x10FC)
#define RCC_XBAR58CFGR				U(0x1100)
#define RCC_XBAR59CFGR				U(0x1104)
#define RCC_XBAR60CFGR				U(0x1108)
#define RCC_XBAR61CFGR				U(0x110C)
#define RCC_XBAR62CFGR				U(0x1110)
#define RCC_XBAR63CFGR				U(0x1114)
#define RCC_PREDIV0CFGR				U(0x1118)
#define RCC_PREDIV1CFGR				U(0x111C)
#define RCC_PREDIV2CFGR				U(0x1120)
#define RCC_PREDIV3CFGR				U(0x1124)
#define RCC_PREDIV4CFGR				U(0x1128)
#define RCC_PREDIV5CFGR				U(0x112C)
#define RCC_PREDIV6CFGR				U(0x1130)
#define RCC_PREDIV7CFGR				U(0x1134)
#define RCC_PREDIV8CFGR				U(0x1138)
#define RCC_PREDIV9CFGR				U(0x113C)
#define RCC_PREDIV10CFGR			U(0x1140)
#define RCC_PREDIV11CFGR			U(0x1144)
#define RCC_PREDIV12CFGR			U(0x1148)
#define RCC_PREDIV13CFGR			U(0x114C)
#define RCC_PREDIV14CFGR			U(0x1150)
#define RCC_PREDIV15CFGR			U(0x1154)
#define RCC_PREDIV16CFGR			U(0x1158)
#define RCC_PREDIV17CFGR			U(0x115C)
#define RCC_PREDIV18CFGR			U(0x1160)
#define RCC_PREDIV19CFGR			U(0x1164)
#define RCC_PREDIV20CFGR			U(0x1168)
#define RCC_PREDIV21CFGR			U(0x116C)
#define RCC_PREDIV22CFGR			U(0x1170)
#define RCC_PREDIV23CFGR			U(0x1174)
#define RCC_PREDIV24CFGR			U(0x1178)
#define RCC_PREDIV25CFGR			U(0x117C)
#define RCC_PREDIV26CFGR			U(0x1180)
#define RCC_PREDIV27CFGR			U(0x1184)
#define RCC_PREDIV28CFGR			U(0x1188)
#define RCC_PREDIV29CFGR			U(0x118C)
#define RCC_PREDIV30CFGR			U(0x1190)
#define RCC_PREDIV31CFGR			U(0x1194)
#define RCC_PREDIV32CFGR			U(0x1198)
#define RCC_PREDIV33CFGR			U(0x119C)
#define RCC_PREDIV34CFGR			U(0x11A0)
#define RCC_PREDIV35CFGR			U(0x11A4)
#define RCC_PREDIV36CFGR			U(0x11A8)
#define RCC_PREDIV37CFGR			U(0x11AC)
#define RCC_PREDIV38CFGR			U(0x11B0)
#define RCC_PREDIV39CFGR			U(0x11B4)
#define RCC_PREDIV40CFGR			U(0x11B8)
#define RCC_PREDIV41CFGR			U(0x11BC)
#define RCC_PREDIV42CFGR			U(0x11C0)
#define RCC_PREDIV43CFGR			U(0x11C4)
#define RCC_PREDIV44CFGR			U(0x11C8)
#define RCC_PREDIV45CFGR			U(0x11CC)
#define RCC_PREDIV46CFGR			U(0x11D0)
#define RCC_PREDIV47CFGR			U(0x11D4)
#define RCC_PREDIV48CFGR			U(0x11D8)
#define RCC_PREDIV49CFGR			U(0x11DC)
#define RCC_PREDIV50CFGR			U(0x11E0)
#define RCC_PREDIV51CFGR			U(0x11E4)
#define RCC_PREDIV52CFGR			U(0x11E8)
#define RCC_PREDIV53CFGR			U(0x11EC)
#define RCC_PREDIV54CFGR			U(0x11F0)
#define RCC_PREDIV55CFGR			U(0x11F4)
#define RCC_PREDIV56CFGR			U(0x11F8)
#define RCC_PREDIV57CFGR			U(0x11FC)
#define RCC_PREDIV58CFGR			U(0x1200)
#define RCC_PREDIV59CFGR			U(0x1204)
#define RCC_PREDIV60CFGR			U(0x1208)
#define RCC_PREDIV61CFGR			U(0x120C)
#define RCC_PREDIV62CFGR			U(0x1210)
#define RCC_PREDIV63CFGR			U(0x1214)
#define RCC_PREDIVSR1				U(0x1218)
#define RCC_PREDIVSR2				U(0x121C)
#define RCC_FINDIV0CFGR				U(0x1224)
#define RCC_FINDIV1CFGR				U(0x1228)
#define RCC_FINDIV2CFGR				U(0x122C)
#define RCC_FINDIV3CFGR				U(0x1230)
#define RCC_FINDIV4CFGR				U(0x1234)
#define RCC_FINDIV5CFGR				U(0x1238)
#define RCC_FINDIV6CFGR				U(0x123C)
#define RCC_FINDIV7CFGR				U(0x1240)
#define RCC_FINDIV8CFGR				U(0x1244)
#define RCC_FINDIV9CFGR				U(0x1248)
#define RCC_FINDIV10CFGR			U(0x124C)
#define RCC_FINDIV11CFGR			U(0x1250)
#define RCC_FINDIV12CFGR			U(0x1254)
#define RCC_FINDIV13CFGR			U(0x1258)
#define RCC_FINDIV14CFGR			U(0x125C)
#define RCC_FINDIV15CFGR			U(0x1260)
#define RCC_FINDIV16CFGR			U(0x1264)
#define RCC_FINDIV17CFGR			U(0x1268)
#define RCC_FINDIV18CFGR			U(0x126C)
#define RCC_FINDIV19CFGR			U(0x1270)
#define RCC_FINDIV20CFGR			U(0x1274)
#define RCC_FINDIV21CFGR			U(0x1278)
#define RCC_FINDIV22CFGR			U(0x127C)
#define RCC_FINDIV23CFGR			U(0x1280)
#define RCC_FINDIV24CFGR			U(0x1284)
#define RCC_FINDIV25CFGR			U(0x1288)
#define RCC_FINDIV26CFGR			U(0x128C)
#define RCC_FINDIV27CFGR			U(0x1290)
#define RCC_FINDIV28CFGR			U(0x1294)
#define RCC_FINDIV29CFGR			U(0x1298)
#define RCC_FINDIV30CFGR			U(0x129C)
#define RCC_FINDIV31CFGR			U(0x12A0)
#define RCC_FINDIV32CFGR			U(0x12A4)
#define RCC_FINDIV33CFGR			U(0x12A8)
#define RCC_FINDIV34CFGR			U(0x12AC)
#define RCC_FINDIV35CFGR			U(0x12B0)
#define RCC_FINDIV36CFGR			U(0x12B4)
#define RCC_FINDIV37CFGR			U(0x12B8)
#define RCC_FINDIV38CFGR			U(0x12BC)
#define RCC_FINDIV39CFGR			U(0x12C0)
#define RCC_FINDIV40CFGR			U(0x12C4)
#define RCC_FINDIV41CFGR			U(0x12C8)
#define RCC_FINDIV42CFGR			U(0x12CC)
#define RCC_FINDIV43CFGR			U(0x12D0)
#define RCC_FINDIV44CFGR			U(0x12D4)
#define RCC_FINDIV45CFGR			U(0x12D8)
#define RCC_FINDIV46CFGR			U(0x12DC)
#define RCC_FINDIV47CFGR			U(0x12E0)
#define RCC_FINDIV48CFGR			U(0x12E4)
#define RCC_FINDIV49CFGR			U(0x12E8)
#define RCC_FINDIV50CFGR			U(0x12EC)
#define RCC_FINDIV51CFGR			U(0x12F0)
#define RCC_FINDIV52CFGR			U(0x12F4)
#define RCC_FINDIV53CFGR			U(0x12F8)
#define RCC_FINDIV54CFGR			U(0x12FC)
#define RCC_FINDIV55CFGR			U(0x1300)
#define RCC_FINDIV56CFGR			U(0x1304)
#define RCC_FINDIV57CFGR			U(0x1308)
#define RCC_FINDIV58CFGR			U(0x130C)
#define RCC_FINDIV59CFGR			U(0x1310)
#define RCC_FINDIV60CFGR			U(0x1314)
#define RCC_FINDIV61CFGR			U(0x1318)
#define RCC_FINDIV62CFGR			U(0x131C)
#define RCC_FINDIV63CFGR			U(0x1320)
#define RCC_FINDIVSR1				U(0x1324)
#define RCC_FINDIVSR2				U(0x1328)
#define RCC_FCALCOBS0CFGR			U(0x1340)
#define RCC_FCALCOBS1CFGR			U(0x1344)
#define RCC_FCALCREFCFGR			U(0x1348)
#define RCC_FCALCCR1				U(0x134C)
#define RCC_FCALCCR2				U(0x1354)
#define RCC_FCALCSR				U(0x1358)
#define RCC_PLL4CFGR1				U(0x1360)
#define RCC_PLL4CFGR2				U(0x1364)
#define RCC_PLL4CFGR3				U(0x1368)
#define RCC_PLL4CFGR4				U(0x136C)
#define RCC_PLL4CFGR5				U(0x1370)
#define RCC_PLL4CFGR6				U(0x1378)
#define RCC_PLL4CFGR7				U(0x137C)
#define RCC_PLL5CFGR1				U(0x1388)
#define RCC_PLL5CFGR2				U(0x138C)
#define RCC_PLL5CFGR3				U(0x1390)
#define RCC_PLL5CFGR4				U(0x1394)
#define RCC_PLL5CFGR5				U(0x1398)
#define RCC_PLL5CFGR6				U(0x13A0)
#define RCC_PLL5CFGR7				U(0x13A4)
#define RCC_PLL6CFGR1				U(0x13B0)
#define RCC_PLL6CFGR2				U(0x13B4)
#define RCC_PLL6CFGR3				U(0x13B8)
#define RCC_PLL6CFGR4				U(0x13BC)
#define RCC_PLL6CFGR5				U(0x13C0)
#define RCC_PLL6CFGR6				U(0x13C8)
#define RCC_PLL6CFGR7				U(0x13CC)
#define RCC_PLL7CFGR1				U(0x13D8)
