DanielMartensson/STM32-Computer/STM32CubeIDE/STM32-Computer-Firmware/CA7/tf-a-2.8.15-r2/tf-a-stm32mp-v2.8.15-stm32mp-r2/include/drivers/st/stm32mp2_rcc.h
#define RCC_PLL7CFGR2				U(0x13DC)
#define RCC_PLL7CFGR3				U(0x13E0)
#define RCC_PLL7CFGR4				U(0x13E4)
#define RCC_PLL7CFGR5				U(0x13E8)
#define RCC_PLL7CFGR6				U(0x13F0)
#define RCC_PLL7CFGR7				U(0x13F4)
#define RCC_PLL8CFGR1				U(0x1400)
#define RCC_PLL8CFGR2				U(0x1404)
#define RCC_PLL8CFGR3				U(0x1408)
#define RCC_PLL8CFGR4				U(0x140C)
#define RCC_PLL8CFGR5				U(0x1410)
#define RCC_PLL8CFGR6				U(0x1418)
#define RCC_PLL8CFGR7				U(0x141C)
#define RCC_VERR				U(0xFFF4)
#define RCC_IDR					U(0xFFF8)
#define RCC_SIDR				U(0xFFFC)

/* Offset between RCC_MP_xxxENSETR and RCC_MP_xxxENCLRR registers */
#define RCC_MP_ENCLRR_OFFSET			U(4)

/* RCC_SECCFGR3 register fields */
#define RCC_SECCFGR3_SEC_MASK			GENMASK(17, 0)
#define RCC_SECCFGR3_SEC_SHIFT			0

/* RCC_PRIVCFGR3 register fields */
#define RCC_PRIVCFGR3_PRIV_MASK			GENMASK(17, 0)
#define RCC_PRIVCFGR3_PRIV_SHIFT		0

/* RCC_RCFGLOCKR3 register fields */
#define RCC_RCFGLOCKR3_RLOCK_MASK		GENMASK(17, 0)
#define RCC_RCFGLOCKR3_RLOCK_SHIFT		0

/* RCC_R0CIDCFGR register fields */
#define RCC_R0CIDCFGR_CFEN			BIT(0)
#define RCC_R0CIDCFGR_SEM_EN			BIT(1)
#define RCC_R0CIDCFGR_SCID_MASK			GENMASK(6, 4)
#define RCC_R0CIDCFGR_SCID_SHIFT		4
#define RCC_R0CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R0CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R0SEMCR register fields */
#define RCC_R0SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R0SEMCR_SEMCID_MASK			GENMASK(6, 4)
#define RCC_R0SEMCR_SEMCID_SHIFT		4

/* RCC_R1CIDCFGR register fields */
#define RCC_R1CIDCFGR_CFEN			BIT(0)
#define RCC_R1CIDCFGR_SEM_EN			BIT(1)
#define RCC_R1CIDCFGR_SCID_MASK			GENMASK(6, 4)
#define RCC_R1CIDCFGR_SCID_SHIFT		4
#define RCC_R1CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R1CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R1SEMCR register fields */
#define RCC_R1SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R1SEMCR_SEMCID_MASK			GENMASK(6, 4)
#define RCC_R1SEMCR_SEMCID_SHIFT		4

/* RCC_R2CIDCFGR register fields */
#define RCC_R2CIDCFGR_CFEN			BIT(0)
#define RCC_R2CIDCFGR_SEM_EN			BIT(1)
#define RCC_R2CIDCFGR_SCID_MASK			GENMASK(6, 4)
#define RCC_R2CIDCFGR_SCID_SHIFT		4
#define RCC_R2CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R2CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R2SEMCR register fields */
#define RCC_R2SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R2SEMCR_SEMCID_MASK			GENMASK(6, 4)
#define RCC_R2SEMCR_SEMCID_SHIFT		4

/* RCC_R3CIDCFGR register fields */
#define RCC_R3CIDCFGR_CFEN			BIT(0)
#define RCC_R3CIDCFGR_SEM_EN			BIT(1)
#define RCC_R3CIDCFGR_SCID_MASK			GENMASK(6, 4)
#define RCC_R3CIDCFGR_SCID_SHIFT		4
#define RCC_R3CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R3CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R3SEMCR register fields */
#define RCC_R3SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R3SEMCR_SEMCID_MASK			GENMASK(6, 4)
#define RCC_R3SEMCR_SEMCID_SHIFT		4

/* RCC_R4CIDCFGR register fields */
#define RCC_R4CIDCFGR_CFEN			BIT(0)
#define RCC_R4CIDCFGR_SEM_EN			BIT(1)
#define RCC_R4CIDCFGR_SCID_MASK			GENMASK(6, 4)
#define RCC_R4CIDCFGR_SCID_SHIFT		4
#define RCC_R4CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R4CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R4SEMCR register fields */
#define RCC_R4SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R4SEMCR_SEMCID_MASK			GENMASK(6, 4)
#define RCC_R4SEMCR_SEMCID_SHIFT		4

/* RCC_R5CIDCFGR register fields */
#define RCC_R5CIDCFGR_CFEN			BIT(0)
#define RCC_R5CIDCFGR_SEM_EN			BIT(1)
#define RCC_R5CIDCFGR_SCID_MASK			GENMASK(6, 4)
#define RCC_R5CIDCFGR_SCID_SHIFT		4
#define RCC_R5CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R5CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R5SEMCR register fields */
#define RCC_R5SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R5SEMCR_SEMCID_MASK			GENMASK(6, 4)
#define RCC_R5SEMCR_SEMCID_SHIFT		4

/* RCC_R6CIDCFGR register fields */
#define RCC_R6CIDCFGR_CFEN			BIT(0)
#define RCC_R6CIDCFGR_SEM_EN			BIT(1)
#define RCC_R6CIDCFGR_SCID_MASK			GENMASK(6, 4)
#define RCC_R6CIDCFGR_SCID_SHIFT		4
#define RCC_R6CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R6CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R6SEMCR register fields */
#define RCC_R6SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R6SEMCR_SEMCID_MASK			GENMASK(6, 4)
#define RCC_R6SEMCR_SEMCID_SHIFT		4

/* RCC_R7CIDCFGR register fields */
#define RCC_R7CIDCFGR_CFEN			BIT(0)
#define RCC_R7CIDCFGR_SEM_EN			BIT(1)
#define RCC_R7CIDCFGR_SCID_MASK			GENMASK(6, 4)
#define RCC_R7CIDCFGR_SCID_SHIFT		4
#define RCC_R7CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R7CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R7SEMCR register fields */
#define RCC_R7SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R7SEMCR_SEMCID_MASK			GENMASK(6, 4)
#define RCC_R7SEMCR_SEMCID_SHIFT		4

/* RCC_R8CIDCFGR register fields */
#define RCC_R8CIDCFGR_CFEN			BIT(0)
#define RCC_R8CIDCFGR_SEM_EN			BIT(1)
#define RCC_R8CIDCFGR_SCID_MASK			GENMASK(6, 4)
#define RCC_R8CIDCFGR_SCID_SHIFT		4
#define RCC_R8CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R8CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R8SEMCR register fields */
#define RCC_R8SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R8SEMCR_SEMCID_MASK			GENMASK(6, 4)
#define RCC_R8SEMCR_SEMCID_SHIFT		4

/* RCC_R9CIDCFGR register fields */
#define RCC_R9CIDCFGR_CFEN			BIT(0)
#define RCC_R9CIDCFGR_SEM_EN			BIT(1)
#define RCC_R9CIDCFGR_SCID_MASK			GENMASK(6, 4)
#define RCC_R9CIDCFGR_SCID_SHIFT		4
#define RCC_R9CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R9CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R9SEMCR register fields */
#define RCC_R9SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R9SEMCR_SEMCID_MASK			GENMASK(6, 4)
#define RCC_R9SEMCR_SEMCID_SHIFT		4

/* RCC_R10CIDCFGR register fields */
#define RCC_R10CIDCFGR_CFEN			BIT(0)
#define RCC_R10CIDCFGR_SEM_EN			BIT(1)
#define RCC_R10CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R10CIDCFGR_SCID_SHIFT		4
#define RCC_R10CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R10CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R10SEMCR register fields */
#define RCC_R10SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R10SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R10SEMCR_SEMCID_SHIFT		4

/* RCC_R11CIDCFGR register fields */
#define RCC_R11CIDCFGR_CFEN			BIT(0)
#define RCC_R11CIDCFGR_SEM_EN			BIT(1)
#define RCC_R11CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R11CIDCFGR_SCID_SHIFT		4
#define RCC_R11CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R11CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R11SEMCR register fields */
#define RCC_R11SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R11SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R11SEMCR_SEMCID_SHIFT		4

