DanielMartensson/STM32-Computer/STM32CubeIDE/STM32-Computer-Firmware/CA7/tf-a-2.8.15-r2/tf-a-stm32mp-v2.8.15-stm32mp-r2/include/drivers/st/stm32mp2_rcc.h
/* RCC_R12CIDCFGR register fields */
#define RCC_R12CIDCFGR_CFEN			BIT(0)
#define RCC_R12CIDCFGR_SEM_EN			BIT(1)
#define RCC_R12CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R12CIDCFGR_SCID_SHIFT		4
#define RCC_R12CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R12CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R12SEMCR register fields */
#define RCC_R12SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R12SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R12SEMCR_SEMCID_SHIFT		4

/* RCC_R13CIDCFGR register fields */
#define RCC_R13CIDCFGR_CFEN			BIT(0)
#define RCC_R13CIDCFGR_SEM_EN			BIT(1)
#define RCC_R13CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R13CIDCFGR_SCID_SHIFT		4
#define RCC_R13CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R13CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R13SEMCR register fields */
#define RCC_R13SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R13SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R13SEMCR_SEMCID_SHIFT		4

/* RCC_R14CIDCFGR register fields */
#define RCC_R14CIDCFGR_CFEN			BIT(0)
#define RCC_R14CIDCFGR_SEM_EN			BIT(1)
#define RCC_R14CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R14CIDCFGR_SCID_SHIFT		4
#define RCC_R14CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R14CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R14SEMCR register fields */
#define RCC_R14SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R14SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R14SEMCR_SEMCID_SHIFT		4

/* RCC_R15CIDCFGR register fields */
#define RCC_R15CIDCFGR_CFEN			BIT(0)
#define RCC_R15CIDCFGR_SEM_EN			BIT(1)
#define RCC_R15CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R15CIDCFGR_SCID_SHIFT		4
#define RCC_R15CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R15CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R15SEMCR register fields */
#define RCC_R15SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R15SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R15SEMCR_SEMCID_SHIFT		4

/* RCC_R16CIDCFGR register fields */
#define RCC_R16CIDCFGR_CFEN			BIT(0)
#define RCC_R16CIDCFGR_SEM_EN			BIT(1)
#define RCC_R16CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R16CIDCFGR_SCID_SHIFT		4
#define RCC_R16CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R16CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R16SEMCR register fields */
#define RCC_R16SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R16SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R16SEMCR_SEMCID_SHIFT		4

/* RCC_R17CIDCFGR register fields */
#define RCC_R17CIDCFGR_CFEN			BIT(0)
#define RCC_R17CIDCFGR_SEM_EN			BIT(1)
#define RCC_R17CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R17CIDCFGR_SCID_SHIFT		4
#define RCC_R17CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R17CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R17SEMCR register fields */
#define RCC_R17SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R17SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R17SEMCR_SEMCID_SHIFT		4

/* RCC_R18CIDCFGR register fields */
#define RCC_R18CIDCFGR_CFEN			BIT(0)
#define RCC_R18CIDCFGR_SEM_EN			BIT(1)
#define RCC_R18CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R18CIDCFGR_SCID_SHIFT		4
#define RCC_R18CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R18CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R18SEMCR register fields */
#define RCC_R18SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R18SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R18SEMCR_SEMCID_SHIFT		4

/* RCC_R19CIDCFGR register fields */
#define RCC_R19CIDCFGR_CFEN			BIT(0)
#define RCC_R19CIDCFGR_SEM_EN			BIT(1)
#define RCC_R19CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R19CIDCFGR_SCID_SHIFT		4
#define RCC_R19CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R19CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R19SEMCR register fields */
#define RCC_R19SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R19SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R19SEMCR_SEMCID_SHIFT		4

/* RCC_R20CIDCFGR register fields */
#define RCC_R20CIDCFGR_CFEN			BIT(0)
#define RCC_R20CIDCFGR_SEM_EN			BIT(1)
#define RCC_R20CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R20CIDCFGR_SCID_SHIFT		4
#define RCC_R20CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R20CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R20SEMCR register fields */
#define RCC_R20SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R20SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R20SEMCR_SEMCID_SHIFT		4

/* RCC_R21CIDCFGR register fields */
#define RCC_R21CIDCFGR_CFEN			BIT(0)
#define RCC_R21CIDCFGR_SEM_EN			BIT(1)
#define RCC_R21CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R21CIDCFGR_SCID_SHIFT		4
#define RCC_R21CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R21CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R21SEMCR register fields */
#define RCC_R21SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R21SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R21SEMCR_SEMCID_SHIFT		4

/* RCC_R22CIDCFGR register fields */
#define RCC_R22CIDCFGR_CFEN			BIT(0)
#define RCC_R22CIDCFGR_SEM_EN			BIT(1)
#define RCC_R22CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R22CIDCFGR_SCID_SHIFT		4
#define RCC_R22CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R22CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R22SEMCR register fields */
#define RCC_R22SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R22SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R22SEMCR_SEMCID_SHIFT		4

/* RCC_R23CIDCFGR register fields */
#define RCC_R23CIDCFGR_CFEN			BIT(0)
#define RCC_R23CIDCFGR_SEM_EN			BIT(1)
#define RCC_R23CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R23CIDCFGR_SCID_SHIFT		4
#define RCC_R23CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R23CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R23SEMCR register fields */
#define RCC_R23SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R23SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R23SEMCR_SEMCID_SHIFT		4

/* RCC_R24CIDCFGR register fields */
#define RCC_R24CIDCFGR_CFEN			BIT(0)
#define RCC_R24CIDCFGR_SEM_EN			BIT(1)
#define RCC_R24CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R24CIDCFGR_SCID_SHIFT		4
#define RCC_R24CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R24CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R24SEMCR register fields */
#define RCC_R24SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R24SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R24SEMCR_SEMCID_SHIFT		4

/* RCC_R25CIDCFGR register fields */
#define RCC_R25CIDCFGR_CFEN			BIT(0)
#define RCC_R25CIDCFGR_SEM_EN			BIT(1)
#define RCC_R25CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R25CIDCFGR_SCID_SHIFT		4
#define RCC_R25CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R25CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R25SEMCR register fields */
#define RCC_R25SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R25SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R25SEMCR_SEMCID_SHIFT		4

/* RCC_R26CIDCFGR register fields */
#define RCC_R26CIDCFGR_CFEN			BIT(0)
#define RCC_R26CIDCFGR_SEM_EN			BIT(1)
#define RCC_R26CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R26CIDCFGR_SCID_SHIFT		4
#define RCC_R26CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R26CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R26SEMCR register fields */
#define RCC_R26SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R26SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R26SEMCR_SEMCID_SHIFT		4

/* RCC_R27CIDCFGR register fields */
#define RCC_R27CIDCFGR_CFEN			BIT(0)
#define RCC_R27CIDCFGR_SEM_EN			BIT(1)
#define RCC_R27CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R27CIDCFGR_SCID_SHIFT		4
#define RCC_R27CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R27CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R27SEMCR register fields */
#define RCC_R27SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R27SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R27SEMCR_SEMCID_SHIFT		4

/* RCC_R28CIDCFGR register fields */
#define RCC_R28CIDCFGR_CFEN			BIT(0)
#define RCC_R28CIDCFGR_SEM_EN			BIT(1)
#define RCC_R28CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R28CIDCFGR_SCID_SHIFT		4
#define RCC_R28CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R28CIDCFGR_SEMWLC_SHIFT		16

