DanielMartensson/STM32-Computer/STM32CubeIDE/STM32-Computer-Firmware/CA7/tf-a-2.8.15-r2/tf-a-stm32mp-v2.8.15-stm32mp-r2/include/drivers/st/stm32mp2_rcc.h
/* RCC_R28SEMCR register fields */
#define RCC_R28SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R28SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R28SEMCR_SEMCID_SHIFT		4

/* RCC_R29CIDCFGR register fields */
#define RCC_R29CIDCFGR_CFEN			BIT(0)
#define RCC_R29CIDCFGR_SEM_EN			BIT(1)
#define RCC_R29CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R29CIDCFGR_SCID_SHIFT		4
#define RCC_R29CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R29CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R29SEMCR register fields */
#define RCC_R29SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R29SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R29SEMCR_SEMCID_SHIFT		4

/* RCC_R30CIDCFGR register fields */
#define RCC_R30CIDCFGR_CFEN			BIT(0)
#define RCC_R30CIDCFGR_SEM_EN			BIT(1)
#define RCC_R30CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R30CIDCFGR_SCID_SHIFT		4
#define RCC_R30CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R30CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R30SEMCR register fields */
#define RCC_R30SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R30SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R30SEMCR_SEMCID_SHIFT		4

/* RCC_R31CIDCFGR register fields */
#define RCC_R31CIDCFGR_CFEN			BIT(0)
#define RCC_R31CIDCFGR_SEM_EN			BIT(1)
#define RCC_R31CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R31CIDCFGR_SCID_SHIFT		4
#define RCC_R31CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R31CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R31SEMCR register fields */
#define RCC_R31SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R31SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R31SEMCR_SEMCID_SHIFT		4

/* RCC_R32CIDCFGR register fields */
#define RCC_R32CIDCFGR_CFEN			BIT(0)
#define RCC_R32CIDCFGR_SEM_EN			BIT(1)
#define RCC_R32CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R32CIDCFGR_SCID_SHIFT		4
#define RCC_R32CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R32CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R32SEMCR register fields */
#define RCC_R32SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R32SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R32SEMCR_SEMCID_SHIFT		4

/* RCC_R33CIDCFGR register fields */
#define RCC_R33CIDCFGR_CFEN			BIT(0)
#define RCC_R33CIDCFGR_SEM_EN			BIT(1)
#define RCC_R33CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R33CIDCFGR_SCID_SHIFT		4
#define RCC_R33CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R33CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R33SEMCR register fields */
#define RCC_R33SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R33SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R33SEMCR_SEMCID_SHIFT		4

/* RCC_R34CIDCFGR register fields */
#define RCC_R34CIDCFGR_CFEN			BIT(0)
#define RCC_R34CIDCFGR_SEM_EN			BIT(1)
#define RCC_R34CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R34CIDCFGR_SCID_SHIFT		4
#define RCC_R34CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R34CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R34SEMCR register fields */
#define RCC_R34SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R34SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R34SEMCR_SEMCID_SHIFT		4

/* RCC_R35CIDCFGR register fields */
#define RCC_R35CIDCFGR_CFEN			BIT(0)
#define RCC_R35CIDCFGR_SEM_EN			BIT(1)
#define RCC_R35CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R35CIDCFGR_SCID_SHIFT		4
#define RCC_R35CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R35CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R35SEMCR register fields */
#define RCC_R35SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R35SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R35SEMCR_SEMCID_SHIFT		4

/* RCC_R36CIDCFGR register fields */
#define RCC_R36CIDCFGR_CFEN			BIT(0)
#define RCC_R36CIDCFGR_SEM_EN			BIT(1)
#define RCC_R36CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R36CIDCFGR_SCID_SHIFT		4
#define RCC_R36CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R36CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R36SEMCR register fields */
#define RCC_R36SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R36SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R36SEMCR_SEMCID_SHIFT		4

/* RCC_R37CIDCFGR register fields */
#define RCC_R37CIDCFGR_CFEN			BIT(0)
#define RCC_R37CIDCFGR_SEM_EN			BIT(1)
#define RCC_R37CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R37CIDCFGR_SCID_SHIFT		4
#define RCC_R37CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R37CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R37SEMCR register fields */
#define RCC_R37SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R37SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R37SEMCR_SEMCID_SHIFT		4

/* RCC_R38CIDCFGR register fields */
#define RCC_R38CIDCFGR_CFEN			BIT(0)
#define RCC_R38CIDCFGR_SEM_EN			BIT(1)
#define RCC_R38CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R38CIDCFGR_SCID_SHIFT		4
#define RCC_R38CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R38CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R38SEMCR register fields */
#define RCC_R38SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R38SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R38SEMCR_SEMCID_SHIFT		4

/* RCC_R39CIDCFGR register fields */
#define RCC_R39CIDCFGR_CFEN			BIT(0)
#define RCC_R39CIDCFGR_SEM_EN			BIT(1)
#define RCC_R39CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R39CIDCFGR_SCID_SHIFT		4
#define RCC_R39CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R39CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R39SEMCR register fields */
#define RCC_R39SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R39SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R39SEMCR_SEMCID_SHIFT		4

/* RCC_R40CIDCFGR register fields */
#define RCC_R40CIDCFGR_CFEN			BIT(0)
#define RCC_R40CIDCFGR_SEM_EN			BIT(1)
#define RCC_R40CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R40CIDCFGR_SCID_SHIFT		4
#define RCC_R40CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R40CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R40SEMCR register fields */
#define RCC_R40SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R40SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R40SEMCR_SEMCID_SHIFT		4

/* RCC_R41CIDCFGR register fields */
#define RCC_R41CIDCFGR_CFEN			BIT(0)
#define RCC_R41CIDCFGR_SEM_EN			BIT(1)
#define RCC_R41CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R41CIDCFGR_SCID_SHIFT		4
#define RCC_R41CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R41CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R41SEMCR register fields */
#define RCC_R41SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R41SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R41SEMCR_SEMCID_SHIFT		4

/* RCC_R42CIDCFGR register fields */
#define RCC_R42CIDCFGR_CFEN			BIT(0)
#define RCC_R42CIDCFGR_SEM_EN			BIT(1)
#define RCC_R42CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R42CIDCFGR_SCID_SHIFT		4
#define RCC_R42CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R42CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R42SEMCR register fields */
#define RCC_R42SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R42SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R42SEMCR_SEMCID_SHIFT		4

