DanielMartensson/STM32-Computer/STM32CubeIDE/STM32-Computer-Firmware/CA7/tf-a-2.8.15-r2/tf-a-stm32mp-v2.8.15-stm32mp-r2/include/drivers/st/stm32mp2_rcc.h
/* RCC_R43CIDCFGR register fields */
#define RCC_R43CIDCFGR_CFEN			BIT(0)
#define RCC_R43CIDCFGR_SEM_EN			BIT(1)
#define RCC_R43CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R43CIDCFGR_SCID_SHIFT		4
#define RCC_R43CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R43CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R43SEMCR register fields */
#define RCC_R43SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R43SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R43SEMCR_SEMCID_SHIFT		4

/* RCC_R44CIDCFGR register fields */
#define RCC_R44CIDCFGR_CFEN			BIT(0)
#define RCC_R44CIDCFGR_SEM_EN			BIT(1)
#define RCC_R44CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R44CIDCFGR_SCID_SHIFT		4
#define RCC_R44CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R44CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R44SEMCR register fields */
#define RCC_R44SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R44SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R44SEMCR_SEMCID_SHIFT		4

/* RCC_R45CIDCFGR register fields */
#define RCC_R45CIDCFGR_CFEN			BIT(0)
#define RCC_R45CIDCFGR_SEM_EN			BIT(1)
#define RCC_R45CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R45CIDCFGR_SCID_SHIFT		4
#define RCC_R45CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R45CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R45SEMCR register fields */
#define RCC_R45SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R45SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R45SEMCR_SEMCID_SHIFT		4

/* RCC_R46CIDCFGR register fields */
#define RCC_R46CIDCFGR_CFEN			BIT(0)
#define RCC_R46CIDCFGR_SEM_EN			BIT(1)
#define RCC_R46CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R46CIDCFGR_SCID_SHIFT		4
#define RCC_R46CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R46CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R46SEMCR register fields */
#define RCC_R46SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R46SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R46SEMCR_SEMCID_SHIFT		4

/* RCC_R47CIDCFGR register fields */
#define RCC_R47CIDCFGR_CFEN			BIT(0)
#define RCC_R47CIDCFGR_SEM_EN			BIT(1)
#define RCC_R47CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R47CIDCFGR_SCID_SHIFT		4
#define RCC_R47CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R47CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R47SEMCR register fields */
#define RCC_R47SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R47SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R47SEMCR_SEMCID_SHIFT		4

/* RCC_R48CIDCFGR register fields */
#define RCC_R48CIDCFGR_CFEN			BIT(0)
#define RCC_R48CIDCFGR_SEM_EN			BIT(1)
#define RCC_R48CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R48CIDCFGR_SCID_SHIFT		4
#define RCC_R48CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R48CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R48SEMCR register fields */
#define RCC_R48SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R48SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R48SEMCR_SEMCID_SHIFT		4

/* RCC_R49CIDCFGR register fields */
#define RCC_R49CIDCFGR_CFEN			BIT(0)
#define RCC_R49CIDCFGR_SEM_EN			BIT(1)
#define RCC_R49CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R49CIDCFGR_SCID_SHIFT		4
#define RCC_R49CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R49CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R49SEMCR register fields */
#define RCC_R49SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R49SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R49SEMCR_SEMCID_SHIFT		4

/* RCC_R50CIDCFGR register fields */
#define RCC_R50CIDCFGR_CFEN			BIT(0)
#define RCC_R50CIDCFGR_SEM_EN			BIT(1)
#define RCC_R50CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R50CIDCFGR_SCID_SHIFT		4
#define RCC_R50CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R50CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R50SEMCR register fields */
#define RCC_R50SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R50SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R50SEMCR_SEMCID_SHIFT		4

/* RCC_R51CIDCFGR register fields */
#define RCC_R51CIDCFGR_CFEN			BIT(0)
#define RCC_R51CIDCFGR_SEM_EN			BIT(1)
#define RCC_R51CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R51CIDCFGR_SCID_SHIFT		4
#define RCC_R51CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R51CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R51SEMCR register fields */
#define RCC_R51SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R51SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R51SEMCR_SEMCID_SHIFT		4

/* RCC_R52CIDCFGR register fields */
#define RCC_R52CIDCFGR_CFEN			BIT(0)
#define RCC_R52CIDCFGR_SEM_EN			BIT(1)
#define RCC_R52CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R52CIDCFGR_SCID_SHIFT		4
#define RCC_R52CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R52CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R52SEMCR register fields */
#define RCC_R52SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R52SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R52SEMCR_SEMCID_SHIFT		4

/* RCC_R53CIDCFGR register fields */
#define RCC_R53CIDCFGR_CFEN			BIT(0)
#define RCC_R53CIDCFGR_SEM_EN			BIT(1)
#define RCC_R53CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R53CIDCFGR_SCID_SHIFT		4
#define RCC_R53CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R53CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R53SEMCR register fields */
#define RCC_R53SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R53SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R53SEMCR_SEMCID_SHIFT		4

/* RCC_R54CIDCFGR register fields */
#define RCC_R54CIDCFGR_CFEN			BIT(0)
#define RCC_R54CIDCFGR_SEM_EN			BIT(1)
#define RCC_R54CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R54CIDCFGR_SCID_SHIFT		4
#define RCC_R54CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R54CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R54SEMCR register fields */
#define RCC_R54SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R54SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R54SEMCR_SEMCID_SHIFT		4

/* RCC_R55CIDCFGR register fields */
#define RCC_R55CIDCFGR_CFEN			BIT(0)
#define RCC_R55CIDCFGR_SEM_EN			BIT(1)
#define RCC_R55CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R55CIDCFGR_SCID_SHIFT		4
#define RCC_R55CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R55CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R55SEMCR register fields */
#define RCC_R55SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R55SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R55SEMCR_SEMCID_SHIFT		4

/* RCC_R56CIDCFGR register fields */
#define RCC_R56CIDCFGR_CFEN			BIT(0)
#define RCC_R56CIDCFGR_SEM_EN			BIT(1)
#define RCC_R56CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R56CIDCFGR_SCID_SHIFT		4
#define RCC_R56CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R56CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R56SEMCR register fields */
#define RCC_R56SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R56SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R56SEMCR_SEMCID_SHIFT		4

