DanielMartensson/STM32-Computer/STM32CubeIDE/STM32-Computer-Firmware/CA7/tf-a-2.8.15-r2/tf-a-stm32mp-v2.8.15-stm32mp-r2/include/drivers/st/stm32mp2_rcc.h
/* RCC_R57CIDCFGR register fields */
#define RCC_R57CIDCFGR_CFEN			BIT(0)
#define RCC_R57CIDCFGR_SEM_EN			BIT(1)
#define RCC_R57CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R57CIDCFGR_SCID_SHIFT		4
#define RCC_R57CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R57CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R57SEMCR register fields */
#define RCC_R57SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R57SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R57SEMCR_SEMCID_SHIFT		4

/* RCC_R58CIDCFGR register fields */
#define RCC_R58CIDCFGR_CFEN			BIT(0)
#define RCC_R58CIDCFGR_SEM_EN			BIT(1)
#define RCC_R58CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R58CIDCFGR_SCID_SHIFT		4
#define RCC_R58CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R58CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R58SEMCR register fields */
#define RCC_R58SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R58SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R58SEMCR_SEMCID_SHIFT		4

/* RCC_R59CIDCFGR register fields */
#define RCC_R59CIDCFGR_CFEN			BIT(0)
#define RCC_R59CIDCFGR_SEM_EN			BIT(1)
#define RCC_R59CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R59CIDCFGR_SCID_SHIFT		4
#define RCC_R59CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R59CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R59SEMCR register fields */
#define RCC_R59SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R59SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R59SEMCR_SEMCID_SHIFT		4

/* RCC_R60CIDCFGR register fields */
#define RCC_R60CIDCFGR_CFEN			BIT(0)
#define RCC_R60CIDCFGR_SEM_EN			BIT(1)
#define RCC_R60CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R60CIDCFGR_SCID_SHIFT		4
#define RCC_R60CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R60CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R60SEMCR register fields */
#define RCC_R60SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R60SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R60SEMCR_SEMCID_SHIFT		4

/* RCC_R61CIDCFGR register fields */
#define RCC_R61CIDCFGR_CFEN			BIT(0)
#define RCC_R61CIDCFGR_SEM_EN			BIT(1)
#define RCC_R61CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R61CIDCFGR_SCID_SHIFT		4
#define RCC_R61CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R61CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R61SEMCR register fields */
#define RCC_R61SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R61SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R61SEMCR_SEMCID_SHIFT		4

/* RCC_R62CIDCFGR register fields */
#define RCC_R62CIDCFGR_CFEN			BIT(0)
#define RCC_R62CIDCFGR_SEM_EN			BIT(1)
#define RCC_R62CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R62CIDCFGR_SCID_SHIFT		4
#define RCC_R62CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R62CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R62SEMCR register fields */
#define RCC_R62SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R62SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R62SEMCR_SEMCID_SHIFT		4

/* RCC_R63CIDCFGR register fields */
#define RCC_R63CIDCFGR_CFEN			BIT(0)
#define RCC_R63CIDCFGR_SEM_EN			BIT(1)
#define RCC_R63CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R63CIDCFGR_SCID_SHIFT		4
#define RCC_R63CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R63CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R63SEMCR register fields */
#define RCC_R63SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R63SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R63SEMCR_SEMCID_SHIFT		4

/* RCC_R64CIDCFGR register fields */
#define RCC_R64CIDCFGR_CFEN			BIT(0)
#define RCC_R64CIDCFGR_SEM_EN			BIT(1)
#define RCC_R64CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R64CIDCFGR_SCID_SHIFT		4
#define RCC_R64CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R64CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R64SEMCR register fields */
#define RCC_R64SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R64SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R64SEMCR_SEMCID_SHIFT		4

/* RCC_R65CIDCFGR register fields */
#define RCC_R65CIDCFGR_CFEN			BIT(0)
#define RCC_R65CIDCFGR_SEM_EN			BIT(1)
#define RCC_R65CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R65CIDCFGR_SCID_SHIFT		4
#define RCC_R65CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R65CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R65SEMCR register fields */
#define RCC_R65SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R65SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R65SEMCR_SEMCID_SHIFT		4

/* RCC_R66CIDCFGR register fields */
#define RCC_R66CIDCFGR_CFEN			BIT(0)
#define RCC_R66CIDCFGR_SEM_EN			BIT(1)
#define RCC_R66CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R66CIDCFGR_SCID_SHIFT		4
#define RCC_R66CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R66CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R66SEMCR register fields */
#define RCC_R66SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R66SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R66SEMCR_SEMCID_SHIFT		4

/* RCC_R67CIDCFGR register fields */
#define RCC_R67CIDCFGR_CFEN			BIT(0)
#define RCC_R67CIDCFGR_SEM_EN			BIT(1)
#define RCC_R67CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R67CIDCFGR_SCID_SHIFT		4
#define RCC_R67CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R67CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R67SEMCR register fields */
#define RCC_R67SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R67SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R67SEMCR_SEMCID_SHIFT		4

/* RCC_R68CIDCFGR register fields */
#define RCC_R68CIDCFGR_CFEN			BIT(0)
#define RCC_R68CIDCFGR_SEM_EN			BIT(1)
#define RCC_R68CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R68CIDCFGR_SCID_SHIFT		4
#define RCC_R68CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R68CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R68SEMCR register fields */
#define RCC_R68SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R68SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R68SEMCR_SEMCID_SHIFT		4

/* RCC_R69CIDCFGR register fields */
#define RCC_R69CIDCFGR_CFEN			BIT(0)
#define RCC_R69CIDCFGR_SEM_EN			BIT(1)
#define RCC_R69CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R69CIDCFGR_SCID_SHIFT		4
#define RCC_R69CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R69CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R69SEMCR register fields */
#define RCC_R69SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R69SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R69SEMCR_SEMCID_SHIFT		4

/* RCC_R70CIDCFGR register fields */
#define RCC_R70CIDCFGR_CFEN			BIT(0)
#define RCC_R70CIDCFGR_SEM_EN			BIT(1)
#define RCC_R70CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R70CIDCFGR_SCID_SHIFT		4
#define RCC_R70CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R70CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R70SEMCR register fields */
#define RCC_R70SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R70SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R70SEMCR_SEMCID_SHIFT		4

/* RCC_R71CIDCFGR register fields */
#define RCC_R71CIDCFGR_CFEN			BIT(0)
#define RCC_R71CIDCFGR_SEM_EN			BIT(1)
#define RCC_R71CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R71CIDCFGR_SCID_SHIFT		4
#define RCC_R71CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R71CIDCFGR_SEMWLC_SHIFT		16

