DanielMartensson/STM32-Computer/STM32CubeIDE/STM32-Computer-Firmware/CA7/tf-a-2.8.15-r2/tf-a-stm32mp-v2.8.15-stm32mp-r2/include/drivers/st/stm32mp2_rcc.h
/* RCC_R71SEMCR register fields */
#define RCC_R71SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R71SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R71SEMCR_SEMCID_SHIFT		4

/* RCC_R72CIDCFGR register fields */
#define RCC_R72CIDCFGR_CFEN			BIT(0)
#define RCC_R72CIDCFGR_SEM_EN			BIT(1)
#define RCC_R72CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R72CIDCFGR_SCID_SHIFT		4
#define RCC_R72CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R72CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R72SEMCR register fields */
#define RCC_R72SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R72SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R72SEMCR_SEMCID_SHIFT		4

/* RCC_R73CIDCFGR register fields */
#define RCC_R73CIDCFGR_CFEN			BIT(0)
#define RCC_R73CIDCFGR_SEM_EN			BIT(1)
#define RCC_R73CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R73CIDCFGR_SCID_SHIFT		4
#define RCC_R73CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R73CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R73SEMCR register fields */
#define RCC_R73SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R73SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R73SEMCR_SEMCID_SHIFT		4

/* RCC_R74CIDCFGR register fields */
#define RCC_R74CIDCFGR_CFEN			BIT(0)
#define RCC_R74CIDCFGR_SEM_EN			BIT(1)
#define RCC_R74CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R74CIDCFGR_SCID_SHIFT		4
#define RCC_R74CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R74CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R74SEMCR register fields */
#define RCC_R74SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R74SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R74SEMCR_SEMCID_SHIFT		4

/* RCC_R75CIDCFGR register fields */
#define RCC_R75CIDCFGR_CFEN			BIT(0)
#define RCC_R75CIDCFGR_SEM_EN			BIT(1)
#define RCC_R75CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R75CIDCFGR_SCID_SHIFT		4
#define RCC_R75CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R75CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R75SEMCR register fields */
#define RCC_R75SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R75SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R75SEMCR_SEMCID_SHIFT		4

/* RCC_R76CIDCFGR register fields */
#define RCC_R76CIDCFGR_CFEN			BIT(0)
#define RCC_R76CIDCFGR_SEM_EN			BIT(1)
#define RCC_R76CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R76CIDCFGR_SCID_SHIFT		4
#define RCC_R76CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R76CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R76SEMCR register fields */
#define RCC_R76SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R76SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R76SEMCR_SEMCID_SHIFT		4

/* RCC_R77CIDCFGR register fields */
#define RCC_R77CIDCFGR_CFEN			BIT(0)
#define RCC_R77CIDCFGR_SEM_EN			BIT(1)
#define RCC_R77CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R77CIDCFGR_SCID_SHIFT		4
#define RCC_R77CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R77CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R77SEMCR register fields */
#define RCC_R77SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R77SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R77SEMCR_SEMCID_SHIFT		4

/* RCC_R78CIDCFGR register fields */
#define RCC_R78CIDCFGR_CFEN			BIT(0)
#define RCC_R78CIDCFGR_SEM_EN			BIT(1)
#define RCC_R78CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R78CIDCFGR_SCID_SHIFT		4
#define RCC_R78CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R78CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R78SEMCR register fields */
#define RCC_R78SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R78SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R78SEMCR_SEMCID_SHIFT		4

/* RCC_R79CIDCFGR register fields */
#define RCC_R79CIDCFGR_CFEN			BIT(0)
#define RCC_R79CIDCFGR_SEM_EN			BIT(1)
#define RCC_R79CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R79CIDCFGR_SCID_SHIFT		4
#define RCC_R79CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R79CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R79SEMCR register fields */
#define RCC_R79SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R79SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R79SEMCR_SEMCID_SHIFT		4

/* RCC_R80CIDCFGR register fields */
#define RCC_R80CIDCFGR_CFEN			BIT(0)
#define RCC_R80CIDCFGR_SEM_EN			BIT(1)
#define RCC_R80CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R80CIDCFGR_SCID_SHIFT		4
#define RCC_R80CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R80CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R80SEMCR register fields */
#define RCC_R80SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R80SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R80SEMCR_SEMCID_SHIFT		4

/* RCC_R81CIDCFGR register fields */
#define RCC_R81CIDCFGR_CFEN			BIT(0)
#define RCC_R81CIDCFGR_SEM_EN			BIT(1)
#define RCC_R81CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R81CIDCFGR_SCID_SHIFT		4
#define RCC_R81CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R81CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R81SEMCR register fields */
#define RCC_R81SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R81SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R81SEMCR_SEMCID_SHIFT		4

/* RCC_R82CIDCFGR register fields */
#define RCC_R82CIDCFGR_CFEN			BIT(0)
#define RCC_R82CIDCFGR_SEM_EN			BIT(1)
#define RCC_R82CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R82CIDCFGR_SCID_SHIFT		4
#define RCC_R82CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R82CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R82SEMCR register fields */
#define RCC_R82SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R82SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R82SEMCR_SEMCID_SHIFT		4

/* RCC_R83CIDCFGR register fields */
#define RCC_R83CIDCFGR_CFEN			BIT(0)
#define RCC_R83CIDCFGR_SEM_EN			BIT(1)
#define RCC_R83CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R83CIDCFGR_SCID_SHIFT		4
#define RCC_R83CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R83CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R83SEMCR register fields */
#define RCC_R83SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R83SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R83SEMCR_SEMCID_SHIFT		4

/* RCC_R84CIDCFGR register fields */
#define RCC_R84CIDCFGR_CFEN			BIT(0)
#define RCC_R84CIDCFGR_SEM_EN			BIT(1)
#define RCC_R84CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R84CIDCFGR_SCID_SHIFT		4
#define RCC_R84CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R84CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R84SEMCR register fields */
#define RCC_R84SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R84SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R84SEMCR_SEMCID_SHIFT		4

/* RCC_R85CIDCFGR register fields */
#define RCC_R85CIDCFGR_CFEN			BIT(0)
#define RCC_R85CIDCFGR_SEM_EN			BIT(1)
#define RCC_R85CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R85CIDCFGR_SCID_SHIFT		4
#define RCC_R85CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R85CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R85SEMCR register fields */
#define RCC_R85SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R85SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R85SEMCR_SEMCID_SHIFT		4

