DanielMartensson/STM32-Computer/STM32CubeIDE/STM32-Computer-Firmware/CA7/tf-a-2.8.15-r2/tf-a-stm32mp-v2.8.15-stm32mp-r2/include/drivers/st/stm32mp2_rcc.h
/* RCC_R86CIDCFGR register fields */
#define RCC_R86CIDCFGR_CFEN			BIT(0)
#define RCC_R86CIDCFGR_SEM_EN			BIT(1)
#define RCC_R86CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R86CIDCFGR_SCID_SHIFT		4
#define RCC_R86CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R86CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R86SEMCR register fields */
#define RCC_R86SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R86SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R86SEMCR_SEMCID_SHIFT		4

/* RCC_R87CIDCFGR register fields */
#define RCC_R87CIDCFGR_CFEN			BIT(0)
#define RCC_R87CIDCFGR_SEM_EN			BIT(1)
#define RCC_R87CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R87CIDCFGR_SCID_SHIFT		4
#define RCC_R87CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R87CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R87SEMCR register fields */
#define RCC_R87SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R87SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R87SEMCR_SEMCID_SHIFT		4

/* RCC_R88CIDCFGR register fields */
#define RCC_R88CIDCFGR_CFEN			BIT(0)
#define RCC_R88CIDCFGR_SEM_EN			BIT(1)
#define RCC_R88CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R88CIDCFGR_SCID_SHIFT		4
#define RCC_R88CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R88CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R88SEMCR register fields */
#define RCC_R88SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R88SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R88SEMCR_SEMCID_SHIFT		4

/* RCC_R89CIDCFGR register fields */
#define RCC_R89CIDCFGR_CFEN			BIT(0)
#define RCC_R89CIDCFGR_SEM_EN			BIT(1)
#define RCC_R89CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R89CIDCFGR_SCID_SHIFT		4
#define RCC_R89CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R89CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R89SEMCR register fields */
#define RCC_R89SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R89SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R89SEMCR_SEMCID_SHIFT		4

/* RCC_R90CIDCFGR register fields */
#define RCC_R90CIDCFGR_CFEN			BIT(0)
#define RCC_R90CIDCFGR_SEM_EN			BIT(1)
#define RCC_R90CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R90CIDCFGR_SCID_SHIFT		4
#define RCC_R90CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R90CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R90SEMCR register fields */
#define RCC_R90SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R90SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R90SEMCR_SEMCID_SHIFT		4

/* RCC_R91CIDCFGR register fields */
#define RCC_R91CIDCFGR_CFEN			BIT(0)
#define RCC_R91CIDCFGR_SEM_EN			BIT(1)
#define RCC_R91CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R91CIDCFGR_SCID_SHIFT		4
#define RCC_R91CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R91CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R91SEMCR register fields */
#define RCC_R91SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R91SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R91SEMCR_SEMCID_SHIFT		4

/* RCC_R92CIDCFGR register fields */
#define RCC_R92CIDCFGR_CFEN			BIT(0)
#define RCC_R92CIDCFGR_SEM_EN			BIT(1)
#define RCC_R92CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R92CIDCFGR_SCID_SHIFT		4
#define RCC_R92CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R92CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R92SEMCR register fields */
#define RCC_R92SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R92SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R92SEMCR_SEMCID_SHIFT		4

/* RCC_R93CIDCFGR register fields */
#define RCC_R93CIDCFGR_CFEN			BIT(0)
#define RCC_R93CIDCFGR_SEM_EN			BIT(1)
#define RCC_R93CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R93CIDCFGR_SCID_SHIFT		4
#define RCC_R93CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R93CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R93SEMCR register fields */
#define RCC_R93SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R93SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R93SEMCR_SEMCID_SHIFT		4

/* RCC_R94CIDCFGR register fields */
#define RCC_R94CIDCFGR_CFEN			BIT(0)
#define RCC_R94CIDCFGR_SEM_EN			BIT(1)
#define RCC_R94CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R94CIDCFGR_SCID_SHIFT		4
#define RCC_R94CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R94CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R94SEMCR register fields */
#define RCC_R94SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R94SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R94SEMCR_SEMCID_SHIFT		4

/* RCC_R95CIDCFGR register fields */
#define RCC_R95CIDCFGR_CFEN			BIT(0)
#define RCC_R95CIDCFGR_SEM_EN			BIT(1)
#define RCC_R95CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R95CIDCFGR_SCID_SHIFT		4
#define RCC_R95CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R95CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R95SEMCR register fields */
#define RCC_R95SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R95SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R95SEMCR_SEMCID_SHIFT		4

/* RCC_R96CIDCFGR register fields */
#define RCC_R96CIDCFGR_CFEN			BIT(0)
#define RCC_R96CIDCFGR_SEM_EN			BIT(1)
#define RCC_R96CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R96CIDCFGR_SCID_SHIFT		4
#define RCC_R96CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R96CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R96SEMCR register fields */
#define RCC_R96SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R96SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R96SEMCR_SEMCID_SHIFT		4

/* RCC_R97CIDCFGR register fields */
#define RCC_R97CIDCFGR_CFEN			BIT(0)
#define RCC_R97CIDCFGR_SEM_EN			BIT(1)
#define RCC_R97CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R97CIDCFGR_SCID_SHIFT		4
#define RCC_R97CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R97CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R97SEMCR register fields */
#define RCC_R97SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R97SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R97SEMCR_SEMCID_SHIFT		4

/* RCC_R98CIDCFGR register fields */
#define RCC_R98CIDCFGR_CFEN			BIT(0)
#define RCC_R98CIDCFGR_SEM_EN			BIT(1)
#define RCC_R98CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R98CIDCFGR_SCID_SHIFT		4
#define RCC_R98CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R98CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R98SEMCR register fields */
#define RCC_R98SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R98SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R98SEMCR_SEMCID_SHIFT		4

/* RCC_R99CIDCFGR register fields */
#define RCC_R99CIDCFGR_CFEN			BIT(0)
#define RCC_R99CIDCFGR_SEM_EN			BIT(1)
#define RCC_R99CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R99CIDCFGR_SCID_SHIFT		4
#define RCC_R99CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R99CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R99SEMCR register fields */
#define RCC_R99SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R99SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R99SEMCR_SEMCID_SHIFT		4

/* RCC_R100CIDCFGR register fields */
#define RCC_R100CIDCFGR_CFEN			BIT(0)
#define RCC_R100CIDCFGR_SEM_EN			BIT(1)
#define RCC_R100CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R100CIDCFGR_SCID_SHIFT		4
#define RCC_R100CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R100CIDCFGR_SEMWLC_SHIFT		16

