DanielMartensson/STM32-Computer/STM32CubeIDE/STM32-Computer-Firmware/CA7/tf-a-2.8.15-r2/tf-a-stm32mp-v2.8.15-stm32mp-r2/include/drivers/st/stm32mp2_rcc.h
/* RCC_R100SEMCR register fields */
#define RCC_R100SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R100SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R100SEMCR_SEMCID_SHIFT		4

/* RCC_R101CIDCFGR register fields */
#define RCC_R101CIDCFGR_CFEN			BIT(0)
#define RCC_R101CIDCFGR_SEM_EN			BIT(1)
#define RCC_R101CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R101CIDCFGR_SCID_SHIFT		4
#define RCC_R101CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R101CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R101SEMCR register fields */
#define RCC_R101SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R101SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R101SEMCR_SEMCID_SHIFT		4

/* RCC_R102CIDCFGR register fields */
#define RCC_R102CIDCFGR_CFEN			BIT(0)
#define RCC_R102CIDCFGR_SEM_EN			BIT(1)
#define RCC_R102CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R102CIDCFGR_SCID_SHIFT		4
#define RCC_R102CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R102CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R102SEMCR register fields */
#define RCC_R102SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R102SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R102SEMCR_SEMCID_SHIFT		4

/* RCC_R103CIDCFGR register fields */
#define RCC_R103CIDCFGR_CFEN			BIT(0)
#define RCC_R103CIDCFGR_SEM_EN			BIT(1)
#define RCC_R103CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R103CIDCFGR_SCID_SHIFT		4
#define RCC_R103CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R103CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R103SEMCR register fields */
#define RCC_R103SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R103SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R103SEMCR_SEMCID_SHIFT		4

/* RCC_R104CIDCFGR register fields */
#define RCC_R104CIDCFGR_CFEN			BIT(0)
#define RCC_R104CIDCFGR_SEM_EN			BIT(1)
#define RCC_R104CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R104CIDCFGR_SCID_SHIFT		4
#define RCC_R104CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R104CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R104SEMCR register fields */
#define RCC_R104SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R104SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R104SEMCR_SEMCID_SHIFT		4

/* RCC_R105CIDCFGR register fields */
#define RCC_R105CIDCFGR_CFEN			BIT(0)
#define RCC_R105CIDCFGR_SEM_EN			BIT(1)
#define RCC_R105CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R105CIDCFGR_SCID_SHIFT		4
#define RCC_R105CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R105CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R105SEMCR register fields */
#define RCC_R105SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R105SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R105SEMCR_SEMCID_SHIFT		4

/* RCC_R106CIDCFGR register fields */
#define RCC_R106CIDCFGR_CFEN			BIT(0)
#define RCC_R106CIDCFGR_SEM_EN			BIT(1)
#define RCC_R106CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R106CIDCFGR_SCID_SHIFT		4
#define RCC_R106CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R106CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R106SEMCR register fields */
#define RCC_R106SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R106SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R106SEMCR_SEMCID_SHIFT		4

/* RCC_R107CIDCFGR register fields */
#define RCC_R107CIDCFGR_CFEN			BIT(0)
#define RCC_R107CIDCFGR_SEM_EN			BIT(1)
#define RCC_R107CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R107CIDCFGR_SCID_SHIFT		4
#define RCC_R107CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R107CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R107SEMCR register fields */
#define RCC_R107SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R107SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R107SEMCR_SEMCID_SHIFT		4

/* RCC_R108CIDCFGR register fields */
#define RCC_R108CIDCFGR_CFEN			BIT(0)
#define RCC_R108CIDCFGR_SEM_EN			BIT(1)
#define RCC_R108CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R108CIDCFGR_SCID_SHIFT		4
#define RCC_R108CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R108CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R108SEMCR register fields */
#define RCC_R108SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R108SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R108SEMCR_SEMCID_SHIFT		4

/* RCC_R109CIDCFGR register fields */
#define RCC_R109CIDCFGR_CFEN			BIT(0)
#define RCC_R109CIDCFGR_SEM_EN			BIT(1)
#define RCC_R109CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R109CIDCFGR_SCID_SHIFT		4
#define RCC_R109CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R109CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R109SEMCR register fields */
#define RCC_R109SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R109SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R109SEMCR_SEMCID_SHIFT		4

/* RCC_R110CIDCFGR register fields */
#define RCC_R110CIDCFGR_CFEN			BIT(0)
#define RCC_R110CIDCFGR_SEM_EN			BIT(1)
#define RCC_R110CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R110CIDCFGR_SCID_SHIFT		4
#define RCC_R110CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R110CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R110SEMCR register fields */
#define RCC_R110SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R110SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R110SEMCR_SEMCID_SHIFT		4

/* RCC_R111CIDCFGR register fields */
#define RCC_R111CIDCFGR_CFEN			BIT(0)
#define RCC_R111CIDCFGR_SEM_EN			BIT(1)
#define RCC_R111CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R111CIDCFGR_SCID_SHIFT		4
#define RCC_R111CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R111CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R111SEMCR register fields */
#define RCC_R111SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R111SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R111SEMCR_SEMCID_SHIFT		4

/* RCC_R112CIDCFGR register fields */
#define RCC_R112CIDCFGR_CFEN			BIT(0)
#define RCC_R112CIDCFGR_SEM_EN			BIT(1)
#define RCC_R112CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R112CIDCFGR_SCID_SHIFT		4
#define RCC_R112CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R112CIDCFGR_SEMWLC_SHIFT		16

/* RCC_R112SEMCR register fields */
#define RCC_R112SEMCR_SEM_MUTEX			BIT(0)
#define RCC_R112SEMCR_SEMCID_MASK		GENMASK(6, 4)
#define RCC_R112SEMCR_SEMCID_SHIFT		4

/* RCC_R113CIDCFGR register fields */
#define RCC_R113CIDCFGR_CFEN			BIT(0)
#define RCC_R113CIDCFGR_SEM_EN			BIT(1)
#define RCC_R113CIDCFGR_SCID_MASK		GENMASK(6, 4)
#define RCC_R113CIDCFGR_SCID_SHIFT		4
#define RCC_R113CIDCFGR_SEMWLC_MASK		GENMASK(23, 16)
#define RCC_R113CIDCFGR_SEMWLC_SHIFT		16

