DanielMartensson/STM32-Computer/STM32CubeIDE/STM32-Computer-Firmware/CA7/tf-a-2.8.15-r2/tf-a-stm32mp-v2.8.15-stm32mp-r2/include/drivers/st/stm32mp2_rcc.h
/* RCC_CPUBOOTCR register fields */
#define RCC_CPUBOOTCR_BOOT_CPU2			BIT(0)
#define RCC_CPUBOOTCR_BOOT_CPU1			BIT(1)

/* RCC_STBYBOOTCR register fields */
#define RCC_STBYBOOTCR_CPU_BEN_SEL		BIT(1)
#define RCC_STBYBOOTCR_COLD_CPU2		BIT(2)
#define RCC_STBYBOOTCR_CPU2_HW_BEN		BIT(4)
#define RCC_STBYBOOTCR_CPU1_HW_BEN		BIT(5)
#define RCC_STBYBOOTCR_RET_CRCERR_RSTEN		BIT(8)

/* RCC_LEGBOOTCR register fields */
#define RCC_LEGBOOTCR_LEGACY_BEN		BIT(0)

/* RCC_BDCR register fields */
#define RCC_BDCR_LSEON				BIT(0)
#define RCC_BDCR_LSEBYP				BIT(1)
#define RCC_BDCR_LSERDY				BIT(2)
#define RCC_BDCR_LSEDIGBYP			BIT(3)
#define RCC_BDCR_LSEDRV_MASK			GENMASK(5, 4)
#define RCC_BDCR_LSEDRV_SHIFT			4
#define RCC_BDCR_LSECSSON			BIT(6)
#define RCC_BDCR_LSEGFON			BIT(7)
#define RCC_BDCR_LSECSSD			BIT(8)
#define RCC_BDCR_LSION				BIT(9)
#define RCC_BDCR_LSIRDY				BIT(10)
#define RCC_BDCR_RTCSRC_MASK			GENMASK(17, 16)
#define RCC_BDCR_RTCSRC_SHIFT			16
#define RCC_BDCR_RTCCKEN			BIT(20)
#define RCC_BDCR_MSIFREQSEL			BIT(24)
#define RCC_BDCR_C3SYSTICKSEL			BIT(25)
#define RCC_BDCR_VSWRST				BIT(31)
#define RCC_BDCR_LSEBYP_BIT			1
#define RCC_BDCR_LSEDIGBYP_BIT			3
#define RCC_BDCR_LSECSSON_BIT			6
#define RCC_BDCR_LSERDY_BIT			2
#define RCC_BDCR_LSIRDY_BIT			10

#define RCC_BDCR_LSEDRV_SHIFT			4
#define RCC_BDCR_LSEDRV_WIDTH			2

/* RCC_D3DCR register fields */
#define RCC_D3DCR_MSION				BIT(0)
#define RCC_D3DCR_MSIKERON			BIT(1)
#define RCC_D3DCR_MSIRDY			BIT(2)
#define RCC_D3DCR_D3PERCKSEL_MASK		GENMASK(17, 16)
#define RCC_D3DCR_D3PERCKSEL_SHIFT		16
#define RCC_D3DCR_MSIRDY_BIT			2

/* RCC_D3DSR register fields */
#define RCC_D3DSR_D3STATE_MASK			GENMASK(1, 0)
#define RCC_D3DSR_D3STATE_SHIFT			0

/* RCC_RDCR register fields */
#define RCC_RDCR_MRD_MASK			GENMASK(20, 16)
#define RCC_RDCR_MRD_SHIFT			16
#define RCC_RDCR_EADLY_MASK			GENMASK(27, 24)
#define RCC_RDCR_EADLY_SHIFT			24

/* RCC_C1MSRDCR register fields */
#define RCC_C1MSRDCR_C1MSRD_MASK		GENMASK(4, 0)
#define RCC_C1MSRDCR_C1MSRD_SHIFT		0
#define RCC_C1MSRDCR_C1MSRST			BIT(8)

/* RCC_PWRLPDLYCR register fields */
#define RCC_PWRLPDLYCR_PWRLP_DLY_MASK		GENMASK(21, 0)
#define RCC_PWRLPDLYCR_PWRLP_DLY_SHIFT		0
#define RCC_PWRLPDLYCR_CPU2TMPSKP		BIT(24)

/* RCC_C1CIESETR register fields */
#define RCC_C1CIESETR_LSIRDYIE			BIT(0)
#define RCC_C1CIESETR_LSERDYIE			BIT(1)
#define RCC_C1CIESETR_HSIRDYIE			BIT(2)
#define RCC_C1CIESETR_HSERDYIE			BIT(3)
#define RCC_C1CIESETR_CSIRDYIE			BIT(4)
#define RCC_C1CIESETR_PLL1RDYIE			BIT(5)
#define RCC_C1CIESETR_PLL2RDYIE			BIT(6)
#define RCC_C1CIESETR_PLL3RDYIE			BIT(7)
#define RCC_C1CIESETR_PLL4RDYIE			BIT(8)
#define RCC_C1CIESETR_PLL5RDYIE			BIT(9)
#define RCC_C1CIESETR_PLL6RDYIE			BIT(10)
#define RCC_C1CIESETR_PLL7RDYIE			BIT(11)
#define RCC_C1CIESETR_PLL8RDYIE			BIT(12)
#define RCC_C1CIESETR_LSECSSIE			BIT(16)
#define RCC_C1CIESETR_WKUPIE			BIT(20)

/* RCC_C1CIFCLRR register fields */
#define RCC_C1CIFCLRR_LSIRDYF			BIT(0)
#define RCC_C1CIFCLRR_LSERDYF			BIT(1)
#define RCC_C1CIFCLRR_HSIRDYF			BIT(2)
#define RCC_C1CIFCLRR_HSERDYF			BIT(3)
#define RCC_C1CIFCLRR_CSIRDYF			BIT(4)
#define RCC_C1CIFCLRR_PLL1RDYF			BIT(5)
#define RCC_C1CIFCLRR_PLL2RDYF			BIT(6)
#define RCC_C1CIFCLRR_PLL3RDYF			BIT(7)
#define RCC_C1CIFCLRR_PLL4RDYF			BIT(8)
#define RCC_C1CIFCLRR_PLL5RDYF			BIT(9)
#define RCC_C1CIFCLRR_PLL6RDYF			BIT(10)
#define RCC_C1CIFCLRR_PLL7RDYF			BIT(11)
#define RCC_C1CIFCLRR_PLL8RDYF			BIT(12)
#define RCC_C1CIFCLRR_LSECSSF			BIT(16)
#define RCC_C1CIFCLRR_WKUPF			BIT(20)

/* RCC_C2CIESETR register fields */
#define RCC_C2CIESETR_LSIRDYIE			BIT(0)
#define RCC_C2CIESETR_LSERDYIE			BIT(1)
#define RCC_C2CIESETR_HSIRDYIE			BIT(2)
#define RCC_C2CIESETR_HSERDYIE			BIT(3)
#define RCC_C2CIESETR_CSIRDYIE			BIT(4)
#define RCC_C2CIESETR_PLL1RDYIE			BIT(5)
#define RCC_C2CIESETR_PLL2RDYIE			BIT(6)
#define RCC_C2CIESETR_PLL3RDYIE			BIT(7)
#define RCC_C2CIESETR_PLL4RDYIE			BIT(8)
#define RCC_C2CIESETR_PLL5RDYIE			BIT(9)
#define RCC_C2CIESETR_PLL6RDYIE			BIT(10)
#define RCC_C2CIESETR_PLL7RDYIE			BIT(11)
#define RCC_C2CIESETR_PLL8RDYIE			BIT(12)
#define RCC_C2CIESETR_LSECSSIE			BIT(16)
#define RCC_C2CIESETR_WKUPIE			BIT(20)

/* RCC_C2CIFCLRR register fields */
#define RCC_C2CIFCLRR_LSIRDYF			BIT(0)
#define RCC_C2CIFCLRR_LSERDYF			BIT(1)
#define RCC_C2CIFCLRR_HSIRDYF			BIT(2)
#define RCC_C2CIFCLRR_HSERDYF			BIT(3)
#define RCC_C2CIFCLRR_CSIRDYF			BIT(4)
#define RCC_C2CIFCLRR_PLL1RDYF			BIT(5)
#define RCC_C2CIFCLRR_PLL2RDYF			BIT(6)
#define RCC_C2CIFCLRR_PLL3RDYF			BIT(7)
#define RCC_C2CIFCLRR_PLL4RDYF			BIT(8)
#define RCC_C2CIFCLRR_PLL5RDYF			BIT(9)
#define RCC_C2CIFCLRR_PLL6RDYF			BIT(10)
#define RCC_C2CIFCLRR_PLL7RDYF			BIT(11)
#define RCC_C2CIFCLRR_PLL8RDYF			BIT(12)
#define RCC_C2CIFCLRR_LSECSSF			BIT(16)
#define RCC_C2CIFCLRR_WKUPF			BIT(20)

/* RCC_CxCIESETR register fields */
#define RCC_CxCIESETR_LSIRDYIE			BIT(0)
#define RCC_CxCIESETR_LSERDYIE			BIT(1)
#define RCC_CxCIESETR_HSIRDYIE			BIT(2)
#define RCC_CxCIESETR_HSERDYIE			BIT(3)
#define RCC_CxCIESETR_CSIRDYIE			BIT(4)
#define RCC_CxCIESETR_SHSIRDYIE			BIT(5)
#define RCC_CxCIESETR_PLL1RDYIE			BIT(6)
#define RCC_CxCIESETR_PLL2RDYIE			BIT(7)
#define RCC_CxCIESETR_PLL3RDYIE			BIT(8)
#define RCC_CxCIESETR_PLL4RDYIE			BIT(9)
#define RCC_CxCIESETR_PLL5RDYIE			BIT(10)
#define RCC_CxCIESETR_PLL6RDYIE			BIT(11)
#define RCC_CxCIESETR_PLL7RDYIE			BIT(12)
#define RCC_CxCIESETR_PLL8RDYIE			BIT(13)
#define RCC_CxCIESETR_LSECSSIE			BIT(16)
#define RCC_CxCIESETR_WKUPIE			BIT(20)

/* RCC_CxCIFCLRR register fields */
#define RCC_CxCIFCLRR_LSIRDYF			BIT(0)
#define RCC_CxCIFCLRR_LSERDYF			BIT(1)
#define RCC_CxCIFCLRR_HSIRDYF			BIT(2)
#define RCC_CxCIFCLRR_HSERDYF			BIT(3)
#define RCC_CxCIFCLRR_CSIRDYF			BIT(4)
#define RCC_CxCIFCLRR_SHSIRDYF			BIT(5)
#define RCC_CxCIFCLRR_PLL1RDYF			BIT(6)
#define RCC_CxCIFCLRR_PLL2RDYF			BIT(7)
#define RCC_CxCIFCLRR_PLL3RDYF			BIT(8)
#define RCC_CxCIFCLRR_PLL4RDYF			BIT(9)
#define RCC_CxCIFCLRR_PLL5RDYF			BIT(10)
#define RCC_CxCIFCLRR_PLL6RDYF			BIT(11)
#define RCC_CxCIFCLRR_PLL7RDYF			BIT(12)
#define RCC_CxCIFCLRR_PLL8RDYF			BIT(13)
#define RCC_CxCIFCLRR_LSECSSF			BIT(16)
#define RCC_CxCIFCLRR_WKUPF			BIT(20)

