DanielMartensson/STM32-Computer/STM32CubeIDE/STM32-Computer-Firmware/CA7/tf-a-2.8.15-r2/tf-a-stm32mp-v2.8.15-stm32mp-r2/include/drivers/st/stm32mp2_rcc.h
/* RCC_SRAM1CFGR register fields */
#define RCC_SRAM1CFGR_SRAM1EN			BIT(1)
#define RCC_SRAM1CFGR_SRAM1LPEN			BIT(2)

/* RCC_SRAM2CFGR register fields */
#define RCC_SRAM2CFGR_SRAM2EN			BIT(1)
#define RCC_SRAM2CFGR_SRAM2LPEN			BIT(2)

/* RCC_RETRAMCFGR register fields */
#define RCC_RETRAMCFGR_RETRAMEN			BIT(1)
#define RCC_RETRAMCFGR_RETRAMLPEN		BIT(2)

/* RCC_BKPSRAMCFGR register fields */
#define RCC_BKPSRAMCFGR_BKPSRAMEN		BIT(1)
#define RCC_BKPSRAMCFGR_BKPSRAMLPEN		BIT(2)

/* RCC_LPSRAM1CFGR register fields */
#define RCC_LPSRAM1CFGR_LPSRAM1EN		BIT(1)
#define RCC_LPSRAM1CFGR_LPSRAM1LPEN		BIT(2)
#define RCC_LPSRAM1CFGR_LPSRAM1AMEN		BIT(3)

/* RCC_LPSRAM2CFGR register fields */
#define RCC_LPSRAM2CFGR_LPSRAM2EN		BIT(1)
#define RCC_LPSRAM2CFGR_LPSRAM2LPEN		BIT(2)
#define RCC_LPSRAM2CFGR_LPSRAM2AMEN		BIT(3)

/* RCC_LPSRAM3CFGR register fields */
#define RCC_LPSRAM3CFGR_LPSRAM3EN		BIT(1)
#define RCC_LPSRAM3CFGR_LPSRAM3LPEN		BIT(2)
#define RCC_LPSRAM3CFGR_LPSRAM3AMEN		BIT(3)

/* RCC_OSPI1CFGR register fields */
#define RCC_OSPI1CFGR_OSPI1RST			BIT(0)
#define RCC_OSPI1CFGR_OSPI1EN			BIT(1)
#define RCC_OSPI1CFGR_OSPI1LPEN			BIT(2)
#define RCC_OSPI1CFGR_OTFDEC1RST		BIT(8)
#define RCC_OSPI1CFGR_OSPI1DLLRST		BIT(16)

/* RCC_OSPI2CFGR register fields */
#define RCC_OSPI2CFGR_OSPI2RST			BIT(0)
#define RCC_OSPI2CFGR_OSPI2EN			BIT(1)
#define RCC_OSPI2CFGR_OSPI2LPEN			BIT(2)
#define RCC_OSPI2CFGR_OTFDEC2RST		BIT(8)
#define RCC_OSPI2CFGR_OSPI2DLLRST		BIT(16)

/* RCC_OSPIxCFGR register fields */
#define RCC_OSPIxCFGR_OSPIxRST			BIT(0)
#define RCC_OSPIxCFGR_OSPIxEN			BIT(1)
#define RCC_OSPIxCFGR_OSPIxLPEN			BIT(2)
#define RCC_OSPIxCFGR_OTFDECxRST		BIT(8)
#define RCC_OSPIxCFGR_OSPIxDLLRST		BIT(16)

/* RCC_FMCCFGR register fields */
#define RCC_FMCCFGR_FMCRST			BIT(0)
#define RCC_FMCCFGR_FMCEN			BIT(1)
#define RCC_FMCCFGR_FMCLPEN			BIT(2)

/* RCC_DBGCFGR register fields */
#define RCC_DBGCFGR_DBGEN			BIT(8)
#define RCC_DBGCFGR_TRACEEN			BIT(9)
#define RCC_DBGCFGR_DBGRST			BIT(12)

/* RCC_STM500CFGR register fields */
#define RCC_STM500CFGR_STM500EN			BIT(1)
#define RCC_STM500CFGR_STM500LPEN		BIT(2)

/* RCC_ETRCFGR register fields */
#define RCC_ETRCFGR_ETREN			BIT(1)
#define RCC_ETRCFGR_ETRLPEN			BIT(2)

/* RCC_GPIOACFGR register fields */
#define RCC_GPIOACFGR_GPIOARST			BIT(0)
#define RCC_GPIOACFGR_GPIOAEN			BIT(1)
#define RCC_GPIOACFGR_GPIOALPEN			BIT(2)

/* RCC_GPIOBCFGR register fields */
#define RCC_GPIOBCFGR_GPIOBRST			BIT(0)
#define RCC_GPIOBCFGR_GPIOBEN			BIT(1)
#define RCC_GPIOBCFGR_GPIOBLPEN			BIT(2)

/* RCC_GPIOCCFGR register fields */
#define RCC_GPIOCCFGR_GPIOCRST			BIT(0)
#define RCC_GPIOCCFGR_GPIOCEN			BIT(1)
#define RCC_GPIOCCFGR_GPIOCLPEN			BIT(2)

/* RCC_GPIODCFGR register fields */
#define RCC_GPIODCFGR_GPIODRST			BIT(0)
#define RCC_GPIODCFGR_GPIODEN			BIT(1)
#define RCC_GPIODCFGR_GPIODLPEN			BIT(2)

/* RCC_GPIOECFGR register fields */
#define RCC_GPIOECFGR_GPIOERST			BIT(0)
#define RCC_GPIOECFGR_GPIOEEN			BIT(1)
#define RCC_GPIOECFGR_GPIOELPEN			BIT(2)

/* RCC_GPIOFCFGR register fields */
#define RCC_GPIOFCFGR_GPIOFRST			BIT(0)
#define RCC_GPIOFCFGR_GPIOFEN			BIT(1)
#define RCC_GPIOFCFGR_GPIOFLPEN			BIT(2)

/* RCC_GPIOGCFGR register fields */
#define RCC_GPIOGCFGR_GPIOGRST			BIT(0)
#define RCC_GPIOGCFGR_GPIOGEN			BIT(1)
#define RCC_GPIOGCFGR_GPIOGLPEN			BIT(2)

/* RCC_GPIOHCFGR register fields */
#define RCC_GPIOHCFGR_GPIOHRST			BIT(0)
#define RCC_GPIOHCFGR_GPIOHEN			BIT(1)
#define RCC_GPIOHCFGR_GPIOHLPEN			BIT(2)

/* RCC_GPIOICFGR register fields */
#define RCC_GPIOICFGR_GPIOIRST			BIT(0)
#define RCC_GPIOICFGR_GPIOIEN			BIT(1)
#define RCC_GPIOICFGR_GPIOILPEN			BIT(2)

/* RCC_GPIOJCFGR register fields */
#define RCC_GPIOJCFGR_GPIOJRST			BIT(0)
#define RCC_GPIOJCFGR_GPIOJEN			BIT(1)
#define RCC_GPIOJCFGR_GPIOJLPEN			BIT(2)

/* RCC_GPIOKCFGR register fields */
#define RCC_GPIOKCFGR_GPIOKRST			BIT(0)
#define RCC_GPIOKCFGR_GPIOKEN			BIT(1)
#define RCC_GPIOKCFGR_GPIOKLPEN			BIT(2)

/* RCC_GPIOZCFGR register fields */
#define RCC_GPIOZCFGR_GPIOZRST			BIT(0)
#define RCC_GPIOZCFGR_GPIOZEN			BIT(1)
#define RCC_GPIOZCFGR_GPIOZLPEN			BIT(2)
#define RCC_GPIOZCFGR_GPIOZAMEN			BIT(3)

/* RCC_GPIOxCFGR register fields */
#define RCC_GPIOxCFGR_GPIOxRST			BIT(0)
#define RCC_GPIOxCFGR_GPIOxEN			BIT(1)
#define RCC_GPIOxCFGR_GPIOxLPEN			BIT(2)
#define RCC_GPIOxCFGR_GPIOxAMEN			BIT(3)

/* RCC_HPDMA1CFGR register fields */
#define RCC_HPDMA1CFGR_HPDMA1RST		BIT(0)
#define RCC_HPDMA1CFGR_HPDMA1EN			BIT(1)
#define RCC_HPDMA1CFGR_HPDMA1LPEN		BIT(2)

/* RCC_HPDMA2CFGR register fields */
#define RCC_HPDMA2CFGR_HPDMA2RST		BIT(0)
#define RCC_HPDMA2CFGR_HPDMA2EN			BIT(1)
#define RCC_HPDMA2CFGR_HPDMA2LPEN		BIT(2)

/* RCC_HPDMA3CFGR register fields */
#define RCC_HPDMA3CFGR_HPDMA3RST		BIT(0)
#define RCC_HPDMA3CFGR_HPDMA3EN			BIT(1)
#define RCC_HPDMA3CFGR_HPDMA3LPEN		BIT(2)

/* RCC_HPDMAxCFGR register fields */
#define RCC_HPDMAxCFGR_HPDMAxRST		BIT(0)
#define RCC_HPDMAxCFGR_HPDMAxEN			BIT(1)
#define RCC_HPDMAxCFGR_HPDMAxLPEN		BIT(2)

/* RCC_LPDMACFGR register fields */
#define RCC_LPDMACFGR_LPDMARST			BIT(0)
#define RCC_LPDMACFGR_LPDMAEN			BIT(1)
#define RCC_LPDMACFGR_LPDMALPEN			BIT(2)
#define RCC_LPDMACFGR_LPDMAAMEN			BIT(3)

/* RCC_HSEMCFGR register fields */
#define RCC_HSEMCFGR_HSEMRST			BIT(0)
#define RCC_HSEMCFGR_HSEMEN			BIT(1)
#define RCC_HSEMCFGR_HSEMLPEN			BIT(2)
#define RCC_HSEMCFGR_HSEMAMEN			BIT(3)

/* RCC_IPCC1CFGR register fields */
#define RCC_IPCC1CFGR_IPCC1RST			BIT(0)
#define RCC_IPCC1CFGR_IPCC1EN			BIT(1)
#define RCC_IPCC1CFGR_IPCC1LPEN			BIT(2)

/* RCC_IPCC2CFGR register fields */
#define RCC_IPCC2CFGR_IPCC2RST			BIT(0)
#define RCC_IPCC2CFGR_IPCC2EN			BIT(1)
#define RCC_IPCC2CFGR_IPCC2LPEN			BIT(2)
#define RCC_IPCC2CFGR_IPCC2AMEN			BIT(3)

/* RCC_RTCCFGR register fields */
#define RCC_RTCCFGR_RTCEN			BIT(1)
#define RCC_RTCCFGR_RTCLPEN			BIT(2)
#define RCC_RTCCFGR_RTCAMEN			BIT(3)

/* RCC_SYSCPU1CFGR register fields */
#define RCC_SYSCPU1CFGR_SYSCPU1EN		BIT(1)
#define RCC_SYSCPU1CFGR_SYSCPU1LPEN		BIT(2)

/* RCC_BSECCFGR register fields */
#define RCC_BSECCFGR_BSECEN			BIT(1)
#define RCC_BSECCFGR_BSECLPEN			BIT(2)

/* RCC_IS2MCFGR register fields */
#define RCC_IS2MCFGR_IS2MRST			BIT(0)
#define RCC_IS2MCFGR_IS2MEN			BIT(1)
#define RCC_IS2MCFGR_IS2MLPEN			BIT(2)

/* RCC_PLL2CFGR1 register fields */
#define RCC_PLL2CFGR1_SSMODRST			BIT(0)
#define RCC_PLL2CFGR1_PLLEN			BIT(8)
#define RCC_PLL2CFGR1_PLLRDY			BIT(24)
#define RCC_PLL2CFGR1_CKREFST			BIT(28)

