DanielMartensson/STM32-Computer/STM32CubeIDE/STM32-Computer-Firmware/CA7/tf-a-2.8.15-r2/tf-a-stm32mp-v2.8.15-stm32mp-r2/include/drivers/st/stm32mp2_rcc.h
/* RCC_PLL2CFGR2 register fields */
#define RCC_PLL2CFGR2_FREFDIV_MASK		GENMASK(5, 0)
#define RCC_PLL2CFGR2_FREFDIV_SHIFT		0
#define RCC_PLL2CFGR2_FBDIV_MASK		GENMASK(27, 16)
#define RCC_PLL2CFGR2_FBDIV_SHIFT		16

/* RCC_PLL2CFGR3 register fields */
#define RCC_PLL2CFGR3_FRACIN_MASK		GENMASK(23, 0)
#define RCC_PLL2CFGR3_FRACIN_SHIFT		0
#define RCC_PLL2CFGR3_DOWNSPREAD		BIT(24)
#define RCC_PLL2CFGR3_DACEN			BIT(25)
#define RCC_PLL2CFGR3_SSCGDIS			BIT(26)

/* RCC_PLL2CFGR4 register fields */
#define RCC_PLL2CFGR4_DSMEN			BIT(8)
#define RCC_PLL2CFGR4_FOUTPOSTDIVEN		BIT(9)
#define RCC_PLL2CFGR4_BYPASS			BIT(10)

/* RCC_PLL2CFGR5 register fields */
#define RCC_PLL2CFGR5_DIVVAL_MASK		GENMASK(3, 0)
#define RCC_PLL2CFGR5_DIVVAL_SHIFT		0
#define RCC_PLL2CFGR5_SPREAD_MASK		GENMASK(20, 16)
#define RCC_PLL2CFGR5_SPREAD_SHIFT		16

/* RCC_PLL2CFGR6 register fields */
#define RCC_PLL2CFGR6_POSTDIV1_MASK		GENMASK(2, 0)
#define RCC_PLL2CFGR6_POSTDIV1_SHIFT		0

/* RCC_PLL2CFGR7 register fields */
#define RCC_PLL2CFGR7_POSTDIV2_MASK		GENMASK(2, 0)
#define RCC_PLL2CFGR7_POSTDIV2_SHIFT		0

/* RCC_PLL3CFGR1 register fields */
#define RCC_PLL3CFGR1_SSMODRST			BIT(0)
#define RCC_PLL3CFGR1_PLLEN			BIT(8)
#define RCC_PLL3CFGR1_PLLRDY			BIT(24)
#define RCC_PLL3CFGR1_CKREFST			BIT(28)

/* RCC_PLL3CFGR2 register fields */
#define RCC_PLL3CFGR2_FREFDIV_MASK		GENMASK(5, 0)
#define RCC_PLL3CFGR2_FREFDIV_SHIFT		0
#define RCC_PLL3CFGR2_FBDIV_MASK		GENMASK(27, 16)
#define RCC_PLL3CFGR2_FBDIV_SHIFT		16

/* RCC_PLL3CFGR3 register fields */
#define RCC_PLL3CFGR3_FRACIN_MASK		GENMASK(23, 0)
#define RCC_PLL3CFGR3_FRACIN_SHIFT		0
#define RCC_PLL3CFGR3_DOWNSPREAD		BIT(24)
#define RCC_PLL3CFGR3_DACEN			BIT(25)
#define RCC_PLL3CFGR3_SSCGDIS			BIT(26)

/* RCC_PLL3CFGR4 register fields */
#define RCC_PLL3CFGR4_DSMEN			BIT(8)
#define RCC_PLL3CFGR4_FOUTPOSTDIVEN		BIT(9)
#define RCC_PLL3CFGR4_BYPASS			BIT(10)

/* RCC_PLL3CFGR5 register fields */
#define RCC_PLL3CFGR5_DIVVAL_MASK		GENMASK(3, 0)
#define RCC_PLL3CFGR5_DIVVAL_SHIFT		0
#define RCC_PLL3CFGR5_SPREAD_MASK		GENMASK(20, 16)
#define RCC_PLL3CFGR5_SPREAD_SHIFT		16

/* RCC_PLL3CFGR6 register fields */
#define RCC_PLL3CFGR6_POSTDIV1_MASK		GENMASK(2, 0)
#define RCC_PLL3CFGR6_POSTDIV1_SHIFT		0

/* RCC_PLL3CFGR7 register fields */
#define RCC_PLL3CFGR7_POSTDIV2_MASK		GENMASK(2, 0)
#define RCC_PLL3CFGR7_POSTDIV2_SHIFT		0

/* RCC_PLLxCFGR1 register fields */
#define RCC_PLLxCFGR1_SSMODRST			BIT(0)
#define RCC_PLLxCFGR1_PLLEN			BIT(8)
#define RCC_PLLxCFGR1_PLLRDY			BIT(24)
#define RCC_PLLxCFGR1_CKREFST			BIT(28)

/* RCC_PLLxCFGR2 register fields */
#define RCC_PLLxCFGR2_FREFDIV_MASK		GENMASK(5, 0)
#define RCC_PLLxCFGR2_FREFDIV_SHIFT		0
#define RCC_PLLxCFGR2_FBDIV_MASK		GENMASK(27, 16)
#define RCC_PLLxCFGR2_FBDIV_SHIFT		16

/* RCC_PLLxCFGR3 register fields */
#define RCC_PLLxCFGR3_FRACIN_MASK		GENMASK(23, 0)
#define RCC_PLLxCFGR3_FRACIN_SHIFT		0
#define RCC_PLLxCFGR3_DOWNSPREAD		BIT(24)
#define RCC_PLLxCFGR3_DACEN			BIT(25)
#define RCC_PLLxCFGR3_SSCGDIS			BIT(26)

/* RCC_PLLxCFGR4 register fields */
#define RCC_PLLxCFGR4_DSMEN			BIT(8)
#define RCC_PLLxCFGR4_FOUTPOSTDIVEN		BIT(9)
#define RCC_PLLxCFGR4_BYPASS			BIT(10)

/* RCC_PLLxCFGR5 register fields */
#define RCC_PLLxCFGR5_DIVVAL_MASK		GENMASK(3, 0)
#define RCC_PLLxCFGR5_DIVVAL_SHIFT		0
#define RCC_PLLxCFGR5_SPREAD_MASK		GENMASK(20, 16)
#define RCC_PLLxCFGR5_SPREAD_SHIFT		16

/* RCC_PLLxCFGR6 register fields */
#define RCC_PLLxCFGR6_POSTDIV1_MASK		GENMASK(2, 0)
#define RCC_PLLxCFGR6_POSTDIV1_SHIFT		0

/* RCC_PLLxCFGR7 register fields */
#define RCC_PLLxCFGR7_POSTDIV2_MASK		GENMASK(2, 0)
#define RCC_PLLxCFGR7_POSTDIV2_SHIFT		0

/* RCC_HSIFMONCR register fields */
#define RCC_HSIFMONCR_HSIREF_MASK		GENMASK(10, 0)
#define RCC_HSIFMONCR_HSIREF_SHIFT		0
#define RCC_HSIFMONCR_HSIMONEN			BIT(15)
#define RCC_HSIFMONCR_HSIDEV_MASK		GENMASK(21, 16)
#define RCC_HSIFMONCR_HSIDEV_SHIFT		16
#define RCC_HSIFMONCR_HSIMONIE			BIT(30)
#define RCC_HSIFMONCR_HSIMONF			BIT(31)

/* RCC_HSIFVALR register fields */
#define RCC_HSIFVALR_HSIVAL_MASK		GENMASK(10, 0)
#define RCC_HSIFVALR_HSIVAL_SHIFT		0

/* RCC_TIM1CFGR register fields */
#define RCC_TIM1CFGR_TIM1RST			BIT(0)
#define RCC_TIM1CFGR_TIM1EN			BIT(1)
#define RCC_TIM1CFGR_TIM1LPEN			BIT(2)

/* RCC_TIM2CFGR register fields */
#define RCC_TIM2CFGR_TIM2RST			BIT(0)
#define RCC_TIM2CFGR_TIM2EN			BIT(1)
#define RCC_TIM2CFGR_TIM2LPEN			BIT(2)

/* RCC_TIM3CFGR register fields */
#define RCC_TIM3CFGR_TIM3RST			BIT(0)
#define RCC_TIM3CFGR_TIM3EN			BIT(1)
#define RCC_TIM3CFGR_TIM3LPEN			BIT(2)

/* RCC_TIM4CFGR register fields */
#define RCC_TIM4CFGR_TIM4RST			BIT(0)
#define RCC_TIM4CFGR_TIM4EN			BIT(1)
#define RCC_TIM4CFGR_TIM4LPEN			BIT(2)

/* RCC_TIM5CFGR register fields */
#define RCC_TIM5CFGR_TIM5RST			BIT(0)
#define RCC_TIM5CFGR_TIM5EN			BIT(1)
#define RCC_TIM5CFGR_TIM5LPEN			BIT(2)

/* RCC_TIM6CFGR register fields */
#define RCC_TIM6CFGR_TIM6RST			BIT(0)
#define RCC_TIM6CFGR_TIM6EN			BIT(1)
#define RCC_TIM6CFGR_TIM6LPEN			BIT(2)

/* RCC_TIM7CFGR register fields */
#define RCC_TIM7CFGR_TIM7RST			BIT(0)
#define RCC_TIM7CFGR_TIM7EN			BIT(1)
#define RCC_TIM7CFGR_TIM7LPEN			BIT(2)

/* RCC_TIM8CFGR register fields */
#define RCC_TIM8CFGR_TIM8RST			BIT(0)
#define RCC_TIM8CFGR_TIM8EN			BIT(1)
#define RCC_TIM8CFGR_TIM8LPEN			BIT(2)

/* RCC_TIM10CFGR register fields */
#define RCC_TIM10CFGR_TIM10RST			BIT(0)
#define RCC_TIM10CFGR_TIM10EN			BIT(1)
#define RCC_TIM10CFGR_TIM10LPEN			BIT(2)

/* RCC_TIM11CFGR register fields */
#define RCC_TIM11CFGR_TIM11RST			BIT(0)
#define RCC_TIM11CFGR_TIM11EN			BIT(1)
#define RCC_TIM11CFGR_TIM11LPEN			BIT(2)

/* RCC_TIM12CFGR register fields */
#define RCC_TIM12CFGR_TIM12RST			BIT(0)
#define RCC_TIM12CFGR_TIM12EN			BIT(1)
#define RCC_TIM12CFGR_TIM12LPEN			BIT(2)

/* RCC_TIM13CFGR register fields */
#define RCC_TIM13CFGR_TIM13RST			BIT(0)
#define RCC_TIM13CFGR_TIM13EN			BIT(1)
#define RCC_TIM13CFGR_TIM13LPEN			BIT(2)

/* RCC_TIM14CFGR register fields */
#define RCC_TIM14CFGR_TIM14RST			BIT(0)
#define RCC_TIM14CFGR_TIM14EN			BIT(1)
#define RCC_TIM14CFGR_TIM14LPEN			BIT(2)

/* RCC_TIM15CFGR register fields */
#define RCC_TIM15CFGR_TIM15RST			BIT(0)
#define RCC_TIM15CFGR_TIM15EN			BIT(1)
#define RCC_TIM15CFGR_TIM15LPEN			BIT(2)

/* RCC_TIM16CFGR register fields */
#define RCC_TIM16CFGR_TIM16RST			BIT(0)
#define RCC_TIM16CFGR_TIM16EN			BIT(1)
#define RCC_TIM16CFGR_TIM16LPEN			BIT(2)

/* RCC_TIM17CFGR register fields */
#define RCC_TIM17CFGR_TIM17RST			BIT(0)
#define RCC_TIM17CFGR_TIM17EN			BIT(1)
#define RCC_TIM17CFGR_TIM17LPEN			BIT(2)

/* RCC_TIM20CFGR register fields */
#define RCC_TIM20CFGR_TIM20RST			BIT(0)
#define RCC_TIM20CFGR_TIM20EN			BIT(1)
#define RCC_TIM20CFGR_TIM20LPEN			BIT(2)

/* RCC_LPTIM1CFGR register fields */
#define RCC_LPTIM1CFGR_LPTIM1RST		BIT(0)
#define RCC_LPTIM1CFGR_LPTIM1EN			BIT(1)
#define RCC_LPTIM1CFGR_LPTIM1LPEN		BIT(2)

/* RCC_LPTIM2CFGR register fields */
#define RCC_LPTIM2CFGR_LPTIM2RST		BIT(0)
#define RCC_LPTIM2CFGR_LPTIM2EN			BIT(1)
#define RCC_LPTIM2CFGR_LPTIM2LPEN		BIT(2)

/* RCC_LPTIM3CFGR register fields */
#define RCC_LPTIM3CFGR_LPTIM3RST		BIT(0)
#define RCC_LPTIM3CFGR_LPTIM3EN			BIT(1)
#define RCC_LPTIM3CFGR_LPTIM3LPEN		BIT(2)
#define RCC_LPTIM3CFGR_LPTIM3AMEN		BIT(3)

/* RCC_LPTIM4CFGR register fields */
#define RCC_LPTIM4CFGR_LPTIM4RST		BIT(0)
#define RCC_LPTIM4CFGR_LPTIM4EN			BIT(1)
#define RCC_LPTIM4CFGR_LPTIM4LPEN		BIT(2)
#define RCC_LPTIM4CFGR_LPTIM4AMEN		BIT(3)

/* RCC_LPTIM5CFGR register fields */
#define RCC_LPTIM5CFGR_LPTIM5RST		BIT(0)
#define RCC_LPTIM5CFGR_LPTIM5EN			BIT(1)
#define RCC_LPTIM5CFGR_LPTIM5LPEN		BIT(2)
#define RCC_LPTIM5CFGR_LPTIM5AMEN		BIT(3)

/* RCC_LPTIMxCFGR register fields */
#define RCC_LPTIMxCFGR_LPTIMxRST		BIT(0)
#define RCC_LPTIMxCFGR_LPTIMxEN			BIT(1)
#define RCC_LPTIMxCFGR_LPTIMxLPEN		BIT(2)
#define RCC_LPTIMxCFGR_LPTIMxAMEN		BIT(3)

