DanielMartensson/STM32-Computer/STM32CubeIDE/STM32-Computer-Firmware/CA7/tf-a-2.8.15-r2/tf-a-stm32mp-v2.8.15-stm32mp-r2/include/drivers/st/stm32mp2_rcc.h
/* RCC_SPI1CFGR register fields */
#define RCC_SPI1CFGR_SPI1RST			BIT(0)
#define RCC_SPI1CFGR_SPI1EN			BIT(1)
#define RCC_SPI1CFGR_SPI1LPEN			BIT(2)

/* RCC_SPI2CFGR register fields */
#define RCC_SPI2CFGR_SPI2RST			BIT(0)
#define RCC_SPI2CFGR_SPI2EN			BIT(1)
#define RCC_SPI2CFGR_SPI2LPEN			BIT(2)

/* RCC_SPI3CFGR register fields */
#define RCC_SPI3CFGR_SPI3RST			BIT(0)
#define RCC_SPI3CFGR_SPI3EN			BIT(1)
#define RCC_SPI3CFGR_SPI3LPEN			BIT(2)

/* RCC_SPI4CFGR register fields */
#define RCC_SPI4CFGR_SPI4RST			BIT(0)
#define RCC_SPI4CFGR_SPI4EN			BIT(1)
#define RCC_SPI4CFGR_SPI4LPEN			BIT(2)

/* RCC_SPI5CFGR register fields */
#define RCC_SPI5CFGR_SPI5RST			BIT(0)
#define RCC_SPI5CFGR_SPI5EN			BIT(1)
#define RCC_SPI5CFGR_SPI5LPEN			BIT(2)

/* RCC_SPI6CFGR register fields */
#define RCC_SPI6CFGR_SPI6RST			BIT(0)
#define RCC_SPI6CFGR_SPI6EN			BIT(1)
#define RCC_SPI6CFGR_SPI6LPEN			BIT(2)

/* RCC_SPI7CFGR register fields */
#define RCC_SPI7CFGR_SPI7RST			BIT(0)
#define RCC_SPI7CFGR_SPI7EN			BIT(1)
#define RCC_SPI7CFGR_SPI7LPEN			BIT(2)

/* RCC_SPI8CFGR register fields */
#define RCC_SPI8CFGR_SPI8RST			BIT(0)
#define RCC_SPI8CFGR_SPI8EN			BIT(1)
#define RCC_SPI8CFGR_SPI8LPEN			BIT(2)
#define RCC_SPI8CFGR_SPI8AMEN			BIT(3)

/* RCC_SPIxCFGR register fields */
#define RCC_SPIxCFGR_SPIxRST			BIT(0)
#define RCC_SPIxCFGR_SPIxEN			BIT(1)
#define RCC_SPIxCFGR_SPIxLPEN			BIT(2)
#define RCC_SPIxCFGR_SPIxAMEN			BIT(3)

/* RCC_SPDIFRXCFGR register fields */
#define RCC_SPDIFRXCFGR_SPDIFRXRST		BIT(0)
#define RCC_SPDIFRXCFGR_SPDIFRXEN		BIT(1)
#define RCC_SPDIFRXCFGR_SPDIFRXLPEN		BIT(2)

/* RCC_USART1CFGR register fields */
#define RCC_USART1CFGR_USART1RST		BIT(0)
#define RCC_USART1CFGR_USART1EN			BIT(1)
#define RCC_USART1CFGR_USART1LPEN		BIT(2)

/* RCC_USART2CFGR register fields */
#define RCC_USART2CFGR_USART2RST		BIT(0)
#define RCC_USART2CFGR_USART2EN			BIT(1)
#define RCC_USART2CFGR_USART2LPEN		BIT(2)

/* RCC_USART3CFGR register fields */
#define RCC_USART3CFGR_USART3RST		BIT(0)
#define RCC_USART3CFGR_USART3EN			BIT(1)
#define RCC_USART3CFGR_USART3LPEN		BIT(2)

/* RCC_UART4CFGR register fields */
#define RCC_UART4CFGR_UART4RST			BIT(0)
#define RCC_UART4CFGR_UART4EN			BIT(1)
#define RCC_UART4CFGR_UART4LPEN			BIT(2)

/* RCC_UART5CFGR register fields */
#define RCC_UART5CFGR_UART5RST			BIT(0)
#define RCC_UART5CFGR_UART5EN			BIT(1)
#define RCC_UART5CFGR_UART5LPEN			BIT(2)

/* RCC_USART6CFGR register fields */
#define RCC_USART6CFGR_USART6RST		BIT(0)
#define RCC_USART6CFGR_USART6EN			BIT(1)
#define RCC_USART6CFGR_USART6LPEN		BIT(2)

/* RCC_UART7CFGR register fields */
#define RCC_UART7CFGR_UART7RST			BIT(0)
#define RCC_UART7CFGR_UART7EN			BIT(1)
#define RCC_UART7CFGR_UART7LPEN			BIT(2)

/* RCC_UART8CFGR register fields */
#define RCC_UART8CFGR_UART8RST			BIT(0)
#define RCC_UART8CFGR_UART8EN			BIT(1)
#define RCC_UART8CFGR_UART8LPEN			BIT(2)

/* RCC_UART9CFGR register fields */
#define RCC_UART9CFGR_UART9RST			BIT(0)
#define RCC_UART9CFGR_UART9EN			BIT(1)
#define RCC_UART9CFGR_UART9LPEN			BIT(2)

/* RCC_USARTxCFGR register fields */
#define RCC_USARTxCFGR_USARTxRST		BIT(0)
#define RCC_USARTxCFGR_USARTxEN			BIT(1)
#define RCC_USARTxCFGR_USARTxLPEN		BIT(2)

/* RCC_UARTxCFGR register fields */
#define RCC_UARTxCFGR_UARTxRST			BIT(0)
#define RCC_UARTxCFGR_UARTxEN			BIT(1)
#define RCC_UARTxCFGR_UARTxLPEN			BIT(2)

/* RCC_LPUART1CFGR register fields */
#define RCC_LPUART1CFGR_LPUART1RST		BIT(0)
#define RCC_LPUART1CFGR_LPUART1EN		BIT(1)
#define RCC_LPUART1CFGR_LPUART1LPEN		BIT(2)
#define RCC_LPUART1CFGR_LPUART1AMEN		BIT(3)

/* RCC_I2C1CFGR register fields */
#define RCC_I2C1CFGR_I2C1RST			BIT(0)
#define RCC_I2C1CFGR_I2C1EN			BIT(1)
#define RCC_I2C1CFGR_I2C1LPEN			BIT(2)

/* RCC_I2C2CFGR register fields */
#define RCC_I2C2CFGR_I2C2RST			BIT(0)
#define RCC_I2C2CFGR_I2C2EN			BIT(1)
#define RCC_I2C2CFGR_I2C2LPEN			BIT(2)

/* RCC_I2C3CFGR register fields */
#define RCC_I2C3CFGR_I2C3RST			BIT(0)
#define RCC_I2C3CFGR_I2C3EN			BIT(1)
#define RCC_I2C3CFGR_I2C3LPEN			BIT(2)

/* RCC_I2C4CFGR register fields */
#define RCC_I2C4CFGR_I2C4RST			BIT(0)
#define RCC_I2C4CFGR_I2C4EN			BIT(1)
#define RCC_I2C4CFGR_I2C4LPEN			BIT(2)

/* RCC_I2C5CFGR register fields */
#define RCC_I2C5CFGR_I2C5RST			BIT(0)
#define RCC_I2C5CFGR_I2C5EN			BIT(1)
#define RCC_I2C5CFGR_I2C5LPEN			BIT(2)

/* RCC_I2C6CFGR register fields */
#define RCC_I2C6CFGR_I2C6RST			BIT(0)
#define RCC_I2C6CFGR_I2C6EN			BIT(1)
#define RCC_I2C6CFGR_I2C6LPEN			BIT(2)

/* RCC_I2C7CFGR register fields */
#define RCC_I2C7CFGR_I2C7RST			BIT(0)
#define RCC_I2C7CFGR_I2C7EN			BIT(1)
#define RCC_I2C7CFGR_I2C7LPEN			BIT(2)

/* RCC_I2C8CFGR register fields */
#define RCC_I2C8CFGR_I2C8RST			BIT(0)
#define RCC_I2C8CFGR_I2C8EN			BIT(1)
#define RCC_I2C8CFGR_I2C8LPEN			BIT(2)
#define RCC_I2C8CFGR_I2C8AMEN			BIT(3)

/* RCC_I2CxCFGR register fields */
#define RCC_I2CxCFGR_I2CxRST			BIT(0)
#define RCC_I2CxCFGR_I2CxEN			BIT(1)
#define RCC_I2CxCFGR_I2CxLPEN			BIT(2)
#define RCC_I2CxCFGR_I2CxAMEN			BIT(3)

/* RCC_SAI1CFGR register fields */
#define RCC_SAI1CFGR_SAI1RST			BIT(0)
#define RCC_SAI1CFGR_SAI1EN			BIT(1)
#define RCC_SAI1CFGR_SAI1LPEN			BIT(2)

/* RCC_SAI2CFGR register fields */
#define RCC_SAI2CFGR_SAI2RST			BIT(0)
#define RCC_SAI2CFGR_SAI2EN			BIT(1)
#define RCC_SAI2CFGR_SAI2LPEN			BIT(2)

/* RCC_SAI3CFGR register fields */
#define RCC_SAI3CFGR_SAI3RST			BIT(0)
#define RCC_SAI3CFGR_SAI3EN			BIT(1)
#define RCC_SAI3CFGR_SAI3LPEN			BIT(2)

/* RCC_SAI4CFGR register fields */
#define RCC_SAI4CFGR_SAI4RST			BIT(0)
#define RCC_SAI4CFGR_SAI4EN			BIT(1)
#define RCC_SAI4CFGR_SAI4LPEN			BIT(2)

/* RCC_SAIxCFGR register fields */
#define RCC_SAIxCFGR_SAIxRST			BIT(0)
#define RCC_SAIxCFGR_SAIxEN			BIT(1)
#define RCC_SAIxCFGR_SAIxLPEN			BIT(2)

/* RCC_MDF1CFGR register fields */
#define RCC_MDF1CFGR_MDF1RST			BIT(0)
#define RCC_MDF1CFGR_MDF1EN			BIT(1)
#define RCC_MDF1CFGR_MDF1LPEN			BIT(2)

/* RCC_ADF1CFGR register fields */
#define RCC_ADF1CFGR_ADF1RST			BIT(0)
#define RCC_ADF1CFGR_ADF1EN			BIT(1)
#define RCC_ADF1CFGR_ADF1LPEN			BIT(2)
#define RCC_ADF1CFGR_ADF1AMEN			BIT(3)

/* RCC_FDCANCFGR register fields */
#define RCC_FDCANCFGR_FDCANRST			BIT(0)
#define RCC_FDCANCFGR_FDCANEN			BIT(1)
#define RCC_FDCANCFGR_FDCANLPEN			BIT(2)

/* RCC_HDPCFGR register fields */
#define RCC_HDPCFGR_HDPRST			BIT(0)
#define RCC_HDPCFGR_HDPEN			BIT(1)

