DanielMartensson/STM32-Computer/STM32CubeIDE/STM32-Computer-Firmware/CA7/tf-a-2.8.15-r2/tf-a-stm32mp-v2.8.15-stm32mp-r2/include/drivers/st/stm32mp2_rcc.h
/* RCC_ADC12CFGR register fields */
#define RCC_ADC12CFGR_ADC12RST			BIT(0)
#define RCC_ADC12CFGR_ADC12EN			BIT(1)
#define RCC_ADC12CFGR_ADC12LPEN			BIT(2)
#define RCC_ADC12CFGR_ADC12KERSEL		BIT(12)

/* RCC_ADC3CFGR register fields */
#define RCC_ADC3CFGR_ADC3RST			BIT(0)
#define RCC_ADC3CFGR_ADC3EN			BIT(1)
#define RCC_ADC3CFGR_ADC3LPEN			BIT(2)
#define RCC_ADC3CFGR_ADC3KERSEL_MASK		GENMASK(13, 12)
#define RCC_ADC3CFGR_ADC3KERSEL_SHIFT		12

/* RCC_ETH1CFGR register fields */
#define RCC_ETH1CFGR_ETH1RST			BIT(0)
#define RCC_ETH1CFGR_ETH1MACEN			BIT(1)
#define RCC_ETH1CFGR_ETH1MACLPEN		BIT(2)
#define RCC_ETH1CFGR_ETH1STPEN			BIT(4)
#define RCC_ETH1CFGR_ETH1EN			BIT(5)
#define RCC_ETH1CFGR_ETH1LPEN			BIT(6)
#define RCC_ETH1CFGR_ETH1TXEN			BIT(8)
#define RCC_ETH1CFGR_ETH1TXLPEN			BIT(9)
#define RCC_ETH1CFGR_ETH1RXEN			BIT(10)
#define RCC_ETH1CFGR_ETH1RXLPEN			BIT(11)

/* RCC_ETH2CFGR register fields */
#define RCC_ETH2CFGR_ETH2RST			BIT(0)
#define RCC_ETH2CFGR_ETH2MACEN			BIT(1)
#define RCC_ETH2CFGR_ETH2MACLPEN		BIT(2)
#define RCC_ETH2CFGR_ETH2STPEN			BIT(4)
#define RCC_ETH2CFGR_ETH2EN			BIT(5)
#define RCC_ETH2CFGR_ETH2LPEN			BIT(6)
#define RCC_ETH2CFGR_ETH2TXEN			BIT(8)
#define RCC_ETH2CFGR_ETH2TXLPEN			BIT(9)
#define RCC_ETH2CFGR_ETH2RXEN			BIT(10)
#define RCC_ETH2CFGR_ETH2RXLPEN			BIT(11)

/* RCC_ETHxCFGR register fields */
#define RCC_ETHxCFGR_ETHxRST			BIT(0)
#define RCC_ETHxCFGR_ETHxMACEN			BIT(1)
#define RCC_ETHxCFGR_ETHxMACLPEN		BIT(2)
#define RCC_ETHxCFGR_ETHxSTPEN			BIT(4)
#define RCC_ETHxCFGR_ETHxEN			BIT(5)
#define RCC_ETHxCFGR_ETHxLPEN			BIT(6)
#define RCC_ETHxCFGR_ETHxTXEN			BIT(8)
#define RCC_ETHxCFGR_ETHxTXLPEN			BIT(9)
#define RCC_ETHxCFGR_ETHxRXEN			BIT(10)
#define RCC_ETHxCFGR_ETHxRXLPEN			BIT(11)

/* RCC_USB2CFGR register fields */
#define RCC_USB2CFGR_USB2RST			BIT(0)
#define RCC_USB2CFGR_USB2EN			BIT(1)
#define RCC_USB2CFGR_USB2LPEN			BIT(2)
#define RCC_USB2CFGR_USB2STPEN			BIT(4)

/* RCC_USB2PHY1CFGR register fields */
#define RCC_USB2PHY1CFGR_USB2PHY1RST		BIT(0)
#define RCC_USB2PHY1CFGR_USB2PHY1EN		BIT(1)
#define RCC_USB2PHY1CFGR_USB2PHY1LPEN		BIT(2)
#define RCC_USB2PHY1CFGR_USB2PHY1STPEN		BIT(4)
#define RCC_USB2PHY1CFGR_USB2PHY1CKREFSEL	BIT(15)

/* RCC_USB2PHY2CFGR register fields */
#define RCC_USB2PHY2CFGR_USB2PHY2RST		BIT(0)
#define RCC_USB2PHY2CFGR_USB2PHY2EN		BIT(1)
#define RCC_USB2PHY2CFGR_USB2PHY2LPEN		BIT(2)
#define RCC_USB2PHY2CFGR_USB2PHY2STPEN		BIT(4)
#define RCC_USB2PHY2CFGR_USB2PHY2CKREFSEL	BIT(15)

/* RCC_USB2PHYxCFGR register fields */
#define RCC_USB2PHYxCFGR_USB2PHY1RST		BIT(0)
#define RCC_USB2PHYxCFGR_USB2PHY1EN		BIT(1)
#define RCC_USB2PHYxCFGR_USB2PHY1LPEN		BIT(2)
#define RCC_USB2PHYxCFGR_USB2PHY1STPEN		BIT(4)
#define RCC_USB2PHYxCFGR_USB2PHY1CKREFSEL	BIT(15)

/* RCC_USB3DRCFGR register fields */
#define RCC_USB3DRCFGR_USB3DRRST		BIT(0)
#define RCC_USB3DRCFGR_USB3DREN			BIT(1)
#define RCC_USB3DRCFGR_USB3DRLPEN		BIT(2)
#define RCC_USB3DRCFGR_USB3DRSTPEN		BIT(4)

/* RCC_USB3PCIEPHYCFGR register fields */
#define RCC_USB3PCIEPHYCFGR_USB3PCIEPHYRST	BIT(0)
#define RCC_USB3PCIEPHYCFGR_USB3PCIEPHYEN	BIT(1)
#define RCC_USB3PCIEPHYCFGR_USB3PCIEPHYLPEN	BIT(2)
#define RCC_USB3PCIEPHYCFGR_USB3PCIEPHYSTPEN	BIT(4)
#define RCC_USB3PCIEPHYCFGR_USB3PCIEPHYCKREFSEL	BIT(15)

/* RCC_PCIECFGR register fields */
#define RCC_PCIECFGR_PCIERST			BIT(0)
#define RCC_PCIECFGR_PCIEEN			BIT(1)
#define RCC_PCIECFGR_PCIELPEN			BIT(2)
#define RCC_PCIECFGR_PCIESTPEN			BIT(4)

/* RCC_USBTCCFGR register fields */
#define RCC_USBTCCFGR_USBTCRST			BIT(0)
#define RCC_USBTCCFGR_USBTCEN			BIT(1)
#define RCC_USBTCCFGR_USBTCLPEN			BIT(2)

/* RCC_ETHSWCFGR register fields */
#define RCC_ETHSWCFGR_ETHSWRST			BIT(0)
#define RCC_ETHSWCFGR_ETHSWMACEN		BIT(1)
#define RCC_ETHSWCFGR_ETHSWMACLPEN		BIT(2)
#define RCC_ETHSWCFGR_ETHSWEN			BIT(5)
#define RCC_ETHSWCFGR_ETHSWLPEN			BIT(6)
#define RCC_ETHSWCFGR_ETHSWREFEN		BIT(21)
#define RCC_ETHSWCFGR_ETHSWREFLPEN		BIT(22)

/* RCC_ETHSWACMCFGR register fields */
#define RCC_ETHSWACMCFGR_ETHSWACMEN		BIT(1)
#define RCC_ETHSWACMCFGR_ETHSWACMLPEN		BIT(2)

/* RCC_ETHSWACMMSGCFGR register fields */
#define RCC_ETHSWACMMSGCFGR_ETHSWACMMSGEN	BIT(1)
#define RCC_ETHSWACMMSGCFGR_ETHSWACMMSGLPEN	BIT(2)

/* RCC_STGENCFGR register fields */
#define RCC_STGENCFGR_STGENEN			BIT(1)
#define RCC_STGENCFGR_STGENLPEN			BIT(2)
#define RCC_STGENCFGR_STGENSTPEN		BIT(4)

/* RCC_SDMMC1CFGR register fields */
#define RCC_SDMMC1CFGR_SDMMC1RST		BIT(0)
#define RCC_SDMMC1CFGR_SDMMC1EN			BIT(1)
#define RCC_SDMMC1CFGR_SDMMC1LPEN		BIT(2)
#define RCC_SDMMC1CFGR_SDMMC1DLLRST		BIT(16)

/* RCC_SDMMC2CFGR register fields */
#define RCC_SDMMC2CFGR_SDMMC2RST		BIT(0)
#define RCC_SDMMC2CFGR_SDMMC2EN			BIT(1)
#define RCC_SDMMC2CFGR_SDMMC2LPEN		BIT(2)
#define RCC_SDMMC2CFGR_SDMMC2DLLRST		BIT(16)

/* RCC_SDMMC3CFGR register fields */
#define RCC_SDMMC3CFGR_SDMMC3RST		BIT(0)
#define RCC_SDMMC3CFGR_SDMMC3EN			BIT(1)
#define RCC_SDMMC3CFGR_SDMMC3LPEN		BIT(2)
#define RCC_SDMMC3CFGR_SDMMC3DLLRST		BIT(16)

/* RCC_SDMMCxCFGR register fields */
#define RCC_SDMMCxCFGR_SDMMC1RST		BIT(0)
#define RCC_SDMMCxCFGR_SDMMC1EN			BIT(1)
#define RCC_SDMMCxCFGR_SDMMC1LPEN		BIT(2)
#define RCC_SDMMCxCFGR_SDMMC1DLLRST		BIT(16)

/* RCC_GPUCFGR register fields */
#define RCC_GPUCFGR_GPURST			BIT(0)
#define RCC_GPUCFGR_GPUEN			BIT(1)
#define RCC_GPUCFGR_GPULPEN			BIT(2)

/* RCC_LTDCCFGR register fields */
#define RCC_LTDCCFGR_LTDCRST			BIT(0)
#define RCC_LTDCCFGR_LTDCEN			BIT(1)
#define RCC_LTDCCFGR_LTDCLPEN			BIT(2)

/* RCC_DSICFGR register fields */
#define RCC_DSICFGR_DSIRST			BIT(0)
#define RCC_DSICFGR_DSIEN			BIT(1)
#define RCC_DSICFGR_DSILPEN			BIT(2)
#define RCC_DSICFGR_DSIBLSEL			BIT(12)
#define RCC_DSICFGR_DSIPHYCKREFSEL		BIT(15)

/* RCC_LVDSCFGR register fields */
#define RCC_LVDSCFGR_LVDSRST			BIT(0)
#define RCC_LVDSCFGR_LVDSEN			BIT(1)
#define RCC_LVDSCFGR_LVDSLPEN			BIT(2)
#define RCC_LVDSCFGR_LVDSPHYCKREFSEL		BIT(15)

/* RCC_CSI2CFGR register fields */
#define RCC_CSI2CFGR_CSI2RST			BIT(0)
#define RCC_CSI2CFGR_CSI2EN			BIT(1)
#define RCC_CSI2CFGR_CSI2LPEN			BIT(2)

/* RCC_DCMIPPCFGR register fields */
#define RCC_DCMIPPCFGR_DCMIPPRST		BIT(0)
#define RCC_DCMIPPCFGR_DCMIPPEN			BIT(1)
#define RCC_DCMIPPCFGR_DCMIPPLPEN		BIT(2)

/* RCC_CCICFGR register fields */
#define RCC_CCICFGR_CCIRST			BIT(0)
#define RCC_CCICFGR_CCIEN			BIT(1)
#define RCC_CCICFGR_CCILPEN			BIT(2)

/* RCC_VDECCFGR register fields */
#define RCC_VDECCFGR_VDECRST			BIT(0)
#define RCC_VDECCFGR_VDECEN			BIT(1)
#define RCC_VDECCFGR_VDECLPEN			BIT(2)

