DanielMartensson/STM32-Computer/STM32CubeIDE/STM32-Computer-Firmware/CA7/tf-a-2.8.15-r2/tf-a-stm32mp-v2.8.15-stm32mp-r2/include/drivers/st/stm32mp2_rcc.h
/* RCC_VENCCFGR register fields */
#define RCC_VENCCFGR_VENCRST			BIT(0)
#define RCC_VENCCFGR_VENCEN			BIT(1)
#define RCC_VENCCFGR_VENCLPEN			BIT(2)

/* RCC_RNGCFGR register fields */
#define RCC_RNGCFGR_RNGRST			BIT(0)
#define RCC_RNGCFGR_RNGEN			BIT(1)
#define RCC_RNGCFGR_RNGLPEN			BIT(2)

/* RCC_PKACFGR register fields */
#define RCC_PKACFGR_PKARST			BIT(0)
#define RCC_PKACFGR_PKAEN			BIT(1)
#define RCC_PKACFGR_PKALPEN			BIT(2)

/* RCC_SAESCFGR register fields */
#define RCC_SAESCFGR_SAESRST			BIT(0)
#define RCC_SAESCFGR_SAESEN			BIT(1)
#define RCC_SAESCFGR_SAESLPEN			BIT(2)

/* RCC_HASHCFGR register fields */
#define RCC_HASHCFGR_HASHRST			BIT(0)
#define RCC_HASHCFGR_HASHEN			BIT(1)
#define RCC_HASHCFGR_HASHLPEN			BIT(2)

/* RCC_CRYP1CFGR register fields */
#define RCC_CRYP1CFGR_CRYP1RST			BIT(0)
#define RCC_CRYP1CFGR_CRYP1EN			BIT(1)
#define RCC_CRYP1CFGR_CRYP1LPEN			BIT(2)

/* RCC_CRYP2CFGR register fields */
#define RCC_CRYP2CFGR_CRYP2RST			BIT(0)
#define RCC_CRYP2CFGR_CRYP2EN			BIT(1)
#define RCC_CRYP2CFGR_CRYP2LPEN			BIT(2)

/* RCC_CRYPxCFGR register fields */
#define RCC_CRYPxCFGR_CRYPxRST			BIT(0)
#define RCC_CRYPxCFGR_CRYPxEN			BIT(1)
#define RCC_CRYPxCFGR_CRYPxLPEN			BIT(2)

/* RCC_IWDG1CFGR register fields */
#define RCC_IWDG1CFGR_IWDG1EN			BIT(1)
#define RCC_IWDG1CFGR_IWDG1LPEN			BIT(2)

/* RCC_IWDG2CFGR register fields */
#define RCC_IWDG2CFGR_IWDG2EN			BIT(1)
#define RCC_IWDG2CFGR_IWDG2LPEN			BIT(2)

/* RCC_IWDG3CFGR register fields */
#define RCC_IWDG3CFGR_IWDG3EN			BIT(1)
#define RCC_IWDG3CFGR_IWDG3LPEN			BIT(2)

/* RCC_IWDG4CFGR register fields */
#define RCC_IWDG4CFGR_IWDG4EN			BIT(1)
#define RCC_IWDG4CFGR_IWDG4LPEN			BIT(2)

/* RCC_IWDGxCFGR register fields */
#define RCC_IWDGxCFGR_IWDGxEN			BIT(1)
#define RCC_IWDGxCFGR_IWDGxLPEN			BIT(2)

/* RCC_IWDG5CFGR register fields */
#define RCC_IWDG5CFGR_IWDG5EN			BIT(1)
#define RCC_IWDG5CFGR_IWDG5LPEN			BIT(2)
#define RCC_IWDG5CFGR_IWDG5AMEN			BIT(3)

/* RCC_WWDG1CFGR register fields */
#define RCC_WWDG1CFGR_WWDG1RST			BIT(0)
#define RCC_WWDG1CFGR_WWDG1EN			BIT(1)
#define RCC_WWDG1CFGR_WWDG1LPEN			BIT(2)

/* RCC_WWDG2CFGR register fields */
#define RCC_WWDG2CFGR_WWDG2RST			BIT(0)
#define RCC_WWDG2CFGR_WWDG2EN			BIT(1)
#define RCC_WWDG2CFGR_WWDG2LPEN			BIT(2)
#define RCC_WWDG2CFGR_WWDG2AMEN			BIT(3)

/* RCC_VREFCFGR register fields */
#define RCC_VREFCFGR_VREFRST			BIT(0)
#define RCC_VREFCFGR_VREFEN			BIT(1)
#define RCC_VREFCFGR_VREFLPEN			BIT(2)

/* RCC_TMPSENSCFGR register fields */
#define RCC_TMPSENSCFGR_TMPSENSRST		BIT(0)
#define RCC_TMPSENSCFGR_TMPSENSEN		BIT(1)
#define RCC_TMPSENSCFGR_TMPSENSLPEN		BIT(2)
#define RCC_TMPSENSCFGR_TMPSENSKERSEL_MASK	GENMASK(13, 12)
#define RCC_TMPSENSCFGR_TMPSENSKERSEL_SHIFT	12

/* RCC_CRCCFGR register fields */
#define RCC_CRCCFGR_CRCRST			BIT(0)
#define RCC_CRCCFGR_CRCEN			BIT(1)
#define RCC_CRCCFGR_CRCLPEN			BIT(2)

/* RCC_SERCCFGR register fields */
#define RCC_SERCCFGR_SERCRST			BIT(0)
#define RCC_SERCCFGR_SERCEN			BIT(1)
#define RCC_SERCCFGR_SERCLPEN			BIT(2)

/* RCC_OSPIIOMCFGR register fields */
#define RCC_OSPIIOMCFGR_OSPIIOMRST		BIT(0)
#define RCC_OSPIIOMCFGR_OSPIIOMEN		BIT(1)
#define RCC_OSPIIOMCFGR_OSPIIOMLPEN		BIT(2)

/* RCC_GICV2MCFGR register fields */
#define RCC_GICV2MCFGR_GICV2MEN			BIT(1)
#define RCC_GICV2MCFGR_GICV2MLPEN		BIT(2)

/* RCC_I3C1CFGR register fields */
#define RCC_I3C1CFGR_I3C1RST			BIT(0)
#define RCC_I3C1CFGR_I3C1EN			BIT(1)
#define RCC_I3C1CFGR_I3C1LPEN			BIT(2)

/* RCC_I3C2CFGR register fields */
#define RCC_I3C2CFGR_I3C2RST			BIT(0)
#define RCC_I3C2CFGR_I3C2EN			BIT(1)
#define RCC_I3C2CFGR_I3C2LPEN			BIT(2)

/* RCC_I3C3CFGR register fields */
#define RCC_I3C3CFGR_I3C3RST			BIT(0)
#define RCC_I3C3CFGR_I3C3EN			BIT(1)
#define RCC_I3C3CFGR_I3C3LPEN			BIT(2)

/* RCC_I3C4CFGR register fields */
#define RCC_I3C4CFGR_I3C4RST			BIT(0)
#define RCC_I3C4CFGR_I3C4EN			BIT(1)
#define RCC_I3C4CFGR_I3C4LPEN			BIT(2)
#define RCC_I3C4CFGR_I3C4AMEN			BIT(3)

/* RCC_I3CxCFGR register fields */
#define RCC_I3CxCFGR_I3CxRST			BIT(0)
#define RCC_I3CxCFGR_I3CxEN			BIT(1)
#define RCC_I3CxCFGR_I3CxLPEN			BIT(2)
#define RCC_I3CxCFGR_I3CxAMEN			BIT(3)

/* RCC_MUXSELCFGR register fields */
#define RCC_MUXSELCFGR_MUXSEL0_MASK		GENMASK(1, 0)
#define RCC_MUXSELCFGR_MUXSEL0_SHIFT		0
#define RCC_MUXSELCFGR_MUXSEL1_MASK		GENMASK(5, 4)
#define RCC_MUXSELCFGR_MUXSEL1_SHIFT		4
#define RCC_MUXSELCFGR_MUXSEL2_MASK		GENMASK(9, 8)
#define RCC_MUXSELCFGR_MUXSEL2_SHIFT		8
#define RCC_MUXSELCFGR_MUXSEL3_MASK		GENMASK(13, 12)
#define RCC_MUXSELCFGR_MUXSEL3_SHIFT		12
#define RCC_MUXSELCFGR_MUXSEL4_MASK		GENMASK(17, 16)
#define RCC_MUXSELCFGR_MUXSEL4_SHIFT		16
#define RCC_MUXSELCFGR_MUXSEL5_MASK		GENMASK(21, 20)
#define RCC_MUXSELCFGR_MUXSEL5_SHIFT		20
#define RCC_MUXSELCFGR_MUXSEL6_MASK		GENMASK(25, 24)
#define RCC_MUXSELCFGR_MUXSEL6_SHIFT		24
#define RCC_MUXSELCFGR_MUXSEL7_MASK		GENMASK(29, 28)
#define RCC_MUXSELCFGR_MUXSEL7_SHIFT		28

/* RCC_XBAR0CFGR register fields */
#define RCC_XBAR0CFGR_XBAR0SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR0CFGR_XBAR0SEL_SHIFT		0
#define RCC_XBAR0CFGR_XBAR0EN			BIT(6)
#define RCC_XBAR0CFGR_XBAR0STS			BIT(7)

/* RCC_XBAR1CFGR register fields */
#define RCC_XBAR1CFGR_XBAR1SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR1CFGR_XBAR1SEL_SHIFT		0
#define RCC_XBAR1CFGR_XBAR1EN			BIT(6)
#define RCC_XBAR1CFGR_XBAR1STS			BIT(7)

/* RCC_XBAR2CFGR register fields */
#define RCC_XBAR2CFGR_XBAR2SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR2CFGR_XBAR2SEL_SHIFT		0
#define RCC_XBAR2CFGR_XBAR2EN			BIT(6)
#define RCC_XBAR2CFGR_XBAR2STS			BIT(7)

/* RCC_XBAR3CFGR register fields */
#define RCC_XBAR3CFGR_XBAR3SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR3CFGR_XBAR3SEL_SHIFT		0
#define RCC_XBAR3CFGR_XBAR3EN			BIT(6)
#define RCC_XBAR3CFGR_XBAR3STS			BIT(7)

/* RCC_XBAR4CFGR register fields */
#define RCC_XBAR4CFGR_XBAR4SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR4CFGR_XBAR4SEL_SHIFT		0
#define RCC_XBAR4CFGR_XBAR4EN			BIT(6)
#define RCC_XBAR4CFGR_XBAR4STS			BIT(7)

/* RCC_XBAR5CFGR register fields */
#define RCC_XBAR5CFGR_XBAR5SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR5CFGR_XBAR5SEL_SHIFT		0
#define RCC_XBAR5CFGR_XBAR5EN			BIT(6)
#define RCC_XBAR5CFGR_XBAR5STS			BIT(7)

