DanielMartensson/STM32-Computer/STM32CubeIDE/STM32-Computer-Firmware/CA7/tf-a-2.8.15-r2/tf-a-stm32mp-v2.8.15-stm32mp-r2/include/drivers/st/stm32mp2_rcc.h
/* RCC_XBAR6CFGR register fields */
#define RCC_XBAR6CFGR_XBAR6SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR6CFGR_XBAR6SEL_SHIFT		0
#define RCC_XBAR6CFGR_XBAR6EN			BIT(6)
#define RCC_XBAR6CFGR_XBAR6STS			BIT(7)

/* RCC_XBAR7CFGR register fields */
#define RCC_XBAR7CFGR_XBAR7SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR7CFGR_XBAR7SEL_SHIFT		0
#define RCC_XBAR7CFGR_XBAR7EN			BIT(6)
#define RCC_XBAR7CFGR_XBAR7STS			BIT(7)

/* RCC_XBAR8CFGR register fields */
#define RCC_XBAR8CFGR_XBAR8SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR8CFGR_XBAR8SEL_SHIFT		0
#define RCC_XBAR8CFGR_XBAR8EN			BIT(6)
#define RCC_XBAR8CFGR_XBAR8STS			BIT(7)

/* RCC_XBAR9CFGR register fields */
#define RCC_XBAR9CFGR_XBAR9SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR9CFGR_XBAR9SEL_SHIFT		0
#define RCC_XBAR9CFGR_XBAR9EN			BIT(6)
#define RCC_XBAR9CFGR_XBAR9STS			BIT(7)

/* RCC_XBAR10CFGR register fields */
#define RCC_XBAR10CFGR_XBAR10SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR10CFGR_XBAR10SEL_SHIFT		0
#define RCC_XBAR10CFGR_XBAR10EN			BIT(6)
#define RCC_XBAR10CFGR_XBAR10STS		BIT(7)

/* RCC_XBAR11CFGR register fields */
#define RCC_XBAR11CFGR_XBAR11SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR11CFGR_XBAR11SEL_SHIFT		0
#define RCC_XBAR11CFGR_XBAR11EN			BIT(6)
#define RCC_XBAR11CFGR_XBAR11STS		BIT(7)

/* RCC_XBAR12CFGR register fields */
#define RCC_XBAR12CFGR_XBAR12SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR12CFGR_XBAR12SEL_SHIFT		0
#define RCC_XBAR12CFGR_XBAR12EN			BIT(6)
#define RCC_XBAR12CFGR_XBAR12STS		BIT(7)

/* RCC_XBAR13CFGR register fields */
#define RCC_XBAR13CFGR_XBAR13SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR13CFGR_XBAR13SEL_SHIFT		0
#define RCC_XBAR13CFGR_XBAR13EN			BIT(6)
#define RCC_XBAR13CFGR_XBAR13STS		BIT(7)

/* RCC_XBAR14CFGR register fields */
#define RCC_XBAR14CFGR_XBAR14SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR14CFGR_XBAR14SEL_SHIFT		0
#define RCC_XBAR14CFGR_XBAR14EN			BIT(6)
#define RCC_XBAR14CFGR_XBAR14STS		BIT(7)

/* RCC_XBAR15CFGR register fields */
#define RCC_XBAR15CFGR_XBAR15SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR15CFGR_XBAR15SEL_SHIFT		0
#define RCC_XBAR15CFGR_XBAR15EN			BIT(6)
#define RCC_XBAR15CFGR_XBAR15STS		BIT(7)

/* RCC_XBAR16CFGR register fields */
#define RCC_XBAR16CFGR_XBAR16SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR16CFGR_XBAR16SEL_SHIFT		0
#define RCC_XBAR16CFGR_XBAR16EN			BIT(6)
#define RCC_XBAR16CFGR_XBAR16STS		BIT(7)

/* RCC_XBAR17CFGR register fields */
#define RCC_XBAR17CFGR_XBAR17SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR17CFGR_XBAR17SEL_SHIFT		0
#define RCC_XBAR17CFGR_XBAR17EN			BIT(6)
#define RCC_XBAR17CFGR_XBAR17STS		BIT(7)

/* RCC_XBAR18CFGR register fields */
#define RCC_XBAR18CFGR_XBAR18SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR18CFGR_XBAR18SEL_SHIFT		0
#define RCC_XBAR18CFGR_XBAR18EN			BIT(6)
#define RCC_XBAR18CFGR_XBAR18STS		BIT(7)

/* RCC_XBAR19CFGR register fields */
#define RCC_XBAR19CFGR_XBAR19SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR19CFGR_XBAR19SEL_SHIFT		0
#define RCC_XBAR19CFGR_XBAR19EN			BIT(6)
#define RCC_XBAR19CFGR_XBAR19STS		BIT(7)

/* RCC_XBAR20CFGR register fields */
#define RCC_XBAR20CFGR_XBAR20SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR20CFGR_XBAR20SEL_SHIFT		0
#define RCC_XBAR20CFGR_XBAR20EN			BIT(6)
#define RCC_XBAR20CFGR_XBAR20STS		BIT(7)

/* RCC_XBAR21CFGR register fields */
#define RCC_XBAR21CFGR_XBAR21SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR21CFGR_XBAR21SEL_SHIFT		0
#define RCC_XBAR21CFGR_XBAR21EN			BIT(6)
#define RCC_XBAR21CFGR_XBAR21STS		BIT(7)

/* RCC_XBAR22CFGR register fields */
#define RCC_XBAR22CFGR_XBAR22SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR22CFGR_XBAR22SEL_SHIFT		0
#define RCC_XBAR22CFGR_XBAR22EN			BIT(6)
#define RCC_XBAR22CFGR_XBAR22STS		BIT(7)

/* RCC_XBAR23CFGR register fields */
#define RCC_XBAR23CFGR_XBAR23SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR23CFGR_XBAR23SEL_SHIFT		0
#define RCC_XBAR23CFGR_XBAR23EN			BIT(6)
#define RCC_XBAR23CFGR_XBAR23STS		BIT(7)

/* RCC_XBAR24CFGR register fields */
#define RCC_XBAR24CFGR_XBAR24SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR24CFGR_XBAR24SEL_SHIFT		0
#define RCC_XBAR24CFGR_XBAR24EN			BIT(6)
#define RCC_XBAR24CFGR_XBAR24STS		BIT(7)

/* RCC_XBAR25CFGR register fields */
#define RCC_XBAR25CFGR_XBAR25SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR25CFGR_XBAR25SEL_SHIFT		0
#define RCC_XBAR25CFGR_XBAR25EN			BIT(6)
#define RCC_XBAR25CFGR_XBAR25STS		BIT(7)

/* RCC_XBAR26CFGR register fields */
#define RCC_XBAR26CFGR_XBAR26SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR26CFGR_XBAR26SEL_SHIFT		0
#define RCC_XBAR26CFGR_XBAR26EN			BIT(6)
#define RCC_XBAR26CFGR_XBAR26STS		BIT(7)

/* RCC_XBAR27CFGR register fields */
#define RCC_XBAR27CFGR_XBAR27SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR27CFGR_XBAR27SEL_SHIFT		0
#define RCC_XBAR27CFGR_XBAR27EN			BIT(6)
#define RCC_XBAR27CFGR_XBAR27STS		BIT(7)

/* RCC_XBAR28CFGR register fields */
#define RCC_XBAR28CFGR_XBAR28SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR28CFGR_XBAR28SEL_SHIFT		0
#define RCC_XBAR28CFGR_XBAR28EN			BIT(6)
#define RCC_XBAR28CFGR_XBAR28STS		BIT(7)

/* RCC_XBAR29CFGR register fields */
#define RCC_XBAR29CFGR_XBAR29SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR29CFGR_XBAR29SEL_SHIFT		0
#define RCC_XBAR29CFGR_XBAR29EN			BIT(6)
#define RCC_XBAR29CFGR_XBAR29STS		BIT(7)

/* RCC_XBAR30CFGR register fields */
#define RCC_XBAR30CFGR_XBAR30SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR30CFGR_XBAR30SEL_SHIFT		0
#define RCC_XBAR30CFGR_XBAR30EN			BIT(6)
#define RCC_XBAR30CFGR_XBAR30STS		BIT(7)

/* RCC_XBAR31CFGR register fields */
#define RCC_XBAR31CFGR_XBAR31SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR31CFGR_XBAR31SEL_SHIFT		0
#define RCC_XBAR31CFGR_XBAR31EN			BIT(6)
#define RCC_XBAR31CFGR_XBAR31STS		BIT(7)

/* RCC_XBAR32CFGR register fields */
#define RCC_XBAR32CFGR_XBAR32SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR32CFGR_XBAR32SEL_SHIFT		0
#define RCC_XBAR32CFGR_XBAR32EN			BIT(6)
#define RCC_XBAR32CFGR_XBAR32STS		BIT(7)

/* RCC_XBAR33CFGR register fields */
#define RCC_XBAR33CFGR_XBAR33SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR33CFGR_XBAR33SEL_SHIFT		0
#define RCC_XBAR33CFGR_XBAR33EN			BIT(6)
#define RCC_XBAR33CFGR_XBAR33STS		BIT(7)

/* RCC_XBAR34CFGR register fields */
#define RCC_XBAR34CFGR_XBAR34SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR34CFGR_XBAR34SEL_SHIFT		0
#define RCC_XBAR34CFGR_XBAR34EN			BIT(6)
#define RCC_XBAR34CFGR_XBAR34STS		BIT(7)

/* RCC_XBAR35CFGR register fields */
#define RCC_XBAR35CFGR_XBAR35SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR35CFGR_XBAR35SEL_SHIFT		0
#define RCC_XBAR35CFGR_XBAR35EN			BIT(6)
#define RCC_XBAR35CFGR_XBAR35STS		BIT(7)

/* RCC_XBAR36CFGR register fields */
#define RCC_XBAR36CFGR_XBAR36SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR36CFGR_XBAR36SEL_SHIFT		0
#define RCC_XBAR36CFGR_XBAR36EN			BIT(6)
#define RCC_XBAR36CFGR_XBAR36STS		BIT(7)

