DanielMartensson/STM32-Computer/STM32CubeIDE/STM32-Computer-Firmware/CA7/tf-a-2.8.15-r2/tf-a-stm32mp-v2.8.15-stm32mp-r2/include/drivers/st/stm32mp2_rcc.h
/* RCC_XBAR37CFGR register fields */
#define RCC_XBAR37CFGR_XBAR37SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR37CFGR_XBAR37SEL_SHIFT		0
#define RCC_XBAR37CFGR_XBAR37EN			BIT(6)
#define RCC_XBAR37CFGR_XBAR37STS		BIT(7)

/* RCC_XBAR38CFGR register fields */
#define RCC_XBAR38CFGR_XBAR38SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR38CFGR_XBAR38SEL_SHIFT		0
#define RCC_XBAR38CFGR_XBAR38EN			BIT(6)
#define RCC_XBAR38CFGR_XBAR38STS		BIT(7)

/* RCC_XBAR39CFGR register fields */
#define RCC_XBAR39CFGR_XBAR39SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR39CFGR_XBAR39SEL_SHIFT		0
#define RCC_XBAR39CFGR_XBAR39EN			BIT(6)
#define RCC_XBAR39CFGR_XBAR39STS		BIT(7)

/* RCC_XBAR40CFGR register fields */
#define RCC_XBAR40CFGR_XBAR40SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR40CFGR_XBAR40SEL_SHIFT		0
#define RCC_XBAR40CFGR_XBAR40EN			BIT(6)
#define RCC_XBAR40CFGR_XBAR40STS		BIT(7)

/* RCC_XBAR41CFGR register fields */
#define RCC_XBAR41CFGR_XBAR41SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR41CFGR_XBAR41SEL_SHIFT		0
#define RCC_XBAR41CFGR_XBAR41EN			BIT(6)
#define RCC_XBAR41CFGR_XBAR41STS		BIT(7)

/* RCC_XBAR42CFGR register fields */
#define RCC_XBAR42CFGR_XBAR42SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR42CFGR_XBAR42SEL_SHIFT		0
#define RCC_XBAR42CFGR_XBAR42EN			BIT(6)
#define RCC_XBAR42CFGR_XBAR42STS		BIT(7)

/* RCC_XBAR43CFGR register fields */
#define RCC_XBAR43CFGR_XBAR43SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR43CFGR_XBAR43SEL_SHIFT		0
#define RCC_XBAR43CFGR_XBAR43EN			BIT(6)
#define RCC_XBAR43CFGR_XBAR43STS		BIT(7)

/* RCC_XBAR44CFGR register fields */
#define RCC_XBAR44CFGR_XBAR44SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR44CFGR_XBAR44SEL_SHIFT		0
#define RCC_XBAR44CFGR_XBAR44EN			BIT(6)
#define RCC_XBAR44CFGR_XBAR44STS		BIT(7)

/* RCC_XBAR45CFGR register fields */
#define RCC_XBAR45CFGR_XBAR45SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR45CFGR_XBAR45SEL_SHIFT		0
#define RCC_XBAR45CFGR_XBAR45EN			BIT(6)
#define RCC_XBAR45CFGR_XBAR45STS		BIT(7)

/* RCC_XBAR46CFGR register fields */
#define RCC_XBAR46CFGR_XBAR46SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR46CFGR_XBAR46SEL_SHIFT		0
#define RCC_XBAR46CFGR_XBAR46EN			BIT(6)
#define RCC_XBAR46CFGR_XBAR46STS		BIT(7)

/* RCC_XBAR47CFGR register fields */
#define RCC_XBAR47CFGR_XBAR47SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR47CFGR_XBAR47SEL_SHIFT		0
#define RCC_XBAR47CFGR_XBAR47EN			BIT(6)
#define RCC_XBAR47CFGR_XBAR47STS		BIT(7)

/* RCC_XBAR48CFGR register fields */
#define RCC_XBAR48CFGR_XBAR48SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR48CFGR_XBAR48SEL_SHIFT		0
#define RCC_XBAR48CFGR_XBAR48EN			BIT(6)
#define RCC_XBAR48CFGR_XBAR48STS		BIT(7)

/* RCC_XBAR49CFGR register fields */
#define RCC_XBAR49CFGR_XBAR49SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR49CFGR_XBAR49SEL_SHIFT		0
#define RCC_XBAR49CFGR_XBAR49EN			BIT(6)
#define RCC_XBAR49CFGR_XBAR49STS		BIT(7)

/* RCC_XBAR50CFGR register fields */
#define RCC_XBAR50CFGR_XBAR50SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR50CFGR_XBAR50SEL_SHIFT		0
#define RCC_XBAR50CFGR_XBAR50EN			BIT(6)
#define RCC_XBAR50CFGR_XBAR50STS		BIT(7)

/* RCC_XBAR51CFGR register fields */
#define RCC_XBAR51CFGR_XBAR51SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR51CFGR_XBAR51SEL_SHIFT		0
#define RCC_XBAR51CFGR_XBAR51EN			BIT(6)
#define RCC_XBAR51CFGR_XBAR51STS		BIT(7)

/* RCC_XBAR52CFGR register fields */
#define RCC_XBAR52CFGR_XBAR52SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR52CFGR_XBAR52SEL_SHIFT		0
#define RCC_XBAR52CFGR_XBAR52EN			BIT(6)
#define RCC_XBAR52CFGR_XBAR52STS		BIT(7)

/* RCC_XBAR53CFGR register fields */
#define RCC_XBAR53CFGR_XBAR53SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR53CFGR_XBAR53SEL_SHIFT		0
#define RCC_XBAR53CFGR_XBAR53EN			BIT(6)
#define RCC_XBAR53CFGR_XBAR53STS		BIT(7)

/* RCC_XBAR54CFGR register fields */
#define RCC_XBAR54CFGR_XBAR54SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR54CFGR_XBAR54SEL_SHIFT		0
#define RCC_XBAR54CFGR_XBAR54EN			BIT(6)
#define RCC_XBAR54CFGR_XBAR54STS		BIT(7)

/* RCC_XBAR55CFGR register fields */
#define RCC_XBAR55CFGR_XBAR55SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR55CFGR_XBAR55SEL_SHIFT		0
#define RCC_XBAR55CFGR_XBAR55EN			BIT(6)
#define RCC_XBAR55CFGR_XBAR55STS		BIT(7)

/* RCC_XBAR56CFGR register fields */
#define RCC_XBAR56CFGR_XBAR56SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR56CFGR_XBAR56SEL_SHIFT		0
#define RCC_XBAR56CFGR_XBAR56EN			BIT(6)
#define RCC_XBAR56CFGR_XBAR56STS		BIT(7)

/* RCC_XBAR57CFGR register fields */
#define RCC_XBAR57CFGR_XBAR57SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR57CFGR_XBAR57SEL_SHIFT		0
#define RCC_XBAR57CFGR_XBAR57EN			BIT(6)
#define RCC_XBAR57CFGR_XBAR57STS		BIT(7)

/* RCC_XBAR58CFGR register fields */
#define RCC_XBAR58CFGR_XBAR58SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR58CFGR_XBAR58SEL_SHIFT		0
#define RCC_XBAR58CFGR_XBAR58EN			BIT(6)
#define RCC_XBAR58CFGR_XBAR58STS		BIT(7)

/* RCC_XBAR59CFGR register fields */
#define RCC_XBAR59CFGR_XBAR59SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR59CFGR_XBAR59SEL_SHIFT		0
#define RCC_XBAR59CFGR_XBAR59EN			BIT(6)
#define RCC_XBAR59CFGR_XBAR59STS		BIT(7)

/* RCC_XBAR60CFGR register fields */
#define RCC_XBAR60CFGR_XBAR60SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR60CFGR_XBAR60SEL_SHIFT		0
#define RCC_XBAR60CFGR_XBAR60EN			BIT(6)
#define RCC_XBAR60CFGR_XBAR60STS		BIT(7)

/* RCC_XBAR61CFGR register fields */
#define RCC_XBAR61CFGR_XBAR61SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR61CFGR_XBAR61SEL_SHIFT		0
#define RCC_XBAR61CFGR_XBAR61EN			BIT(6)
#define RCC_XBAR61CFGR_XBAR61STS		BIT(7)

/* RCC_XBAR62CFGR register fields */
#define RCC_XBAR62CFGR_XBAR62SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR62CFGR_XBAR62SEL_SHIFT		0
#define RCC_XBAR62CFGR_XBAR62EN			BIT(6)
#define RCC_XBAR62CFGR_XBAR62STS		BIT(7)

/* RCC_XBAR63CFGR register fields */
#define RCC_XBAR63CFGR_XBAR63SEL_MASK		GENMASK(3, 0)
#define RCC_XBAR63CFGR_XBAR63SEL_SHIFT		0
#define RCC_XBAR63CFGR_XBAR63EN			BIT(6)
#define RCC_XBAR63CFGR_XBAR63STS		BIT(7)

/* RCC_XBARxCFGR register fields */
#define RCC_XBARxCFGR_XBARxSEL_MASK		GENMASK(3, 0)
#define RCC_XBARxCFGR_XBARxSEL_SHIFT		0
#define RCC_XBARxCFGR_XBARxEN			BIT(6)
#define RCC_XBARxCFGR_XBARxSTS			BIT(7)

/* RCC_PREDIV0CFGR register fields */
#define RCC_PREDIV0CFGR_PREDIV0_MASK		GENMASK(9, 0)
#define RCC_PREDIV0CFGR_PREDIV0_SHIFT		0

