DanielMartensson/STM32-Computer/STM32CubeIDE/STM32-Computer-Firmware/CA7/tf-a-2.8.15-r2/tf-a-stm32mp-v2.8.15-stm32mp-r2/include/drivers/st/stm32mp2_rcc.h
/* RCC_PREDIV1CFGR register fields */
#define RCC_PREDIV1CFGR_PREDIV1_MASK		GENMASK(9, 0)
#define RCC_PREDIV1CFGR_PREDIV1_SHIFT		0

/* RCC_PREDIV2CFGR register fields */
#define RCC_PREDIV2CFGR_PREDIV2_MASK		GENMASK(9, 0)
#define RCC_PREDIV2CFGR_PREDIV2_SHIFT		0

/* RCC_PREDIV3CFGR register fields */
#define RCC_PREDIV3CFGR_PREDIV3_MASK		GENMASK(9, 0)
#define RCC_PREDIV3CFGR_PREDIV3_SHIFT		0

/* RCC_PREDIV4CFGR register fields */
#define RCC_PREDIV4CFGR_PREDIV4_MASK		GENMASK(9, 0)
#define RCC_PREDIV4CFGR_PREDIV4_SHIFT		0

/* RCC_PREDIV5CFGR register fields */
#define RCC_PREDIV5CFGR_PREDIV5_MASK		GENMASK(9, 0)
#define RCC_PREDIV5CFGR_PREDIV5_SHIFT		0

/* RCC_PREDIV6CFGR register fields */
#define RCC_PREDIV6CFGR_PREDIV6_MASK		GENMASK(9, 0)
#define RCC_PREDIV6CFGR_PREDIV6_SHIFT		0

/* RCC_PREDIV7CFGR register fields */
#define RCC_PREDIV7CFGR_PREDIV7_MASK		GENMASK(9, 0)
#define RCC_PREDIV7CFGR_PREDIV7_SHIFT		0

/* RCC_PREDIV8CFGR register fields */
#define RCC_PREDIV8CFGR_PREDIV8_MASK		GENMASK(9, 0)
#define RCC_PREDIV8CFGR_PREDIV8_SHIFT		0

/* RCC_PREDIV9CFGR register fields */
#define RCC_PREDIV9CFGR_PREDIV9_MASK		GENMASK(9, 0)
#define RCC_PREDIV9CFGR_PREDIV9_SHIFT		0

/* RCC_PREDIV10CFGR register fields */
#define RCC_PREDIV10CFGR_PREDIV10_MASK		GENMASK(9, 0)
#define RCC_PREDIV10CFGR_PREDIV10_SHIFT		0

/* RCC_PREDIV11CFGR register fields */
#define RCC_PREDIV11CFGR_PREDIV11_MASK		GENMASK(9, 0)
#define RCC_PREDIV11CFGR_PREDIV11_SHIFT		0

/* RCC_PREDIV12CFGR register fields */
#define RCC_PREDIV12CFGR_PREDIV12_MASK		GENMASK(9, 0)
#define RCC_PREDIV12CFGR_PREDIV12_SHIFT		0

/* RCC_PREDIV13CFGR register fields */
#define RCC_PREDIV13CFGR_PREDIV13_MASK		GENMASK(9, 0)
#define RCC_PREDIV13CFGR_PREDIV13_SHIFT		0

/* RCC_PREDIV14CFGR register fields */
#define RCC_PREDIV14CFGR_PREDIV14_MASK		GENMASK(9, 0)
#define RCC_PREDIV14CFGR_PREDIV14_SHIFT		0

/* RCC_PREDIV15CFGR register fields */
#define RCC_PREDIV15CFGR_PREDIV15_MASK		GENMASK(9, 0)
#define RCC_PREDIV15CFGR_PREDIV15_SHIFT		0

/* RCC_PREDIV16CFGR register fields */
#define RCC_PREDIV16CFGR_PREDIV16_MASK		GENMASK(9, 0)
#define RCC_PREDIV16CFGR_PREDIV16_SHIFT		0

/* RCC_PREDIV17CFGR register fields */
#define RCC_PREDIV17CFGR_PREDIV17_MASK		GENMASK(9, 0)
#define RCC_PREDIV17CFGR_PREDIV17_SHIFT		0

/* RCC_PREDIV18CFGR register fields */
#define RCC_PREDIV18CFGR_PREDIV18_MASK		GENMASK(9, 0)
#define RCC_PREDIV18CFGR_PREDIV18_SHIFT		0

/* RCC_PREDIV19CFGR register fields */
#define RCC_PREDIV19CFGR_PREDIV19_MASK		GENMASK(9, 0)
#define RCC_PREDIV19CFGR_PREDIV19_SHIFT		0

/* RCC_PREDIV20CFGR register fields */
#define RCC_PREDIV20CFGR_PREDIV20_MASK		GENMASK(9, 0)
#define RCC_PREDIV20CFGR_PREDIV20_SHIFT		0

/* RCC_PREDIV21CFGR register fields */
#define RCC_PREDIV21CFGR_PREDIV21_MASK		GENMASK(9, 0)
#define RCC_PREDIV21CFGR_PREDIV21_SHIFT		0

/* RCC_PREDIV22CFGR register fields */
#define RCC_PREDIV22CFGR_PREDIV22_MASK		GENMASK(9, 0)
#define RCC_PREDIV22CFGR_PREDIV22_SHIFT		0

/* RCC_PREDIV23CFGR register fields */
#define RCC_PREDIV23CFGR_PREDIV23_MASK		GENMASK(9, 0)
#define RCC_PREDIV23CFGR_PREDIV23_SHIFT		0

/* RCC_PREDIV24CFGR register fields */
#define RCC_PREDIV24CFGR_PREDIV24_MASK		GENMASK(9, 0)
#define RCC_PREDIV24CFGR_PREDIV24_SHIFT		0

/* RCC_PREDIV25CFGR register fields */
#define RCC_PREDIV25CFGR_PREDIV25_MASK		GENMASK(9, 0)
#define RCC_PREDIV25CFGR_PREDIV25_SHIFT		0

/* RCC_PREDIV26CFGR register fields */
#define RCC_PREDIV26CFGR_PREDIV26_MASK		GENMASK(9, 0)
#define RCC_PREDIV26CFGR_PREDIV26_SHIFT		0

/* RCC_PREDIV27CFGR register fields */
#define RCC_PREDIV27CFGR_PREDIV27_MASK		GENMASK(9, 0)
#define RCC_PREDIV27CFGR_PREDIV27_SHIFT		0

/* RCC_PREDIV28CFGR register fields */
#define RCC_PREDIV28CFGR_PREDIV28_MASK		GENMASK(9, 0)
#define RCC_PREDIV28CFGR_PREDIV28_SHIFT		0

/* RCC_PREDIV29CFGR register fields */
#define RCC_PREDIV29CFGR_PREDIV29_MASK		GENMASK(9, 0)
#define RCC_PREDIV29CFGR_PREDIV29_SHIFT		0

/* RCC_PREDIV30CFGR register fields */
#define RCC_PREDIV30CFGR_PREDIV30_MASK		GENMASK(9, 0)
#define RCC_PREDIV30CFGR_PREDIV30_SHIFT		0

/* RCC_PREDIV31CFGR register fields */
#define RCC_PREDIV31CFGR_PREDIV31_MASK		GENMASK(9, 0)
#define RCC_PREDIV31CFGR_PREDIV31_SHIFT		0

/* RCC_PREDIV32CFGR register fields */
#define RCC_PREDIV32CFGR_PREDIV32_MASK		GENMASK(9, 0)
#define RCC_PREDIV32CFGR_PREDIV32_SHIFT		0

/* RCC_PREDIV33CFGR register fields */
#define RCC_PREDIV33CFGR_PREDIV33_MASK		GENMASK(9, 0)
#define RCC_PREDIV33CFGR_PREDIV33_SHIFT		0

/* RCC_PREDIV34CFGR register fields */
#define RCC_PREDIV34CFGR_PREDIV34_MASK		GENMASK(9, 0)
#define RCC_PREDIV34CFGR_PREDIV34_SHIFT		0

/* RCC_PREDIV35CFGR register fields */
#define RCC_PREDIV35CFGR_PREDIV35_MASK		GENMASK(9, 0)
#define RCC_PREDIV35CFGR_PREDIV35_SHIFT		0

/* RCC_PREDIV36CFGR register fields */
#define RCC_PREDIV36CFGR_PREDIV36_MASK		GENMASK(9, 0)
#define RCC_PREDIV36CFGR_PREDIV36_SHIFT		0

/* RCC_PREDIV37CFGR register fields */
#define RCC_PREDIV37CFGR_PREDIV37_MASK		GENMASK(9, 0)
#define RCC_PREDIV37CFGR_PREDIV37_SHIFT		0

/* RCC_PREDIV38CFGR register fields */
#define RCC_PREDIV38CFGR_PREDIV38_MASK		GENMASK(9, 0)
#define RCC_PREDIV38CFGR_PREDIV38_SHIFT		0

/* RCC_PREDIV39CFGR register fields */
#define RCC_PREDIV39CFGR_PREDIV39_MASK		GENMASK(9, 0)
#define RCC_PREDIV39CFGR_PREDIV39_SHIFT		0

/* RCC_PREDIV40CFGR register fields */
#define RCC_PREDIV40CFGR_PREDIV40_MASK		GENMASK(9, 0)
#define RCC_PREDIV40CFGR_PREDIV40_SHIFT		0

/* RCC_PREDIV41CFGR register fields */
#define RCC_PREDIV41CFGR_PREDIV41_MASK		GENMASK(9, 0)
#define RCC_PREDIV41CFGR_PREDIV41_SHIFT		0

/* RCC_PREDIV42CFGR register fields */
#define RCC_PREDIV42CFGR_PREDIV42_MASK		GENMASK(9, 0)
#define RCC_PREDIV42CFGR_PREDIV42_SHIFT		0

/* RCC_PREDIV43CFGR register fields */
#define RCC_PREDIV43CFGR_PREDIV43_MASK		GENMASK(9, 0)
#define RCC_PREDIV43CFGR_PREDIV43_SHIFT		0

/* RCC_PREDIV44CFGR register fields */
#define RCC_PREDIV44CFGR_PREDIV44_MASK		GENMASK(9, 0)
#define RCC_PREDIV44CFGR_PREDIV44_SHIFT		0

/* RCC_PREDIV45CFGR register fields */
#define RCC_PREDIV45CFGR_PREDIV45_MASK		GENMASK(9, 0)
#define RCC_PREDIV45CFGR_PREDIV45_SHIFT		0

/* RCC_PREDIV46CFGR register fields */
#define RCC_PREDIV46CFGR_PREDIV46_MASK		GENMASK(9, 0)
#define RCC_PREDIV46CFGR_PREDIV46_SHIFT		0

/* RCC_PREDIV47CFGR register fields */
#define RCC_PREDIV47CFGR_PREDIV47_MASK		GENMASK(9, 0)
#define RCC_PREDIV47CFGR_PREDIV47_SHIFT		0

/* RCC_PREDIV48CFGR register fields */
#define RCC_PREDIV48CFGR_PREDIV48_MASK		GENMASK(9, 0)
#define RCC_PREDIV48CFGR_PREDIV48_SHIFT		0

