DanielMartensson/STM32-Computer/STM32CubeIDE/STM32-Computer-Firmware/CA7/tf-a-2.8.15-r2/tf-a-stm32mp-v2.8.15-stm32mp-r2/include/drivers/st/stm32mp2_rcc.h
/* RCC_PREDIV49CFGR register fields */
#define RCC_PREDIV49CFGR_PREDIV49_MASK		GENMASK(9, 0)
#define RCC_PREDIV49CFGR_PREDIV49_SHIFT		0

/* RCC_PREDIV50CFGR register fields */
#define RCC_PREDIV50CFGR_PREDIV50_MASK		GENMASK(9, 0)
#define RCC_PREDIV50CFGR_PREDIV50_SHIFT		0

/* RCC_PREDIV51CFGR register fields */
#define RCC_PREDIV51CFGR_PREDIV51_MASK		GENMASK(9, 0)
#define RCC_PREDIV51CFGR_PREDIV51_SHIFT		0

/* RCC_PREDIV52CFGR register fields */
#define RCC_PREDIV52CFGR_PREDIV52_MASK		GENMASK(9, 0)
#define RCC_PREDIV52CFGR_PREDIV52_SHIFT		0

/* RCC_PREDIV53CFGR register fields */
#define RCC_PREDIV53CFGR_PREDIV53_MASK		GENMASK(9, 0)
#define RCC_PREDIV53CFGR_PREDIV53_SHIFT		0

/* RCC_PREDIV54CFGR register fields */
#define RCC_PREDIV54CFGR_PREDIV54_MASK		GENMASK(9, 0)
#define RCC_PREDIV54CFGR_PREDIV54_SHIFT		0

/* RCC_PREDIV55CFGR register fields */
#define RCC_PREDIV55CFGR_PREDIV55_MASK		GENMASK(9, 0)
#define RCC_PREDIV55CFGR_PREDIV55_SHIFT		0

/* RCC_PREDIV56CFGR register fields */
#define RCC_PREDIV56CFGR_PREDIV56_MASK		GENMASK(9, 0)
#define RCC_PREDIV56CFGR_PREDIV56_SHIFT		0

/* RCC_PREDIV57CFGR register fields */
#define RCC_PREDIV57CFGR_PREDIV57_MASK		GENMASK(9, 0)
#define RCC_PREDIV57CFGR_PREDIV57_SHIFT		0

/* RCC_PREDIV58CFGR register fields */
#define RCC_PREDIV58CFGR_PREDIV58_MASK		GENMASK(9, 0)
#define RCC_PREDIV58CFGR_PREDIV58_SHIFT		0

/* RCC_PREDIV59CFGR register fields */
#define RCC_PREDIV59CFGR_PREDIV59_MASK		GENMASK(9, 0)
#define RCC_PREDIV59CFGR_PREDIV59_SHIFT		0

/* RCC_PREDIV60CFGR register fields */
#define RCC_PREDIV60CFGR_PREDIV60_MASK		GENMASK(9, 0)
#define RCC_PREDIV60CFGR_PREDIV60_SHIFT		0

/* RCC_PREDIV61CFGR register fields */
#define RCC_PREDIV61CFGR_PREDIV61_MASK		GENMASK(9, 0)
#define RCC_PREDIV61CFGR_PREDIV61_SHIFT		0

/* RCC_PREDIV62CFGR register fields */
#define RCC_PREDIV62CFGR_PREDIV62_MASK		GENMASK(9, 0)
#define RCC_PREDIV62CFGR_PREDIV62_SHIFT		0

/* RCC_PREDIV63CFGR register fields */
#define RCC_PREDIV63CFGR_PREDIV63_MASK		GENMASK(9, 0)
#define RCC_PREDIV63CFGR_PREDIV63_SHIFT		0

/* RCC_PREDIVxCFGR register fields */
#define RCC_PREDIVxCFGR_PREDIVx_MASK		GENMASK(9, 0)
#define RCC_PREDIVxCFGR_PREDIVx_SHIFT		0

/* RCC_FINDIV0CFGR register fields */
#define RCC_FINDIV0CFGR_FINDIV0_MASK		GENMASK(5, 0)
#define RCC_FINDIV0CFGR_FINDIV0_SHIFT		0
#define RCC_FINDIV0CFGR_FINDIV0EN		BIT(6)

/* RCC_FINDIV1CFGR register fields */
#define RCC_FINDIV1CFGR_FINDIV1_MASK		GENMASK(5, 0)
#define RCC_FINDIV1CFGR_FINDIV1_SHIFT		0
#define RCC_FINDIV1CFGR_FINDIV1EN		BIT(6)

/* RCC_FINDIV2CFGR register fields */
#define RCC_FINDIV2CFGR_FINDIV2_MASK		GENMASK(5, 0)
#define RCC_FINDIV2CFGR_FINDIV2_SHIFT		0
#define RCC_FINDIV2CFGR_FINDIV2EN		BIT(6)

/* RCC_FINDIV3CFGR register fields */
#define RCC_FINDIV3CFGR_FINDIV3_MASK		GENMASK(5, 0)
#define RCC_FINDIV3CFGR_FINDIV3_SHIFT		0
#define RCC_FINDIV3CFGR_FINDIV3EN		BIT(6)

/* RCC_FINDIV4CFGR register fields */
#define RCC_FINDIV4CFGR_FINDIV4_MASK		GENMASK(5, 0)
#define RCC_FINDIV4CFGR_FINDIV4_SHIFT		0
#define RCC_FINDIV4CFGR_FINDIV4EN		BIT(6)

/* RCC_FINDIV5CFGR register fields */
#define RCC_FINDIV5CFGR_FINDIV5_MASK		GENMASK(5, 0)
#define RCC_FINDIV5CFGR_FINDIV5_SHIFT		0
#define RCC_FINDIV5CFGR_FINDIV5EN		BIT(6)

/* RCC_FINDIV6CFGR register fields */
#define RCC_FINDIV6CFGR_FINDIV6_MASK		GENMASK(5, 0)
#define RCC_FINDIV6CFGR_FINDIV6_SHIFT		0
#define RCC_FINDIV6CFGR_FINDIV6EN		BIT(6)

/* RCC_FINDIV7CFGR register fields */
#define RCC_FINDIV7CFGR_FINDIV7_MASK		GENMASK(5, 0)
#define RCC_FINDIV7CFGR_FINDIV7_SHIFT		0
#define RCC_FINDIV7CFGR_FINDIV7EN		BIT(6)

/* RCC_FINDIV8CFGR register fields */
#define RCC_FINDIV8CFGR_FINDIV8_MASK		GENMASK(5, 0)
#define RCC_FINDIV8CFGR_FINDIV8_SHIFT		0
#define RCC_FINDIV8CFGR_FINDIV8EN		BIT(6)

/* RCC_FINDIV9CFGR register fields */
#define RCC_FINDIV9CFGR_FINDIV9_MASK		GENMASK(5, 0)
#define RCC_FINDIV9CFGR_FINDIV9_SHIFT		0
#define RCC_FINDIV9CFGR_FINDIV9EN		BIT(6)

/* RCC_FINDIV10CFGR register fields */
#define RCC_FINDIV10CFGR_FINDIV10_MASK		GENMASK(5, 0)
#define RCC_FINDIV10CFGR_FINDIV10_SHIFT		0
#define RCC_FINDIV10CFGR_FINDIV10EN		BIT(6)

/* RCC_FINDIV11CFGR register fields */
#define RCC_FINDIV11CFGR_FINDIV11_MASK		GENMASK(5, 0)
#define RCC_FINDIV11CFGR_FINDIV11_SHIFT		0
#define RCC_FINDIV11CFGR_FINDIV11EN		BIT(6)

/* RCC_FINDIV12CFGR register fields */
#define RCC_FINDIV12CFGR_FINDIV12_MASK		GENMASK(5, 0)
#define RCC_FINDIV12CFGR_FINDIV12_SHIFT		0
#define RCC_FINDIV12CFGR_FINDIV12EN		BIT(6)

/* RCC_FINDIV13CFGR register fields */
#define RCC_FINDIV13CFGR_FINDIV13_MASK		GENMASK(5, 0)
#define RCC_FINDIV13CFGR_FINDIV13_SHIFT		0
#define RCC_FINDIV13CFGR_FINDIV13EN		BIT(6)

/* RCC_FINDIV14CFGR register fields */
#define RCC_FINDIV14CFGR_FINDIV14_MASK		GENMASK(5, 0)
#define RCC_FINDIV14CFGR_FINDIV14_SHIFT		0
#define RCC_FINDIV14CFGR_FINDIV14EN		BIT(6)

/* RCC_FINDIV15CFGR register fields */
#define RCC_FINDIV15CFGR_FINDIV15_MASK		GENMASK(5, 0)
#define RCC_FINDIV15CFGR_FINDIV15_SHIFT		0
#define RCC_FINDIV15CFGR_FINDIV15EN		BIT(6)

/* RCC_FINDIV16CFGR register fields */
#define RCC_FINDIV16CFGR_FINDIV16_MASK		GENMASK(5, 0)
#define RCC_FINDIV16CFGR_FINDIV16_SHIFT		0
#define RCC_FINDIV16CFGR_FINDIV16EN		BIT(6)

/* RCC_FINDIV17CFGR register fields */
#define RCC_FINDIV17CFGR_FINDIV17_MASK		GENMASK(5, 0)
#define RCC_FINDIV17CFGR_FINDIV17_SHIFT		0
#define RCC_FINDIV17CFGR_FINDIV17EN		BIT(6)

/* RCC_FINDIV18CFGR register fields */
#define RCC_FINDIV18CFGR_FINDIV18_MASK		GENMASK(5, 0)
#define RCC_FINDIV18CFGR_FINDIV18_SHIFT		0
#define RCC_FINDIV18CFGR_FINDIV18EN		BIT(6)

/* RCC_FINDIV19CFGR register fields */
#define RCC_FINDIV19CFGR_FINDIV19_MASK		GENMASK(5, 0)
#define RCC_FINDIV19CFGR_FINDIV19_SHIFT		0
#define RCC_FINDIV19CFGR_FINDIV19EN		BIT(6)

/* RCC_FINDIV20CFGR register fields */
#define RCC_FINDIV20CFGR_FINDIV20_MASK		GENMASK(5, 0)
#define RCC_FINDIV20CFGR_FINDIV20_SHIFT		0
#define RCC_FINDIV20CFGR_FINDIV20EN		BIT(6)

/* RCC_FINDIV21CFGR register fields */
#define RCC_FINDIV21CFGR_FINDIV21_MASK		GENMASK(5, 0)
#define RCC_FINDIV21CFGR_FINDIV21_SHIFT		0
#define RCC_FINDIV21CFGR_FINDIV21EN		BIT(6)

/* RCC_FINDIV22CFGR register fields */
#define RCC_FINDIV22CFGR_FINDIV22_MASK		GENMASK(5, 0)
#define RCC_FINDIV22CFGR_FINDIV22_SHIFT		0
#define RCC_FINDIV22CFGR_FINDIV22EN		BIT(6)

