DanielMartensson/STM32-Computer/STM32CubeIDE/STM32-Computer-Firmware/CA7/tf-a-2.8.15-r2/tf-a-stm32mp-v2.8.15-stm32mp-r2/include/drivers/st/stm32mp2_rcc.h
/* RCC_FINDIV23CFGR register fields */
#define RCC_FINDIV23CFGR_FINDIV23_MASK		GENMASK(5, 0)
#define RCC_FINDIV23CFGR_FINDIV23_SHIFT		0
#define RCC_FINDIV23CFGR_FINDIV23EN		BIT(6)

/* RCC_FINDIV24CFGR register fields */
#define RCC_FINDIV24CFGR_FINDIV24_MASK		GENMASK(5, 0)
#define RCC_FINDIV24CFGR_FINDIV24_SHIFT		0
#define RCC_FINDIV24CFGR_FINDIV24EN		BIT(6)

/* RCC_FINDIV25CFGR register fields */
#define RCC_FINDIV25CFGR_FINDIV25_MASK		GENMASK(5, 0)
#define RCC_FINDIV25CFGR_FINDIV25_SHIFT		0
#define RCC_FINDIV25CFGR_FINDIV25EN		BIT(6)

/* RCC_FINDIV26CFGR register fields */
#define RCC_FINDIV26CFGR_FINDIV26_MASK		GENMASK(5, 0)
#define RCC_FINDIV26CFGR_FINDIV26_SHIFT		0
#define RCC_FINDIV26CFGR_FINDIV26EN		BIT(6)

/* RCC_FINDIV27CFGR register fields */
#define RCC_FINDIV27CFGR_FINDIV27_MASK		GENMASK(5, 0)
#define RCC_FINDIV27CFGR_FINDIV27_SHIFT		0
#define RCC_FINDIV27CFGR_FINDIV27EN		BIT(6)

/* RCC_FINDIV28CFGR register fields */
#define RCC_FINDIV28CFGR_FINDIV28_MASK		GENMASK(5, 0)
#define RCC_FINDIV28CFGR_FINDIV28_SHIFT		0
#define RCC_FINDIV28CFGR_FINDIV28EN		BIT(6)

/* RCC_FINDIV29CFGR register fields */
#define RCC_FINDIV29CFGR_FINDIV29_MASK		GENMASK(5, 0)
#define RCC_FINDIV29CFGR_FINDIV29_SHIFT		0
#define RCC_FINDIV29CFGR_FINDIV29EN		BIT(6)

/* RCC_FINDIV30CFGR register fields */
#define RCC_FINDIV30CFGR_FINDIV30_MASK		GENMASK(5, 0)
#define RCC_FINDIV30CFGR_FINDIV30_SHIFT		0
#define RCC_FINDIV30CFGR_FINDIV30EN		BIT(6)

/* RCC_FINDIV31CFGR register fields */
#define RCC_FINDIV31CFGR_FINDIV31_MASK		GENMASK(5, 0)
#define RCC_FINDIV31CFGR_FINDIV31_SHIFT		0
#define RCC_FINDIV31CFGR_FINDIV31EN		BIT(6)

/* RCC_FINDIV32CFGR register fields */
#define RCC_FINDIV32CFGR_FINDIV32_MASK		GENMASK(5, 0)
#define RCC_FINDIV32CFGR_FINDIV32_SHIFT		0
#define RCC_FINDIV32CFGR_FINDIV32EN		BIT(6)

/* RCC_FINDIV33CFGR register fields */
#define RCC_FINDIV33CFGR_FINDIV33_MASK		GENMASK(5, 0)
#define RCC_FINDIV33CFGR_FINDIV33_SHIFT		0
#define RCC_FINDIV33CFGR_FINDIV33EN		BIT(6)

/* RCC_FINDIV34CFGR register fields */
#define RCC_FINDIV34CFGR_FINDIV34_MASK		GENMASK(5, 0)
#define RCC_FINDIV34CFGR_FINDIV34_SHIFT		0
#define RCC_FINDIV34CFGR_FINDIV34EN		BIT(6)

/* RCC_FINDIV35CFGR register fields */
#define RCC_FINDIV35CFGR_FINDIV35_MASK		GENMASK(5, 0)
#define RCC_FINDIV35CFGR_FINDIV35_SHIFT		0
#define RCC_FINDIV35CFGR_FINDIV35EN		BIT(6)

/* RCC_FINDIV36CFGR register fields */
#define RCC_FINDIV36CFGR_FINDIV36_MASK		GENMASK(5, 0)
#define RCC_FINDIV36CFGR_FINDIV36_SHIFT		0
#define RCC_FINDIV36CFGR_FINDIV36EN		BIT(6)

/* RCC_FINDIV37CFGR register fields */
#define RCC_FINDIV37CFGR_FINDIV37_MASK		GENMASK(5, 0)
#define RCC_FINDIV37CFGR_FINDIV37_SHIFT		0
#define RCC_FINDIV37CFGR_FINDIV37EN		BIT(6)

/* RCC_FINDIV38CFGR register fields */
#define RCC_FINDIV38CFGR_FINDIV38_MASK		GENMASK(5, 0)
#define RCC_FINDIV38CFGR_FINDIV38_SHIFT		0
#define RCC_FINDIV38CFGR_FINDIV38EN		BIT(6)

/* RCC_FINDIV39CFGR register fields */
#define RCC_FINDIV39CFGR_FINDIV39_MASK		GENMASK(5, 0)
#define RCC_FINDIV39CFGR_FINDIV39_SHIFT		0
#define RCC_FINDIV39CFGR_FINDIV39EN		BIT(6)

/* RCC_FINDIV40CFGR register fields */
#define RCC_FINDIV40CFGR_FINDIV40_MASK		GENMASK(5, 0)
#define RCC_FINDIV40CFGR_FINDIV40_SHIFT		0
#define RCC_FINDIV40CFGR_FINDIV40EN		BIT(6)

/* RCC_FINDIV41CFGR register fields */
#define RCC_FINDIV41CFGR_FINDIV41_MASK		GENMASK(5, 0)
#define RCC_FINDIV41CFGR_FINDIV41_SHIFT		0
#define RCC_FINDIV41CFGR_FINDIV41EN		BIT(6)

/* RCC_FINDIV42CFGR register fields */
#define RCC_FINDIV42CFGR_FINDIV42_MASK		GENMASK(5, 0)
#define RCC_FINDIV42CFGR_FINDIV42_SHIFT		0
#define RCC_FINDIV42CFGR_FINDIV42EN		BIT(6)

/* RCC_FINDIV43CFGR register fields */
#define RCC_FINDIV43CFGR_FINDIV43_MASK		GENMASK(5, 0)
#define RCC_FINDIV43CFGR_FINDIV43_SHIFT		0
#define RCC_FINDIV43CFGR_FINDIV43EN		BIT(6)

/* RCC_FINDIV44CFGR register fields */
#define RCC_FINDIV44CFGR_FINDIV44_MASK		GENMASK(5, 0)
#define RCC_FINDIV44CFGR_FINDIV44_SHIFT		0
#define RCC_FINDIV44CFGR_FINDIV44EN		BIT(6)

/* RCC_FINDIV45CFGR register fields */
#define RCC_FINDIV45CFGR_FINDIV45_MASK		GENMASK(5, 0)
#define RCC_FINDIV45CFGR_FINDIV45_SHIFT		0
#define RCC_FINDIV45CFGR_FINDIV45EN		BIT(6)

/* RCC_FINDIV46CFGR register fields */
#define RCC_FINDIV46CFGR_FINDIV46_MASK		GENMASK(5, 0)
#define RCC_FINDIV46CFGR_FINDIV46_SHIFT		0
#define RCC_FINDIV46CFGR_FINDIV46EN		BIT(6)

/* RCC_FINDIV47CFGR register fields */
#define RCC_FINDIV47CFGR_FINDIV47_MASK		GENMASK(5, 0)
#define RCC_FINDIV47CFGR_FINDIV47_SHIFT		0
#define RCC_FINDIV47CFGR_FINDIV47EN		BIT(6)

/* RCC_FINDIV48CFGR register fields */
#define RCC_FINDIV48CFGR_FINDIV48_MASK		GENMASK(5, 0)
#define RCC_FINDIV48CFGR_FINDIV48_SHIFT		0
#define RCC_FINDIV48CFGR_FINDIV48EN		BIT(6)

/* RCC_FINDIV49CFGR register fields */
#define RCC_FINDIV49CFGR_FINDIV49_MASK		GENMASK(5, 0)
#define RCC_FINDIV49CFGR_FINDIV49_SHIFT		0
#define RCC_FINDIV49CFGR_FINDIV49EN		BIT(6)

/* RCC_FINDIV50CFGR register fields */
#define RCC_FINDIV50CFGR_FINDIV50_MASK		GENMASK(5, 0)
#define RCC_FINDIV50CFGR_FINDIV50_SHIFT		0
#define RCC_FINDIV50CFGR_FINDIV50EN		BIT(6)

/* RCC_FINDIV51CFGR register fields */
#define RCC_FINDIV51CFGR_FINDIV51_MASK		GENMASK(5, 0)
#define RCC_FINDIV51CFGR_FINDIV51_SHIFT		0
#define RCC_FINDIV51CFGR_FINDIV51EN		BIT(6)

/* RCC_FINDIV52CFGR register fields */
#define RCC_FINDIV52CFGR_FINDIV52_MASK		GENMASK(5, 0)
#define RCC_FINDIV52CFGR_FINDIV52_SHIFT		0
#define RCC_FINDIV52CFGR_FINDIV52EN		BIT(6)

/* RCC_FINDIV53CFGR register fields */
#define RCC_FINDIV53CFGR_FINDIV53_MASK		GENMASK(5, 0)
#define RCC_FINDIV53CFGR_FINDIV53_SHIFT		0
#define RCC_FINDIV53CFGR_FINDIV53EN		BIT(6)

/* RCC_FINDIV54CFGR register fields */
#define RCC_FINDIV54CFGR_FINDIV54_MASK		GENMASK(5, 0)
#define RCC_FINDIV54CFGR_FINDIV54_SHIFT		0
#define RCC_FINDIV54CFGR_FINDIV54EN		BIT(6)

/* RCC_FINDIV55CFGR register fields */
#define RCC_FINDIV55CFGR_FINDIV55_MASK		GENMASK(5, 0)
#define RCC_FINDIV55CFGR_FINDIV55_SHIFT		0
#define RCC_FINDIV55CFGR_FINDIV55EN		BIT(6)

/* RCC_FINDIV56CFGR register fields */
#define RCC_FINDIV56CFGR_FINDIV56_MASK		GENMASK(5, 0)
#define RCC_FINDIV56CFGR_FINDIV56_SHIFT		0
#define RCC_FINDIV56CFGR_FINDIV56EN		BIT(6)

/* RCC_FINDIV57CFGR register fields */
#define RCC_FINDIV57CFGR_FINDIV57_MASK		GENMASK(5, 0)
#define RCC_FINDIV57CFGR_FINDIV57_SHIFT		0
#define RCC_FINDIV57CFGR_FINDIV57EN		BIT(6)

/* RCC_FINDIV58CFGR register fields */
#define RCC_FINDIV58CFGR_FINDIV58_MASK		GENMASK(5, 0)
#define RCC_FINDIV58CFGR_FINDIV58_SHIFT		0
#define RCC_FINDIV58CFGR_FINDIV58EN		BIT(6)

/* RCC_FINDIV59CFGR register fields */
#define RCC_FINDIV59CFGR_FINDIV59_MASK		GENMASK(5, 0)
#define RCC_FINDIV59CFGR_FINDIV59_SHIFT		0
#define RCC_FINDIV59CFGR_FINDIV59EN		BIT(6)

/* RCC_FINDIV60CFGR register fields */
#define RCC_FINDIV60CFGR_FINDIV60_MASK		GENMASK(5, 0)
#define RCC_FINDIV60CFGR_FINDIV60_SHIFT		0
#define RCC_FINDIV60CFGR_FINDIV60EN		BIT(6)

