DanielMartensson/STM32-Computer/STM32CubeIDE/STM32-Computer-Firmware/CA7/tf-a-2.8.15-r2/tf-a-stm32mp-v2.8.15-stm32mp-r2/include/drivers/st/stm32mp2_rcc.h
/* RCC_FINDIV61CFGR register fields */
#define RCC_FINDIV61CFGR_FINDIV61_MASK		GENMASK(5, 0)
#define RCC_FINDIV61CFGR_FINDIV61_SHIFT		0
#define RCC_FINDIV61CFGR_FINDIV61EN		BIT(6)

/* RCC_FINDIV62CFGR register fields */
#define RCC_FINDIV62CFGR_FINDIV62_MASK		GENMASK(5, 0)
#define RCC_FINDIV62CFGR_FINDIV62_SHIFT		0
#define RCC_FINDIV62CFGR_FINDIV62EN		BIT(6)

/* RCC_FINDIV63CFGR register fields */
#define RCC_FINDIV63CFGR_FINDIV63_MASK		GENMASK(5, 0)
#define RCC_FINDIV63CFGR_FINDIV63_SHIFT		0
#define RCC_FINDIV63CFGR_FINDIV63EN		BIT(6)

/* RCC_FINDIVxCFGR register fields */
#define RCC_FINDIVxCFGR_FINDIVx_MASK		GENMASK(5, 0)
#define RCC_FINDIVxCFGR_FINDIVx_SHIFT		0
#define RCC_FINDIVxCFGR_FINDIVxEN		BIT(6)

/* RCC_FCALCOBS0CFGR register fields */
#define RCC_FCALCOBS0CFGR_CKINTSEL_MASK		GENMASK(7, 0)
#define RCC_FCALCOBS0CFGR_CKINTSEL_SHIFT	0
#define RCC_FCALCOBS0CFGR_CKEXTSEL_MASK		GENMASK(10, 8)
#define RCC_FCALCOBS0CFGR_CKEXTSEL_SHIFT	8
#define RCC_FCALCOBS0CFGR_FCALCCKEXTSEL		BIT(15)
#define RCC_FCALCOBS0CFGR_CKOBSEXTSEL		BIT(16)
#define RCC_FCALCOBS0CFGR_FCALCCKINV		BIT(17)
#define RCC_FCALCOBS0CFGR_CKOBSINV		BIT(18)
#define RCC_FCALCOBS0CFGR_CKOBSDIV_MASK		GENMASK(24, 22)
#define RCC_FCALCOBS0CFGR_CKOBSDIV_SHIFT	22
#define RCC_FCALCOBS0CFGR_FCALCCKEN		BIT(25)
#define RCC_FCALCOBS0CFGR_CKOBSEN		BIT(26)

/* RCC_FCALCOBS1CFGR register fields */
#define RCC_FCALCOBS1CFGR_CKINTSEL_MASK		GENMASK(7, 0)
#define RCC_FCALCOBS1CFGR_CKINTSEL_SHIFT	0
#define RCC_FCALCOBS1CFGR_CKEXTSEL_MASK		GENMASK(10, 8)
#define RCC_FCALCOBS1CFGR_CKEXTSEL_SHIFT	8
#define RCC_FCALCOBS1CFGR_CKOBSEXTSEL		BIT(16)
#define RCC_FCALCOBS1CFGR_CKOBSINV		BIT(18)
#define RCC_FCALCOBS1CFGR_CKOBSDIV_MASK		GENMASK(24, 22)
#define RCC_FCALCOBS1CFGR_CKOBSDIV_SHIFT	22
#define RCC_FCALCOBS1CFGR_CKOBSEN		BIT(26)
#define RCC_FCALCOBS1CFGR_FCALCRSTN		BIT(27)

/* RCC_FCALCREFCFGR register fields */
#define RCC_FCALCREFCFGR_FCALCREFCKSEL_MASK	GENMASK(2, 0)
#define RCC_FCALCREFCFGR_FCALCREFCKSEL_SHIFT	0

/* RCC_FCALCCR1 register fields */
#define RCC_FCALCCR1_FCALCRUN			BIT(0)

/* RCC_FCALCCR2 register fields */
#define RCC_FCALCCR2_FCALCMD_MASK		GENMASK(4, 3)
#define RCC_FCALCCR2_FCALCMD_SHIFT		3
#define RCC_FCALCCR2_FCALCTWC_MASK		GENMASK(14, 11)
#define RCC_FCALCCR2_FCALCTWC_SHIFT		11
#define RCC_FCALCCR2_FCALCTYP_MASK		GENMASK(21, 17)
#define RCC_FCALCCR2_FCALCTYP_SHIFT		17

/* RCC_FCALCSR register fields */
#define RCC_FCALCSR_FVAL_MASK			GENMASK(16, 0)
#define RCC_FCALCSR_FVAL_SHIFT			0
#define RCC_FCALCSR_FCALCSTS			BIT(19)

/* RCC_PLL4CFGR1 register fields */
#define RCC_PLL4CFGR1_SSMODRST			BIT(0)
#define RCC_PLL4CFGR1_PLLEN			BIT(8)
#define RCC_PLL4CFGR1_PLLRDY			BIT(24)
#define RCC_PLL4CFGR1_CKREFST			BIT(28)

/* RCC_PLL4CFGR2 register fields */
#define RCC_PLL4CFGR2_FREFDIV_MASK		GENMASK(5, 0)
#define RCC_PLL4CFGR2_FREFDIV_SHIFT		0
#define RCC_PLL4CFGR2_FBDIV_MASK		GENMASK(27, 16)
#define RCC_PLL4CFGR2_FBDIV_SHIFT		16

/* RCC_PLL4CFGR3 register fields */
#define RCC_PLL4CFGR3_FRACIN_MASK		GENMASK(23, 0)
#define RCC_PLL4CFGR3_FRACIN_SHIFT		0
#define RCC_PLL4CFGR3_DOWNSPREAD		BIT(24)
#define RCC_PLL4CFGR3_DACEN			BIT(25)
#define RCC_PLL4CFGR3_SSCGDIS			BIT(26)

/* RCC_PLL4CFGR4 register fields */
#define RCC_PLL4CFGR4_DSMEN			BIT(8)
#define RCC_PLL4CFGR4_FOUTPOSTDIVEN		BIT(9)
#define RCC_PLL4CFGR4_BYPASS			BIT(10)

/* RCC_PLL4CFGR5 register fields */
#define RCC_PLL4CFGR5_DIVVAL_MASK		GENMASK(3, 0)
#define RCC_PLL4CFGR5_DIVVAL_SHIFT		0
#define RCC_PLL4CFGR5_SPREAD_MASK		GENMASK(20, 16)
#define RCC_PLL4CFGR5_SPREAD_SHIFT		16

/* RCC_PLL4CFGR6 register fields */
#define RCC_PLL4CFGR6_POSTDIV1_MASK		GENMASK(2, 0)
#define RCC_PLL4CFGR6_POSTDIV1_SHIFT		0

/* RCC_PLL4CFGR7 register fields */
#define RCC_PLL4CFGR7_POSTDIV2_MASK		GENMASK(2, 0)
#define RCC_PLL4CFGR7_POSTDIV2_SHIFT		0

/* RCC_PLL5CFGR1 register fields */
#define RCC_PLL5CFGR1_SSMODRST			BIT(0)
#define RCC_PLL5CFGR1_PLLEN			BIT(8)
#define RCC_PLL5CFGR1_PLLRDY			BIT(24)
#define RCC_PLL5CFGR1_CKREFST			BIT(28)

/* RCC_PLL5CFGR2 register fields */
#define RCC_PLL5CFGR2_FREFDIV_MASK		GENMASK(5, 0)
#define RCC_PLL5CFGR2_FREFDIV_SHIFT		0
#define RCC_PLL5CFGR2_FBDIV_MASK		GENMASK(27, 16)
#define RCC_PLL5CFGR2_FBDIV_SHIFT		16

/* RCC_PLL5CFGR3 register fields */
#define RCC_PLL5CFGR3_FRACIN_MASK		GENMASK(23, 0)
#define RCC_PLL5CFGR3_FRACIN_SHIFT		0
#define RCC_PLL5CFGR3_DOWNSPREAD		BIT(24)
#define RCC_PLL5CFGR3_DACEN			BIT(25)
#define RCC_PLL5CFGR3_SSCGDIS			BIT(26)

/* RCC_PLL5CFGR4 register fields */
#define RCC_PLL5CFGR4_DSMEN			BIT(8)
#define RCC_PLL5CFGR4_FOUTPOSTDIVEN		BIT(9)
#define RCC_PLL5CFGR4_BYPASS			BIT(10)

/* RCC_PLL5CFGR5 register fields */
#define RCC_PLL5CFGR5_DIVVAL_MASK		GENMASK(3, 0)
#define RCC_PLL5CFGR5_DIVVAL_SHIFT		0
#define RCC_PLL5CFGR5_SPREAD_MASK		GENMASK(20, 16)
#define RCC_PLL5CFGR5_SPREAD_SHIFT		16

/* RCC_PLL5CFGR6 register fields */
#define RCC_PLL5CFGR6_POSTDIV1_MASK		GENMASK(2, 0)
#define RCC_PLL5CFGR6_POSTDIV1_SHIFT		0

/* RCC_PLL5CFGR7 register fields */
#define RCC_PLL5CFGR7_POSTDIV2_MASK		GENMASK(2, 0)
#define RCC_PLL5CFGR7_POSTDIV2_SHIFT		0

/* RCC_PLL6CFGR1 register fields */
#define RCC_PLL6CFGR1_SSMODRST			BIT(0)
#define RCC_PLL6CFGR1_PLLEN			BIT(8)
#define RCC_PLL6CFGR1_PLLRDY			BIT(24)
#define RCC_PLL6CFGR1_CKREFST			BIT(28)

/* RCC_PLL6CFGR2 register fields */
#define RCC_PLL6CFGR2_FREFDIV_MASK		GENMASK(5, 0)
#define RCC_PLL6CFGR2_FREFDIV_SHIFT		0
#define RCC_PLL6CFGR2_FBDIV_MASK		GENMASK(27, 16)
#define RCC_PLL6CFGR2_FBDIV_SHIFT		16

/* RCC_PLL6CFGR3 register fields */
#define RCC_PLL6CFGR3_FRACIN_MASK		GENMASK(23, 0)
#define RCC_PLL6CFGR3_FRACIN_SHIFT		0
#define RCC_PLL6CFGR3_DOWNSPREAD		BIT(24)
#define RCC_PLL6CFGR3_DACEN			BIT(25)
#define RCC_PLL6CFGR3_SSCGDIS			BIT(26)

/* RCC_PLL6CFGR4 register fields */
#define RCC_PLL6CFGR4_DSMEN			BIT(8)
#define RCC_PLL6CFGR4_FOUTPOSTDIVEN		BIT(9)
#define RCC_PLL6CFGR4_BYPASS			BIT(10)

/* RCC_PLL6CFGR5 register fields */
#define RCC_PLL6CFGR5_DIVVAL_MASK		GENMASK(3, 0)
#define RCC_PLL6CFGR5_DIVVAL_SHIFT		0
#define RCC_PLL6CFGR5_SPREAD_MASK		GENMASK(20, 16)
#define RCC_PLL6CFGR5_SPREAD_SHIFT		16

/* RCC_PLL6CFGR6 register fields */
#define RCC_PLL6CFGR6_POSTDIV1_MASK		GENMASK(2, 0)
#define RCC_PLL6CFGR6_POSTDIV1_SHIFT		0

