DanielMartensson/STM32-Computer/STM32CubeIDE/STM32-Computer-Firmware/CA7/tf-a-2.8.15-r2/tf-a-stm32mp-v2.8.15-stm32mp-r2/include/drivers/st/stm32mp2_rcc.h
/* RCC_PLL6CFGR7 register fields */
#define RCC_PLL6CFGR7_POSTDIV2_MASK		GENMASK(2, 0)
#define RCC_PLL6CFGR7_POSTDIV2_SHIFT		0

/* RCC_PLL7CFGR1 register fields */
#define RCC_PLL7CFGR1_SSMODRST			BIT(0)
#define RCC_PLL7CFGR1_PLLEN			BIT(8)
#define RCC_PLL7CFGR1_PLLRDY			BIT(24)
#define RCC_PLL7CFGR1_CKREFST			BIT(28)

/* RCC_PLL7CFGR2 register fields */
#define RCC_PLL7CFGR2_FREFDIV_MASK		GENMASK(5, 0)
#define RCC_PLL7CFGR2_FREFDIV_SHIFT		0
#define RCC_PLL7CFGR2_FBDIV_MASK		GENMASK(27, 16)
#define RCC_PLL7CFGR2_FBDIV_SHIFT		16

/* RCC_PLL7CFGR3 register fields */
#define RCC_PLL7CFGR3_FRACIN_MASK		GENMASK(23, 0)
#define RCC_PLL7CFGR3_FRACIN_SHIFT		0
#define RCC_PLL7CFGR3_DOWNSPREAD		BIT(24)
#define RCC_PLL7CFGR3_DACEN			BIT(25)
#define RCC_PLL7CFGR3_SSCGDIS			BIT(26)

/* RCC_PLL7CFGR4 register fields */
#define RCC_PLL7CFGR4_DSMEN			BIT(8)
#define RCC_PLL7CFGR4_FOUTPOSTDIVEN		BIT(9)
#define RCC_PLL7CFGR4_BYPASS			BIT(10)

/* RCC_PLL7CFGR5 register fields */
#define RCC_PLL7CFGR5_DIVVAL_MASK		GENMASK(3, 0)
#define RCC_PLL7CFGR5_DIVVAL_SHIFT		0
#define RCC_PLL7CFGR5_SPREAD_MASK		GENMASK(20, 16)
#define RCC_PLL7CFGR5_SPREAD_SHIFT		16

/* RCC_PLL7CFGR6 register fields */
#define RCC_PLL7CFGR6_POSTDIV1_MASK		GENMASK(2, 0)
#define RCC_PLL7CFGR6_POSTDIV1_SHIFT		0

/* RCC_PLL7CFGR7 register fields */
#define RCC_PLL7CFGR7_POSTDIV2_MASK		GENMASK(2, 0)
#define RCC_PLL7CFGR7_POSTDIV2_SHIFT		0

/* RCC_PLL8CFGR1 register fields */
#define RCC_PLL8CFGR1_SSMODRST			BIT(0)
#define RCC_PLL8CFGR1_PLLEN			BIT(8)
#define RCC_PLL8CFGR1_PLLRDY			BIT(24)
#define RCC_PLL8CFGR1_CKREFST			BIT(28)

/* RCC_PLL8CFGR2 register fields */
#define RCC_PLL8CFGR2_FREFDIV_MASK		GENMASK(5, 0)
#define RCC_PLL8CFGR2_FREFDIV_SHIFT		0
#define RCC_PLL8CFGR2_FBDIV_MASK		GENMASK(27, 16)
#define RCC_PLL8CFGR2_FBDIV_SHIFT		16

/* RCC_PLL8CFGR3 register fields */
#define RCC_PLL8CFGR3_FRACIN_MASK		GENMASK(23, 0)
#define RCC_PLL8CFGR3_FRACIN_SHIFT		0
#define RCC_PLL8CFGR3_DOWNSPREAD		BIT(24)
#define RCC_PLL8CFGR3_DACEN			BIT(25)
#define RCC_PLL8CFGR3_SSCGDIS			BIT(26)

/* RCC_PLL8CFGR4 register fields */
#define RCC_PLL8CFGR4_DSMEN			BIT(8)
#define RCC_PLL8CFGR4_FOUTPOSTDIVEN		BIT(9)
#define RCC_PLL8CFGR4_BYPASS			BIT(10)

/* RCC_PLL8CFGR5 register fields */
#define RCC_PLL8CFGR5_DIVVAL_MASK		GENMASK(3, 0)
#define RCC_PLL8CFGR5_DIVVAL_SHIFT		0
#define RCC_PLL8CFGR5_SPREAD_MASK		GENMASK(20, 16)
#define RCC_PLL8CFGR5_SPREAD_SHIFT		16

/* RCC_PLL8CFGR6 register fields */
#define RCC_PLL8CFGR6_POSTDIV1_MASK		GENMASK(2, 0)
#define RCC_PLL8CFGR6_POSTDIV1_SHIFT		0

/* RCC_PLL8CFGR7 register fields */
#define RCC_PLL8CFGR7_POSTDIV2_MASK		GENMASK(2, 0)
#define RCC_PLL8CFGR7_POSTDIV2_SHIFT		0

/* RCC_PLLxCFGR1 register fields */
#define RCC_PLLxCFGR1_SSMODRST			BIT(0)
#define RCC_PLLxCFGR1_PLLEN			BIT(8)
#define RCC_PLLxCFGR1_PLLRDY			BIT(24)
#define RCC_PLLxCFGR1_CKREFST			BIT(28)

/* RCC_PLLxCFGR2 register fields */
#define RCC_PLLxCFGR2_FREFDIV_MASK		GENMASK(5, 0)
#define RCC_PLLxCFGR2_FREFDIV_SHIFT		0
#define RCC_PLLxCFGR2_FBDIV_MASK		GENMASK(27, 16)
#define RCC_PLLxCFGR2_FBDIV_SHIFT		16

/* RCC_PLLxCFGR3 register fields */
#define RCC_PLLxCFGR3_FRACIN_MASK		GENMASK(23, 0)
#define RCC_PLLxCFGR3_FRACIN_SHIFT		0
#define RCC_PLLxCFGR3_DOWNSPREAD		BIT(24)
#define RCC_PLLxCFGR3_DACEN			BIT(25)
#define RCC_PLLxCFGR3_SSCGDIS			BIT(26)

/* RCC_PLLxCFGR4 register fields */
#define RCC_PLLxCFGR4_DSMEN			BIT(8)
#define RCC_PLLxCFGR4_FOUTPOSTDIVEN		BIT(9)
#define RCC_PLLxCFGR4_BYPASS			BIT(10)

/* RCC_PLLxCFGR5 register fields */
#define RCC_PLLxCFGR5_DIVVAL_MASK		GENMASK(3, 0)
#define RCC_PLLxCFGR5_DIVVAL_SHIFT		0
#define RCC_PLLxCFGR5_SPREAD_MASK		GENMASK(20, 16)
#define RCC_PLLxCFGR5_SPREAD_SHIFT		16

/* RCC_PLLxCFGR6 register fields */
#define RCC_PLLxCFGR6_POSTDIV1_MASK		GENMASK(2, 0)
#define RCC_PLLxCFGR6_POSTDIV1_SHIFT		0

/* RCC_PLLxCFGR7 register fields */
#define RCC_PLLxCFGR7_POSTDIV2_MASK		GENMASK(2, 0)
#define RCC_PLLxCFGR7_POSTDIV2_SHIFT		0

/* RCC_VERR register fields */
#define RCC_VERR_MINREV_MASK			GENMASK(3, 0)
#define RCC_VERR_MINREV_SHIFT			0
#define RCC_VERR_MAJREV_MASK			GENMASK(7, 4)
#define RCC_VERR_MAJREV_SHIFT			4

#endif /* STM32MP2_RCC_H */
